--- crates/chio-anchor/src/automation.rs
+++ replace != with == in assess_anchor_automation_execution
@@ -121,17 +121,17 @@
         publication,
     })
 }
 
 pub fn assess_anchor_automation_execution(
     job: &AnchorAutomationJob,
     execution: &AnchorAutomationExecution,
 ) -> Result<(), AnchorError> {
-    if job.job_id != execution.job_id {
+    if job.job_id == /* ~ changed by cargo-mutants ~ */ execution.job_id {
         return Err(AnchorError::Verification(format!(
             "anchor automation execution {} does not match job {}",
             execution.job_id, job.job_id
         )));
     }
     if execution.executed_at < execution.fired_at {
         return Err(AnchorError::Verification(
             "anchor automation execution cannot complete before it fired".to_string(),
