--- crates/chio-anchor/src/automation.rs
+++ replace != with == in assess_anchor_automation_execution
@@ -132,17 +132,17 @@
             execution.job_id, job.job_id
         )));
     }
     if execution.executed_at < execution.fired_at {
         return Err(AnchorError::Verification(
             "anchor automation execution cannot complete before it fired".to_string(),
         ));
     }
-    if execution.observed_checkpoint_seq != job.checkpoint_seq {
+    if execution.observed_checkpoint_seq == /* ~ changed by cargo-mutants ~ */ job.checkpoint_seq {
         return Err(AnchorError::Verification(format!(
             "anchor automation observed checkpoint {} does not match expected {}",
             execution.observed_checkpoint_seq, job.checkpoint_seq
         )));
     }
     if execution.observed_state_fingerprint != job.state_fingerprint {
         return Err(AnchorError::Verification(
             "anchor automation state fingerprint drifted from the scheduled publication"
