--- crates/chio-anchor/src/automation.rs
+++ replace && with || in assess_anchor_automation_execution
@@ -160,17 +160,17 @@
     }
     if execution.duplicate_suppressed
         && execution.outcome != AnchorAutomationExecutionOutcome::DuplicateSuppressed
     {
         return Err(AnchorError::Verification(
             "duplicate suppression must be reported explicitly".to_string(),
         ));
     }
-    if job.operator_override_required && !execution.operator_override_used {
+    if job.operator_override_required || /* ~ changed by cargo-mutants ~ */ !execution.operator_override_used {
         return Err(AnchorError::Verification(
             "delegate-driven anchor automation must record operator override availability"
                 .to_string(),
         ));
     }
     Ok(())
 }
 
