--- crates/chio-anchor/src/automation.rs
+++ replace == with != in build_anchor_publication_job
@@ -70,17 +70,17 @@
     publication: PreparedEvmRootPublication,
     delegate_registration: Option<PreparedDelegateRegistration>,
 ) -> Result<AnchorAutomationJob, AnchorError> {
     if cron_expression.trim().is_empty() {
         return Err(AnchorError::InvalidInput(
             "anchor automation cron expression is required".to_string(),
         ));
     }
-    if replay_window_secs == 0 {
+    if replay_window_secs != /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(AnchorError::InvalidInput(
             "anchor automation replay window must be non-zero".to_string(),
         ));
     }
 
     let state_fingerprint = sha256(
         format!(
             "{}:{}:{}:{}",
