--- crates/chio-anchor/src/bitcoin.rs
+++ replace != with == in verify_ots_proof_for_submission
@@ -125,17 +125,17 @@
 }
 
 pub fn verify_ots_proof_for_submission(
     submission: &PreparedOtsSubmission,
     ots_proof_b64: &str,
     expected_bitcoin_height: Option<u64>,
 ) -> Result<ParsedOtsProof, AnchorError> {
     let inspection = inspect_ots_proof(ots_proof_b64)?;
-    if inspection.digest_algorithm != submission.document_hash_algorithm {
+    if inspection.digest_algorithm == /* ~ changed by cargo-mutants ~ */ submission.document_hash_algorithm {
         return Err(AnchorError::Verification(format!(
             "OTS digest algorithm {} does not match expected {}",
             inspection.digest_algorithm, submission.document_hash_algorithm
         )));
     }
     if inspection.start_digest != submission.document_digest.to_hex_prefixed() {
         return Err(AnchorError::Verification(
             "OTS proof does not commit to the expected Chio super-root document digest".to_string(),
