--- crates/chio-anchor/src/bitcoin.rs
+++ replace < with > in verify_bitcoin_anchor_for_proof
@@ -175,17 +175,17 @@
         ));
     }
 
     let super_root = proof.super_root_inclusion.as_ref().ok_or_else(|| {
         AnchorError::Verification(
             "Bitcoin anchor verification requires super-root inclusion metadata".to_string(),
         )
     })?;
-    if proof.checkpoint_statement.checkpoint_seq < super_root.aggregated_checkpoint_start
+    if proof.checkpoint_statement.checkpoint_seq > /* ~ changed by cargo-mutants ~ */ super_root.aggregated_checkpoint_start
         || proof.checkpoint_statement.checkpoint_seq > super_root.aggregated_checkpoint_end
     {
         return Err(AnchorError::Verification(format!(
             "checkpoint {} falls outside aggregated Bitcoin super-root range {}-{}",
             proof.checkpoint_statement.checkpoint_seq,
             super_root.aggregated_checkpoint_start,
             super_root.aggregated_checkpoint_end
         )));
