--- crates/chio-anchor/src/bitcoin.rs
+++ replace attach_bitcoin_anchor -> Result<AnchorInclusionProof, AnchorError> with Ok(Default::default())
@@ -218,62 +218,17 @@
 
 pub fn attach_bitcoin_anchor(
     proof: &AnchorInclusionProof,
     submission: &PreparedOtsSubmission,
     bitcoin_block_height: u64,
     bitcoin_block_hash: String,
     ots_proof_b64: String,
 ) -> Result<AnchorInclusionProof, AnchorError> {
-    if ots_proof_b64.trim().is_empty() {
-        return Err(AnchorError::InvalidInput(
-            "OTS proof payload must be non-empty".to_string(),
-        ));
-    }
-    verify_ots_proof_for_submission(submission, &ots_proof_b64, Some(bitcoin_block_height))?;
-    let checkpoint_index = submission
-        .checkpoint_seqs
-        .iter()
-        .position(|seq| *seq == proof.checkpoint_statement.checkpoint_seq)
-        .ok_or_else(|| {
-            AnchorError::Verification(format!(
-                "checkpoint {} is not part of the aggregated Bitcoin submission",
-                proof.checkpoint_statement.checkpoint_seq
-            ))
-        })?;
-    let checkpoint_root = submission
-        .checkpoint_roots
-        .get(checkpoint_index)
-        .ok_or_else(|| AnchorError::Verification("checkpoint root missing".to_string()))?;
-    if checkpoint_root != &proof.checkpoint_statement.merkle_root {
-        return Err(AnchorError::Verification(
-            "aggregated Bitcoin submission root does not match the checkpoint root".to_string(),
-        ));
-    }
-
-    let tree = MerkleTree::from_hashes(submission.checkpoint_roots.clone())
-        .map_err(|error| AnchorError::Verification(error.to_string()))?;
-    let inclusion = tree
-        .inclusion_proof(checkpoint_index)
-        .map_err(|error| AnchorError::Verification(error.to_string()))?;
-
-    let mut upgraded = proof.clone();
-    upgraded.super_root_inclusion = Some(Web3SuperRootInclusion {
-        super_root: submission.super_root,
-        proof: inclusion,
-        aggregated_checkpoint_start: submission.aggregated_checkpoint_start,
-        aggregated_checkpoint_end: submission.aggregated_checkpoint_end,
-    });
-    upgraded.bitcoin_anchor = Some(Web3BitcoinAnchor {
-        method: "opentimestamps".to_string(),
-        ots_proof_b64,
-        bitcoin_block_height,
-        bitcoin_block_hash,
-    });
-    Ok(upgraded)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn collect_attestations(
     step: &Step,
     bitcoin_attestation_heights: &mut Vec<u64>,
     pending_calendars: &mut Vec<String>,
 ) {
     if let StepData::Attestation(attestation) = &step.data {
