--- crates/chio-anchor/src/bitcoin.rs
+++ replace == with != in attach_bitcoin_anchor
@@ -227,17 +227,17 @@
         return Err(AnchorError::InvalidInput(
             "OTS proof payload must be non-empty".to_string(),
         ));
     }
     verify_ots_proof_for_submission(submission, &ots_proof_b64, Some(bitcoin_block_height))?;
     let checkpoint_index = submission
         .checkpoint_seqs
         .iter()
-        .position(|seq| *seq == proof.checkpoint_statement.checkpoint_seq)
+        .position(|seq| *seq != /* ~ changed by cargo-mutants ~ */ proof.checkpoint_statement.checkpoint_seq)
         .ok_or_else(|| {
             AnchorError::Verification(format!(
                 "checkpoint {} is not part of the aggregated Bitcoin submission",
                 proof.checkpoint_statement.checkpoint_seq
             ))
         })?;
     let checkpoint_root = submission
         .checkpoint_roots
