--- crates/chio-anchor/src/bitcoin.rs
+++ replace inspect_ots_proof -> Result<ParsedOtsProof, AnchorError> with Ok(Default::default())
@@ -91,42 +91,17 @@
         aggregated_checkpoint_end: *aggregated_checkpoint_end,
         checkpoint_seqs,
         checkpoint_roots,
         super_root,
     })
 }
 
 pub fn inspect_ots_proof(ots_proof_b64: &str) -> Result<ParsedOtsProof, AnchorError> {
-    let bytes = BASE64_STANDARD.decode(ots_proof_b64).map_err(|error| {
-        AnchorError::InvalidInput(format!("invalid OTS base64 payload: {error}"))
-    })?;
-    let detached = DetachedTimestampFile::from_reader(bytes.as_slice())
-        .map_err(|error| AnchorError::Verification(format!("invalid OTS payload: {error}")))?;
-
-    let mut bitcoin_attestation_heights = Vec::new();
-    let mut pending_calendars = Vec::new();
-    collect_attestations(
-        &detached.timestamp.first_step,
-        &mut bitcoin_attestation_heights,
-        &mut pending_calendars,
-    );
-
-    Ok(ParsedOtsProof {
-        schema: "chio.anchor.ots-proof-inspection.v1".to_string(),
-        digest_algorithm: match detached.digest_type {
-            DigestType::Sha1 => "sha1",
-            DigestType::Sha256 => "sha256",
-            DigestType::Ripemd160 => "ripemd160",
-        }
-        .to_string(),
-        start_digest: format!("0x{}", hex::encode(detached.timestamp.start_digest)),
-        bitcoin_attestation_heights,
-        pending_calendars,
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn verify_ots_proof_for_submission(
     submission: &PreparedOtsSubmission,
     ots_proof_b64: &str,
     expected_bitcoin_height: Option<u64>,
 ) -> Result<ParsedOtsProof, AnchorError> {
     let inspection = inspect_ots_proof(ots_proof_b64)?;
