--- crates/chio-anchor/src/bundle.rs
+++ replace verify_checkpoint_publication_records -> Result<(), AnchorError> with Ok(())
@@ -139,37 +139,10 @@
         verified: true,
         lanes,
     })
 }
 
 pub fn verify_checkpoint_publication_records(
     transparency: &CheckpointTransparencySummary,
 ) -> Result<(), AnchorError> {
-    if let Some(equivocation) = transparency.equivocations.first() {
-        return Err(AnchorError::Verification(format!(
-            "checkpoint publication conflict detected: {}",
-            describe_checkpoint_equivocation(equivocation)
-        )));
-    }
-
-    for publication in &transparency.publications {
-        if let Some(binding) = publication.trust_anchor_binding.as_ref() {
-            binding
-                .validate()
-                .map_err(|error| AnchorError::Verification(error.to_string()))?;
-            continue;
-        }
-
-        let has_successor_witness = transparency.witnesses.iter().any(|witness| {
-            witness.log_id == publication.log_id
-                && witness.checkpoint_seq == publication.checkpoint_seq
-        });
-        if !has_successor_witness {
-            return Err(AnchorError::Verification(format!(
-                "checkpoint publication {} requires a trust-anchor binding or successor witness",
-                publication.checkpoint_seq
-            )));
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
