--- crates/chio-anchor/src/bundle.rs
+++ delete ! in verify_checkpoint_publication_records
@@ -158,17 +158,17 @@
                 .map_err(|error| AnchorError::Verification(error.to_string()))?;
             continue;
         }
 
         let has_successor_witness = transparency.witnesses.iter().any(|witness| {
             witness.log_id == publication.log_id
                 && witness.checkpoint_seq == publication.checkpoint_seq
         });
-        if !has_successor_witness {
+        if  /* ~ changed by cargo-mutants ~ */has_successor_witness {
             return Err(AnchorError::Verification(format!(
                 "checkpoint publication {} requires a trust-anchor binding or successor witness",
                 publication.checkpoint_seq
             )));
         }
     }
 
     Ok(())
