--- crates/chio-anchor/src/bundle.rs
+++ replace != with == in verify_proof_bundle
@@ -41,17 +41,17 @@
 pub struct AnchorVerificationReport {
     pub verified: bool,
     pub lanes: Vec<AnchorVerificationLane>,
 }
 
 pub fn verify_proof_bundle(
     bundle: &AnchorProofBundle,
 ) -> Result<AnchorVerificationReport, AnchorError> {
-    if bundle.schema != CHIO_ANCHOR_PROOF_BUNDLE_SCHEMA {
+    if bundle.schema == /* ~ changed by cargo-mutants ~ */ CHIO_ANCHOR_PROOF_BUNDLE_SCHEMA {
         return Err(AnchorError::Verification(format!(
             "unsupported bundle schema {}",
             bundle.schema
         )));
     }
     if bundle.secondary_lanes.is_empty() {
         return Err(AnchorError::Verification(
             "proof bundle must declare at least one lane".to_string(),
