--- crates/chio-anchor/src/bundle.rs
+++ replace verify_proof_bundle -> Result<AnchorVerificationReport, AnchorError> with Ok(Default::default())
@@ -41,109 +41,17 @@
 pub struct AnchorVerificationReport {
     pub verified: bool,
     pub lanes: Vec<AnchorVerificationLane>,
 }
 
 pub fn verify_proof_bundle(
     bundle: &AnchorProofBundle,
 ) -> Result<AnchorVerificationReport, AnchorError> {
-    if bundle.schema != CHIO_ANCHOR_PROOF_BUNDLE_SCHEMA {
-        return Err(AnchorError::Verification(format!(
-            "unsupported bundle schema {}",
-            bundle.schema
-        )));
-    }
-    if bundle.secondary_lanes.is_empty() {
-        return Err(AnchorError::Verification(
-            "proof bundle must declare at least one lane".to_string(),
-        ));
-    }
-    if bundle.secondary_lanes.contains(&AnchorLaneKind::EvmPrimary) {
-        return Err(AnchorError::Verification(
-            "proof bundle secondary lanes must not declare the primary EVM lane".to_string(),
-        ));
-    }
-
-    let mut lanes = Vec::new();
-    verify_anchor_inclusion_proof(&bundle.primary_proof)
-        .map_err(|error| AnchorError::Verification(error.to_string()))?;
-    lanes.push(AnchorVerificationLane {
-        lane: AnchorLaneKind::EvmPrimary,
-        verified: true,
-        note: "primary EVM proof verified against Chio receipt and checkpoint truth".to_string(),
-    });
-
-    if bundle.primary_proof.bitcoin_anchor.is_some() {
-        if !bundle.secondary_lanes.contains(&AnchorLaneKind::BitcoinOts) {
-            return Err(AnchorError::Verification(
-                "bundle includes Bitcoin anchor data but does not declare the Bitcoin OTS lane"
-                    .to_string(),
-            ));
-        }
-        let inspection = verify_bitcoin_anchor_for_proof(&bundle.primary_proof)?;
-        // The `is_some()` guard above already proved bitcoin_anchor is
-        // present, so the `.as_ref()` map is the live branch in
-        // practice; the inspection-derived fallback exists only so this
-        // expression is total without panicking on direct indexing.
-        let bitcoin_height = match bundle
-            .primary_proof
-            .bitcoin_anchor
-            .as_ref()
-            .map(|anchor| anchor.bitcoin_block_height)
-        {
-            Some(height) => height,
-            None => match inspection.bitcoin_attestation_heights.first().copied() {
-                Some(height) => height,
-                None => {
-                    return Err(AnchorError::Verification(
-                        "OTS proof has no Bitcoin attestation height to record".to_string(),
-                    ));
-                }
-            },
-        };
-        lanes.push(AnchorVerificationLane {
-            lane: AnchorLaneKind::BitcoinOts,
-            verified: true,
-            note: format!(
-                "secondary Bitcoin OTS linkage commits to the Chio super-root digest and attests block {}",
-                bitcoin_height
-            ),
-        });
-    } else if bundle.secondary_lanes.contains(&AnchorLaneKind::BitcoinOts) {
-        return Err(AnchorError::Verification(
-            "bundle declares Bitcoin OTS lane but the primary proof lacks bitcoin anchor data"
-                .to_string(),
-        ));
-    }
-
-    if let Some(solana) = bundle.solana_anchor.as_ref() {
-        if !bundle.secondary_lanes.contains(&AnchorLaneKind::SolanaMemo) {
-            return Err(AnchorError::Verification(
-                "bundle includes Solana anchor data but does not declare the Solana memo lane"
-                    .to_string(),
-            ));
-        }
-        verify_solana_anchor(&bundle.primary_proof, solana)?;
-        lanes.push(AnchorVerificationLane {
-            lane: AnchorLaneKind::SolanaMemo,
-            verified: true,
-            note: "secondary Solana memo anchor matches the canonical checkpoint payload"
-                .to_string(),
-        });
-    } else if bundle.secondary_lanes.contains(&AnchorLaneKind::SolanaMemo) {
-        return Err(AnchorError::Verification(
-            "bundle declares Solana lane but does not include a Solana anchor record".to_string(),
-        ));
-    }
-
-    Ok(AnchorVerificationReport {
-        verified: true,
-        lanes,
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn verify_checkpoint_publication_records(
     transparency: &CheckpointTransparencySummary,
 ) -> Result<(), AnchorError> {
     if let Some(equivocation) = transparency.equivocations.first() {
         return Err(AnchorError::Verification(format!(
             "checkpoint publication conflict detected: {}",
