--- crates/chio-anchor/src/discovery.rs
+++ delete ! in build_anchor_discovery_artifact
@@ -130,17 +130,17 @@
 }
 
 pub fn build_anchor_discovery_artifact(
     config: &AnchorServiceConfig,
     binding: &SignedWeb3IdentityBinding,
 ) -> Result<AnchorDiscoveryArtifact, AnchorError> {
     verify_web3_identity_binding(binding)
         .map_err(|error| AnchorError::InvalidBinding(error.to_string()))?;
-    if !binding
+    if  /* ~ changed by cargo-mutants ~ */binding
         .certificate
         .purpose
         .contains(&Web3KeyBindingPurpose::Anchor)
     {
         return Err(AnchorError::InvalidBinding(
             "binding certificate does not include anchor purpose".to_string(),
         ));
     }
