--- crates/chio-anchor/src/discovery.rs
+++ replace != with == in build_anchor_discovery_artifact
@@ -149,17 +149,17 @@
     let chains: Vec<AnchorDiscoveryChain> = config
         .evm_targets
         .iter()
         .map(|target| AnchorDiscoveryChain {
             chain_id: target.chain_id.clone(),
             contract_address: target.contract_address.clone(),
             operator_address: target.operator_address.clone(),
             publisher_address: target.publisher_address.clone(),
-            requires_delegate_authorization: target.publisher_address != target.operator_address,
+            requires_delegate_authorization: target.publisher_address == /* ~ changed by cargo-mutants ~ */ target.operator_address,
         })
         .collect();
     let root_publication_ownership = config
         .evm_targets
         .iter()
         .map(|target| RootPublicationOwnership {
             chain_id: target.chain_id.clone(),
             root_owner_address: target.operator_address.clone(),
