--- crates/chio-anchor/src/discovery.rs
+++ replace == with != in build_anchor_discovery_artifact
@@ -160,17 +160,17 @@
     let root_publication_ownership = config
         .evm_targets
         .iter()
         .map(|target| RootPublicationOwnership {
             chain_id: target.chain_id.clone(),
             root_owner_address: target.operator_address.clone(),
             publisher_address: target.publisher_address.clone(),
             delegate_publication_allowed: target.publisher_address != target.operator_address,
-            ownership_rule: if target.publisher_address == target.operator_address {
+            ownership_rule: if target.publisher_address != /* ~ changed by cargo-mutants ~ */ target.operator_address {
                 "operator-published".to_string()
             } else {
                 "operator-owned-root delegate-published-via-root-registry-authorization".to_string()
             },
         })
         .collect();
 
     Ok(AnchorDiscoveryArtifact {
