--- crates/chio-anchor/src/discovery.rs
+++ replace verify_proof_bundle_with_discovery -> Result<AnchorVerificationReport, AnchorError> with Ok(Default::default())
@@ -194,75 +194,17 @@
         root_publication_ownership,
     })
 }
 
 pub fn verify_proof_bundle_with_discovery(
     bundle: &AnchorProofBundle,
     discovery: &AnchorDiscoveryArtifact,
 ) -> Result<AnchorVerificationReport, AnchorError> {
-    let report = verify_proof_bundle(bundle)?;
-    let bundle_binding = &bundle.primary_proof.key_binding_certificate.certificate;
-    let discovery_binding = &discovery.operator_binding.certificate;
-    if bundle_binding.chio_identity != discovery_binding.chio_identity
-        || bundle_binding.chio_public_key != discovery_binding.chio_public_key
-        || bundle_binding.settlement_address != discovery_binding.settlement_address
-    {
-        return Err(AnchorError::Verification(
-            "proof bundle binding does not match the discovery operator binding".to_string(),
-        ));
-    }
-
-    let policy = discovery
-        .service
-        .service_endpoint
-        .publication_policy
-        .as_ref()
-        .ok_or_else(|| {
-            AnchorError::Verification(
-                "discovery artifact is missing publication policy".to_string(),
-            )
-        })?;
-    let freshness = discovery
-        .service
-        .service_endpoint
-        .current_freshness
-        .as_ref()
-        .ok_or_else(|| {
-            AnchorError::Verification(
-                "discovery artifact is missing current freshness state".to_string(),
-            )
-        })?;
-
-    if matches!(
-        freshness.status,
-        AnchorDiscoveryFreshnessStatus::Paused | AnchorDiscoveryFreshnessStatus::Stale
-    ) {
-        return Err(AnchorError::Verification(format!(
-            "discovery freshness state {} does not permit bundle verification",
-            freshness_status_label(freshness.status)
-        )));
-    }
-
-    if policy.requires_witness_or_immutable_anchor_reference && policy.secondary_lanes.is_empty() {
-        return Err(AnchorError::Verification(
-            "discovery policy requires witness or immutable anchor support but declares no secondary lanes".to_string(),
-        ));
-    }
-
-    let actual_lanes = normalized_lane_labels(&bundle.secondary_lanes);
-    let expected_lanes = normalized_lane_labels(&policy.secondary_lanes);
-    if actual_lanes != expected_lanes {
-        return Err(AnchorError::Verification(format!(
-            "proof bundle secondary lanes {:?} do not match discovery policy {:?}",
-            actual_lanes, expected_lanes
-        )));
-    }
-
-    Ok(report)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_binding_covers_targets(
     config: &AnchorServiceConfig,
     binding: &SignedWeb3IdentityBinding,
 ) -> Result<(), AnchorError> {
     for target in &config.evm_targets {
         if !binding
