--- crates/chio-anchor/src/discovery.rs
+++ replace || with && in verify_proof_bundle_with_discovery
@@ -199,17 +199,17 @@
     bundle: &AnchorProofBundle,
     discovery: &AnchorDiscoveryArtifact,
 ) -> Result<AnchorVerificationReport, AnchorError> {
     let report = verify_proof_bundle(bundle)?;
     let bundle_binding = &bundle.primary_proof.key_binding_certificate.certificate;
     let discovery_binding = &discovery.operator_binding.certificate;
     if bundle_binding.chio_identity != discovery_binding.chio_identity
         || bundle_binding.chio_public_key != discovery_binding.chio_public_key
-        || bundle_binding.settlement_address != discovery_binding.settlement_address
+        && /* ~ changed by cargo-mutants ~ */ bundle_binding.settlement_address != discovery_binding.settlement_address
     {
         return Err(AnchorError::Verification(
             "proof bundle binding does not match the discovery operator binding".to_string(),
         ));
     }
 
     let policy = discovery
         .service
