--- crates/chio-anchor/src/discovery.rs
+++ replace validate_binding_covers_targets -> Result<(), AnchorError> with Ok(())
@@ -259,36 +259,17 @@
 
     Ok(report)
 }
 
 fn validate_binding_covers_targets(
     config: &AnchorServiceConfig,
     binding: &SignedWeb3IdentityBinding,
 ) -> Result<(), AnchorError> {
-    for target in &config.evm_targets {
-        if !binding
-            .certificate
-            .chain_scope
-            .iter()
-            .any(|chain| chain == &target.chain_id)
-        {
-            return Err(AnchorError::InvalidBinding(format!(
-                "binding certificate does not cover {}",
-                target.chain_id
-            )));
-        }
-        if binding.certificate.settlement_address != target.operator_address {
-            return Err(AnchorError::InvalidBinding(format!(
-                "binding settlement address {} does not match operator address {} for {}",
-                binding.certificate.settlement_address, target.operator_address, target.chain_id
-            )));
-        }
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn build_anchor_discovery_artifact_with_runtime(
     config: &AnchorServiceConfig,
     binding: &SignedWeb3IdentityBinding,
     runtime_report: &AnchorRuntimeReport,
     freshness_window_secs: u64,
 ) -> Result<AnchorDiscoveryArtifact, AnchorError> {
