--- crates/chio-anchor/src/discovery.rs
+++ replace build_publication_policy -> AnchorDiscoveryPublicationPolicy with Default::default()
@@ -310,34 +310,17 @@
     ));
     Ok(artifact)
 }
 
 fn build_publication_policy(
     config: &AnchorServiceConfig,
     runtime_report: &AnchorRuntimeReport,
 ) -> AnchorDiscoveryPublicationPolicy {
-    let mut secondary_lanes = Vec::new();
-    if !config.ots_calendars.is_empty() {
-        secondary_lanes.push(AnchorLaneKind::BitcoinOts);
-    }
-    if config.solana_cluster.is_some() {
-        secondary_lanes.push(AnchorLaneKind::SolanaMemo);
-    }
-    AnchorDiscoveryPublicationPolicy {
-        primary_lane: AnchorLaneKind::EvmPrimary,
-        secondary_lanes,
-        requires_trust_anchor_binding: true,
-        requires_witness_or_immutable_anchor_reference: true,
-        delegate_publication_allowed: config
-            .evm_targets
-            .iter()
-            .any(|target| target.publisher_address != target.operator_address),
-        emergency_mode: runtime_report.controls.mode,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn build_chain_runtime_states(
     config: &AnchorServiceConfig,
     runtime_report: &AnchorRuntimeReport,
     freshness_window_secs: u64,
 ) -> Vec<AnchorDiscoveryChainRuntimeState> {
     config
