--- crates/chio-anchor/src/discovery.rs
+++ delete ! in build_publication_policy
@@ -311,17 +311,17 @@
     Ok(artifact)
 }
 
 fn build_publication_policy(
     config: &AnchorServiceConfig,
     runtime_report: &AnchorRuntimeReport,
 ) -> AnchorDiscoveryPublicationPolicy {
     let mut secondary_lanes = Vec::new();
-    if !config.ots_calendars.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */config.ots_calendars.is_empty() {
         secondary_lanes.push(AnchorLaneKind::BitcoinOts);
     }
     if config.solana_cluster.is_some() {
         secondary_lanes.push(AnchorLaneKind::SolanaMemo);
     }
     AnchorDiscoveryPublicationPolicy {
         primary_lane: AnchorLaneKind::EvmPrimary,
         secondary_lanes,
