--- crates/chio-anchor/src/discovery.rs
+++ replace != with == in build_publication_policy
@@ -325,17 +325,17 @@
     AnchorDiscoveryPublicationPolicy {
         primary_lane: AnchorLaneKind::EvmPrimary,
         secondary_lanes,
         requires_trust_anchor_binding: true,
         requires_witness_or_immutable_anchor_reference: true,
         delegate_publication_allowed: config
             .evm_targets
             .iter()
-            .any(|target| target.publisher_address != target.operator_address),
+            .any(|target| target.publisher_address == /* ~ changed by cargo-mutants ~ */ target.operator_address),
         emergency_mode: runtime_report.controls.mode,
     }
 }
 
 fn build_chain_runtime_states(
     config: &AnchorServiceConfig,
     runtime_report: &AnchorRuntimeReport,
     freshness_window_secs: u64,
