--- crates/chio-anchor/src/discovery.rs
+++ replace build_chain_runtime_states -> Vec<AnchorDiscoveryChainRuntimeState> with vec![Default::default()]
@@ -335,30 +335,17 @@
     }
 }
 
 fn build_chain_runtime_states(
     config: &AnchorServiceConfig,
     runtime_report: &AnchorRuntimeReport,
     freshness_window_secs: u64,
 ) -> Vec<AnchorDiscoveryChainRuntimeState> {
-    config
-        .evm_targets
-        .iter()
-        .map(|target| {
-            let lane = select_primary_lane_for_chain(config, runtime_report, &target.chain_id);
-            build_chain_runtime_state(
-                runtime_report,
-                freshness_window_secs,
-                &target.chain_id,
-                AnchorLaneKind::EvmPrimary,
-                lane,
-            )
-        })
-        .collect()
+    vec![Default::default()] /* ~ changed by cargo-mutants ~ */
 }
 
 fn select_primary_lane_for_chain<'a>(
     config: &AnchorServiceConfig,
     runtime_report: &'a AnchorRuntimeReport,
     chain_id: &str,
 ) -> Option<&'a crate::AnchorLaneRuntimeStatus> {
     runtime_report
