--- crates/chio-anchor/src/discovery.rs
+++ replace == with != in select_primary_lane_for_chain
@@ -360,17 +360,17 @@
     config: &AnchorServiceConfig,
     runtime_report: &'a AnchorRuntimeReport,
     chain_id: &str,
 ) -> Option<&'a crate::AnchorLaneRuntimeStatus> {
     runtime_report
         .lanes
         .iter()
         .find(|lane| {
-            lane.lane == AnchorLaneKind::EvmPrimary && lane.chain_id.as_deref() == Some(chain_id)
+            lane.lane != /* ~ changed by cargo-mutants ~ */ AnchorLaneKind::EvmPrimary && lane.chain_id.as_deref() == Some(chain_id)
         })
         .or_else(|| {
             (config.evm_targets.len() == 1)
                 .then(|| {
                     runtime_report
                         .lanes
                         .iter()
                         .find(|lane| lane.lane == AnchorLaneKind::EvmPrimary)
