--- crates/chio-anchor/src/discovery.rs
+++ replace == with != in select_primary_lane_for_chain
@@ -368,17 +368,17 @@
             lane.lane == AnchorLaneKind::EvmPrimary && lane.chain_id.as_deref() == Some(chain_id)
         })
         .or_else(|| {
             (config.evm_targets.len() == 1)
                 .then(|| {
                     runtime_report
                         .lanes
                         .iter()
-                        .find(|lane| lane.lane == AnchorLaneKind::EvmPrimary)
+                        .find(|lane| lane.lane != /* ~ changed by cargo-mutants ~ */ AnchorLaneKind::EvmPrimary)
                 })
                 .flatten()
         })
 }
 
 fn build_chain_runtime_state(
     runtime_report: &AnchorRuntimeReport,
     freshness_window_secs: u64,
