--- crates/chio-anchor/src/discovery.rs
+++ replace build_chain_runtime_state -> AnchorDiscoveryChainRuntimeState with Default::default()
@@ -381,49 +381,17 @@
 
 fn build_chain_runtime_state(
     runtime_report: &AnchorRuntimeReport,
     freshness_window_secs: u64,
     chain_id: &str,
     lane_kind: AnchorLaneKind,
     lane: Option<&crate::AnchorLaneRuntimeStatus>,
 ) -> AnchorDiscoveryChainRuntimeState {
-    let status = classify_discovery_status(
-        runtime_report,
-        freshness_window_secs,
-        lane_kind,
-        Some(chain_id),
-        lane,
-    );
-    let incidents = runtime_report.lane_incidents(lane_kind, Some(chain_id));
-    let incident_codes = incidents
-        .iter()
-        .map(|incident| incident.code.clone())
-        .collect::<Vec<_>>();
-    let note = lane
-        .and_then(|lane| lane.note.clone())
-        .or_else(|| incidents.first().map(|incident| incident.message.clone()));
-
-    AnchorDiscoveryChainRuntimeState {
-        chain_id: chain_id.to_string(),
-        lane: lane_kind,
-        status,
-        checked_at: runtime_report.generated_at,
-        freshness_window_secs,
-        latest_checkpoint_seq: lane.map(|lane| lane.latest_checkpoint_seq).unwrap_or(0),
-        indexed_checkpoint_seq: lane.map(|lane| lane.indexed_checkpoint_seq).unwrap_or(0),
-        reorg_depth: lane.map(|lane| lane.reorg_depth).unwrap_or(0),
-        last_published_at: lane.and_then(|lane| lane.last_published_at),
-        publication_age_secs: lane
-            .and_then(|lane| lane.last_published_at)
-            .and_then(|published_at| runtime_report.generated_at.checked_sub(published_at)),
-        has_active_conflict: runtime_report.lane_has_active_conflict(lane_kind, Some(chain_id)),
-        incident_codes,
-        note,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn aggregate_current_freshness(
     runtime_report: &AnchorRuntimeReport,
     freshness_window_secs: u64,
     chain_runtime: &[AnchorDiscoveryChainRuntimeState],
 ) -> AnchorDiscoveryFreshnessState {
     if let Some(worst) = chain_runtime
