--- crates/chio-anchor/src/discovery.rs
+++ replace aggregate_current_freshness -> AnchorDiscoveryFreshnessState with Default::default()
@@ -421,32 +421,17 @@
     }
 }
 
 fn aggregate_current_freshness(
     runtime_report: &AnchorRuntimeReport,
     freshness_window_secs: u64,
     chain_runtime: &[AnchorDiscoveryChainRuntimeState],
 ) -> AnchorDiscoveryFreshnessState {
-    if let Some(worst) = chain_runtime
-        .iter()
-        .max_by_key(|state| freshness_status_rank(state.status))
-    {
-        return AnchorDiscoveryFreshnessState {
-            status: worst.status,
-            checked_at: worst.checked_at,
-            freshness_window_secs: worst.freshness_window_secs,
-            latest_checkpoint_seq: worst.latest_checkpoint_seq,
-            indexed_checkpoint_seq: worst.indexed_checkpoint_seq,
-            last_published_at: worst.last_published_at,
-            publication_age_secs: worst.publication_age_secs,
-            note: worst.note.clone(),
-        };
-    }
-    build_current_freshness_state(runtime_report, freshness_window_secs)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn build_current_freshness_state(
     runtime_report: &AnchorRuntimeReport,
     freshness_window_secs: u64,
 ) -> AnchorDiscoveryFreshnessState {
     let lane = runtime_report
         .lanes
