--- crates/chio-anchor/src/discovery.rs
+++ replace == with != in build_current_freshness_state
@@ -446,17 +446,17 @@
 
 fn build_current_freshness_state(
     runtime_report: &AnchorRuntimeReport,
     freshness_window_secs: u64,
 ) -> AnchorDiscoveryFreshnessState {
     let lane = runtime_report
         .lanes
         .iter()
-        .find(|lane| lane.lane == AnchorLaneKind::EvmPrimary);
+        .find(|lane| lane.lane != /* ~ changed by cargo-mutants ~ */ AnchorLaneKind::EvmPrimary);
 
     let status = classify_discovery_status(
         runtime_report,
         freshness_window_secs,
         AnchorLaneKind::EvmPrimary,
         lane.and_then(|lane| lane.chain_id.as_deref()),
         lane,
     );
