--- crates/chio-anchor/src/discovery.rs
+++ replace classify_discovery_status -> AnchorDiscoveryFreshnessStatus with Default::default()
@@ -477,57 +477,17 @@
 
 fn classify_discovery_status(
     runtime_report: &AnchorRuntimeReport,
     freshness_window_secs: u64,
     lane_kind: AnchorLaneKind,
     chain_id: Option<&str>,
     lane: Option<&crate::AnchorLaneRuntimeStatus>,
 ) -> AnchorDiscoveryFreshnessStatus {
-    let last_published_at = lane.and_then(|lane| lane.last_published_at);
-    let publication_age_secs = last_published_at
-        .and_then(|published_at| runtime_report.generated_at.checked_sub(published_at));
-    let publication_timestamp_in_future = last_published_at
-        .map(|published_at| published_at > runtime_report.generated_at)
-        .unwrap_or(false);
-    let latest_checkpoint_seq = lane.map(|lane| lane.latest_checkpoint_seq).unwrap_or(0);
-    let indexed_checkpoint_seq = lane.map(|lane| lane.indexed_checkpoint_seq).unwrap_or(0);
-    let lane_status = lane.map(|lane| lane.status);
-    let has_active_conflict = runtime_report.lane_has_active_conflict(lane_kind, chain_id);
-    let lane_is_stale = has_active_conflict
-        || matches!(
-            lane_status,
-            Some(AnchorLaneHealthStatus::Failed | AnchorLaneHealthStatus::Drifted)
-        )
-        || publication_timestamp_in_future
-        || publication_age_secs
-            .map(|age| age > freshness_window_secs)
-            .unwrap_or_else(|| lane.is_some() && last_published_at.is_none());
-    let lane_is_paused = matches!(lane_status, Some(AnchorLaneHealthStatus::Paused));
-    let lane_is_lagging = matches!(
-        lane_status,
-        Some(AnchorLaneHealthStatus::Lagging | AnchorLaneHealthStatus::Recovering)
-    ) || indexed_checkpoint_seq < latest_checkpoint_seq;
-
-    match runtime_report.controls.mode {
-        AnchorEmergencyMode::Normal => match lane {
-            None => AnchorDiscoveryFreshnessStatus::Unknown,
-            Some(_) if lane_is_stale => AnchorDiscoveryFreshnessStatus::Stale,
-            Some(_) if lane_is_paused => AnchorDiscoveryFreshnessStatus::Paused,
-            Some(_) if lane_is_lagging => AnchorDiscoveryFreshnessStatus::Lagging,
-            Some(_) => AnchorDiscoveryFreshnessStatus::Current,
-        },
-        AnchorEmergencyMode::PublishPaused
-        | AnchorEmergencyMode::ProofImportOnly
-        | AnchorEmergencyMode::RecoveryOnly
-        | AnchorEmergencyMode::Halted => match lane {
-            Some(_) if lane_is_stale => AnchorDiscoveryFreshnessStatus::Stale,
-            _ => AnchorDiscoveryFreshnessStatus::Paused,
-        },
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn freshness_status_rank(status: AnchorDiscoveryFreshnessStatus) -> u8 {
     match status {
         AnchorDiscoveryFreshnessStatus::Current => 0,
         AnchorDiscoveryFreshnessStatus::Unknown => 1,
         AnchorDiscoveryFreshnessStatus::Lagging => 2,
         AnchorDiscoveryFreshnessStatus::Paused => 3,
