--- crates/chio-anchor/src/discovery.rs
+++ replace > with == in classify_discovery_status
@@ -494,17 +494,17 @@
     let has_active_conflict = runtime_report.lane_has_active_conflict(lane_kind, chain_id);
     let lane_is_stale = has_active_conflict
         || matches!(
             lane_status,
             Some(AnchorLaneHealthStatus::Failed | AnchorLaneHealthStatus::Drifted)
         )
         || publication_timestamp_in_future
         || publication_age_secs
-            .map(|age| age > freshness_window_secs)
+            .map(|age| age == /* ~ changed by cargo-mutants ~ */ freshness_window_secs)
             .unwrap_or_else(|| lane.is_some() && last_published_at.is_none());
     let lane_is_paused = matches!(lane_status, Some(AnchorLaneHealthStatus::Paused));
     let lane_is_lagging = matches!(
         lane_status,
         Some(AnchorLaneHealthStatus::Lagging | AnchorLaneHealthStatus::Recovering)
     ) || indexed_checkpoint_seq < latest_checkpoint_seq;
 
     match runtime_report.controls.mode {
