--- crates/chio-anchor/src/discovery.rs
+++ replace < with == in classify_discovery_status
@@ -500,17 +500,17 @@
         || publication_timestamp_in_future
         || publication_age_secs
             .map(|age| age > freshness_window_secs)
             .unwrap_or_else(|| lane.is_some() && last_published_at.is_none());
     let lane_is_paused = matches!(lane_status, Some(AnchorLaneHealthStatus::Paused));
     let lane_is_lagging = matches!(
         lane_status,
         Some(AnchorLaneHealthStatus::Lagging | AnchorLaneHealthStatus::Recovering)
-    ) || indexed_checkpoint_seq < latest_checkpoint_seq;
+    ) || indexed_checkpoint_seq == /* ~ changed by cargo-mutants ~ */ latest_checkpoint_seq;
 
     match runtime_report.controls.mode {
         AnchorEmergencyMode::Normal => match lane {
             None => AnchorDiscoveryFreshnessStatus::Unknown,
             Some(_) if lane_is_stale => AnchorDiscoveryFreshnessStatus::Stale,
             Some(_) if lane_is_paused => AnchorDiscoveryFreshnessStatus::Paused,
             Some(_) if lane_is_lagging => AnchorDiscoveryFreshnessStatus::Lagging,
             Some(_) => AnchorDiscoveryFreshnessStatus::Current,
