--- crates/chio-anchor/src/discovery.rs
+++ replace match guard lane_is_stale with false in classify_discovery_status
@@ -505,17 +505,17 @@
     let lane_is_lagging = matches!(
         lane_status,
         Some(AnchorLaneHealthStatus::Lagging | AnchorLaneHealthStatus::Recovering)
     ) || indexed_checkpoint_seq < latest_checkpoint_seq;
 
     match runtime_report.controls.mode {
         AnchorEmergencyMode::Normal => match lane {
             None => AnchorDiscoveryFreshnessStatus::Unknown,
-            Some(_) if lane_is_stale => AnchorDiscoveryFreshnessStatus::Stale,
+            Some(_) if false /* ~ changed by cargo-mutants ~ */ => AnchorDiscoveryFreshnessStatus::Stale,
             Some(_) if lane_is_paused => AnchorDiscoveryFreshnessStatus::Paused,
             Some(_) if lane_is_lagging => AnchorDiscoveryFreshnessStatus::Lagging,
             Some(_) => AnchorDiscoveryFreshnessStatus::Current,
         },
         AnchorEmergencyMode::PublishPaused
         | AnchorEmergencyMode::ProofImportOnly
         | AnchorEmergencyMode::RecoveryOnly
         | AnchorEmergencyMode::Halted => match lane {
