--- crates/chio-anchor/src/discovery.rs
+++ replace match guard lane_is_lagging with true in classify_discovery_status
@@ -507,17 +507,17 @@
         Some(AnchorLaneHealthStatus::Lagging | AnchorLaneHealthStatus::Recovering)
     ) || indexed_checkpoint_seq < latest_checkpoint_seq;
 
     match runtime_report.controls.mode {
         AnchorEmergencyMode::Normal => match lane {
             None => AnchorDiscoveryFreshnessStatus::Unknown,
             Some(_) if lane_is_stale => AnchorDiscoveryFreshnessStatus::Stale,
             Some(_) if lane_is_paused => AnchorDiscoveryFreshnessStatus::Paused,
-            Some(_) if lane_is_lagging => AnchorDiscoveryFreshnessStatus::Lagging,
+            Some(_) if true /* ~ changed by cargo-mutants ~ */ => AnchorDiscoveryFreshnessStatus::Lagging,
             Some(_) => AnchorDiscoveryFreshnessStatus::Current,
         },
         AnchorEmergencyMode::PublishPaused
         | AnchorEmergencyMode::ProofImportOnly
         | AnchorEmergencyMode::RecoveryOnly
         | AnchorEmergencyMode::Halted => match lane {
             Some(_) if lane_is_stale => AnchorDiscoveryFreshnessStatus::Stale,
             _ => AnchorDiscoveryFreshnessStatus::Paused,
