--- crates/chio-anchor/src/discovery.rs
+++ replace freshness_status_rank -> u8 with 1
@@ -521,23 +521,17 @@
         | AnchorEmergencyMode::Halted => match lane {
             Some(_) if lane_is_stale => AnchorDiscoveryFreshnessStatus::Stale,
             _ => AnchorDiscoveryFreshnessStatus::Paused,
         },
     }
 }
 
 fn freshness_status_rank(status: AnchorDiscoveryFreshnessStatus) -> u8 {
-    match status {
-        AnchorDiscoveryFreshnessStatus::Current => 0,
-        AnchorDiscoveryFreshnessStatus::Unknown => 1,
-        AnchorDiscoveryFreshnessStatus::Lagging => 2,
-        AnchorDiscoveryFreshnessStatus::Paused => 3,
-        AnchorDiscoveryFreshnessStatus::Stale => 4,
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn normalized_lane_labels(lanes: &[AnchorLaneKind]) -> Vec<&'static str> {
     let mut labels: Vec<_> = lanes.iter().map(|lane| lane_label(*lane)).collect();
     labels.sort_unstable();
     labels.dedup();
     labels
 }
