--- crates/chio-anchor/src/discovery.rs
+++ replace lane_label -> &'static str with "xyzzy"
@@ -538,21 +538,17 @@
 fn normalized_lane_labels(lanes: &[AnchorLaneKind]) -> Vec<&'static str> {
     let mut labels: Vec<_> = lanes.iter().map(|lane| lane_label(*lane)).collect();
     labels.sort_unstable();
     labels.dedup();
     labels
 }
 
 fn lane_label(lane: AnchorLaneKind) -> &'static str {
-    match lane {
-        AnchorLaneKind::EvmPrimary => "evm_primary",
-        AnchorLaneKind::BitcoinOts => "bitcoin_ots",
-        AnchorLaneKind::SolanaMemo => "solana_memo",
-    }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 fn freshness_status_label(status: AnchorDiscoveryFreshnessStatus) -> &'static str {
     match status {
         AnchorDiscoveryFreshnessStatus::Current => "current",
         AnchorDiscoveryFreshnessStatus::Lagging => "lagging",
         AnchorDiscoveryFreshnessStatus::Stale => "stale",
         AnchorDiscoveryFreshnessStatus::Paused => "paused",
