--- crates/chio-anchor/src/discovery.rs
+++ replace freshness_status_label -> &'static str with ""
@@ -546,23 +546,17 @@
     match lane {
         AnchorLaneKind::EvmPrimary => "evm_primary",
         AnchorLaneKind::BitcoinOts => "bitcoin_ots",
         AnchorLaneKind::SolanaMemo => "solana_memo",
     }
 }
 
 fn freshness_status_label(status: AnchorDiscoveryFreshnessStatus) -> &'static str {
-    match status {
-        AnchorDiscoveryFreshnessStatus::Current => "current",
-        AnchorDiscoveryFreshnessStatus::Lagging => "lagging",
-        AnchorDiscoveryFreshnessStatus::Stale => "stale",
-        AnchorDiscoveryFreshnessStatus::Paused => "paused",
-        AnchorDiscoveryFreshnessStatus::Unknown => "unknown",
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use chio_core::crypto::Keypair;
     use chio_core::web3::{
         verify_web3_identity_binding, SignedWeb3IdentityBinding, Web3IdentityBindingCertificate,
         Web3KeyBindingPurpose, CHIO_KEY_BINDING_CERTIFICATE_SCHEMA,
