--- crates/chio-anchor/src/evm.rs
+++ replace operator_key_hash_hex -> String with "xyzzy".into()
@@ -96,17 +96,17 @@
     message: String,
 }
 
 pub fn operator_key_hash(binding: &SignedWeb3IdentityBinding) -> B256 {
     keccak256(binding.certificate.chio_public_key.as_bytes())
 }
 
 pub fn operator_key_hash_hex(binding: &SignedWeb3IdentityBinding) -> String {
-    format!("0x{}", hex::encode(operator_key_hash(binding).as_slice()))
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn prepare_root_publication(
     target: &EvmAnchorTarget,
     checkpoint: &KernelCheckpoint,
     binding: &SignedWeb3IdentityBinding,
 ) -> Result<PreparedEvmRootPublication, AnchorError> {
     if !binding
