--- crates/chio-anchor/src/evm.rs
+++ delete ! in prepare_root_publication
@@ -113,17 +113,17 @@
         .certificate
         .purpose
         .contains(&Web3KeyBindingPurpose::Anchor)
     {
         return Err(AnchorError::InvalidBinding(
             "binding certificate does not include anchor purpose".to_string(),
         ));
     }
-    if !binding
+    if  /* ~ changed by cargo-mutants ~ */binding
         .certificate
         .chain_scope
         .iter()
         .any(|chain| chain == &target.chain_id)
     {
         return Err(AnchorError::InvalidBinding(format!(
             "binding certificate does not cover {}",
             target.chain_id
