--- crates/chio-anchor/src/evm.rs
+++ replace == with != in prepare_root_publication
@@ -117,17 +117,17 @@
         return Err(AnchorError::InvalidBinding(
             "binding certificate does not include anchor purpose".to_string(),
         ));
     }
     if !binding
         .certificate
         .chain_scope
         .iter()
-        .any(|chain| chain == &target.chain_id)
+        .any(|chain| chain != /* ~ changed by cargo-mutants ~ */ &target.chain_id)
     {
         return Err(AnchorError::InvalidBinding(format!(
             "binding certificate does not cover {}",
             target.chain_id
         )));
     }
     if binding.certificate.settlement_address != target.operator_address {
         return Err(AnchorError::InvalidBinding(format!(
