--- crates/chio-anchor/src/evm.rs
+++ replace == with != in prepare_delegate_registration
@@ -169,17 +169,17 @@
     delegate_address: &str,
     expires_at: u64,
 ) -> Result<PreparedDelegateRegistration, AnchorError> {
     if delegate_address.trim().is_empty() {
         return Err(AnchorError::InvalidInput(
             "delegate address is required".to_string(),
         ));
     }
-    if expires_at == 0 {
+    if expires_at != /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(AnchorError::InvalidInput(
             "delegate expiry must be non-zero".to_string(),
         ));
     }
 
     let delegate = Address::from_str(delegate_address)
         .map_err(|error| AnchorError::InvalidInput(error.to_string()))?;
     let call = IChioRootRegistry::registerDelegateCall {
