--- crates/chio-anchor/src/evm.rs
+++ replace estimate_publication_gas -> Result<u64, AnchorError> with Ok(0)
@@ -224,32 +224,17 @@
         .map(ToString::to_string)
         .ok_or_else(|| AnchorError::Rpc("eth_sendTransaction did not return a tx hash".to_string()))
 }
 
 async fn estimate_publication_gas(
     publication: &PreparedEvmRootPublication,
     egress_contract: &HttpEgressContract,
 ) -> Result<u64, AnchorError> {
-    let result = rpc_call(
-        &publication.rpc_url,
-        egress_contract,
-        "eth_estimateGas",
-        json!([{
-            "from": publication.publisher_address,
-            "to": publication.contract_address,
-            "data": publication.call_data,
-        }]),
-    )
-    .await?;
-    parse_hex_u64(
-        result.as_str().ok_or_else(|| {
-            AnchorError::Rpc("eth_estimateGas did not return a string".to_string())
-        })?,
-    )
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 pub async fn confirm_root_publication(
     target: &EvmAnchorTarget,
     checkpoint: &KernelCheckpoint,
     binding: &SignedWeb3IdentityBinding,
     tx_hash: &str,
     egress_contract: &HttpEgressContract,
