--- crates/chio-anchor/src/evm.rs
+++ replace inspect_publication_guard -> Result<EvmPublicationGuard, AnchorError> with Ok(Default::default())
@@ -328,78 +328,17 @@
         published_at: stored.publishedAt,
     })
 }
 
 pub async fn inspect_publication_guard(
     target: &EvmAnchorTarget,
     egress_contract: &HttpEgressContract,
 ) -> Result<EvmPublicationGuard, AnchorError> {
-    let operator = Address::from_str(&target.operator_address)
-        .map_err(|error| AnchorError::InvalidInput(error.to_string()))?;
-    let publisher = Address::from_str(&target.publisher_address)
-        .map_err(|error| AnchorError::InvalidInput(error.to_string()))?;
-
-    let auth_call = IChioRootRegistry::isAuthorizedPublisherCall {
-        operator,
-        publisher,
-    };
-    let auth_response = rpc_call(
-        &target.rpc_url,
-        egress_contract,
-        "eth_call",
-        json!([
-            {
-                "to": target.contract_address,
-                "data": format!("0x{}", hex::encode(auth_call.abi_encode()))
-            },
-            "latest"
-        ]),
-    )
-    .await?;
-    let auth_raw = auth_response.as_str().ok_or_else(|| {
-        AnchorError::Rpc("eth_call isAuthorizedPublisher did not return data".to_string())
-    })?;
-    let auth_bytes = hex::decode(auth_raw.trim_start_matches("0x"))
-        .map_err(|error| AnchorError::Rpc(error.to_string()))?;
-    let publisher_authorized =
-        IChioRootRegistry::isAuthorizedPublisherCall::abi_decode_returns(&auth_bytes)
-            .map_err(|error| AnchorError::Serialization(error.to_string()))?;
-
-    let seq_call = IChioRootRegistry::getLatestSeqCall { operator };
-    let seq_response = rpc_call(
-        &target.rpc_url,
-        egress_contract,
-        "eth_call",
-        json!([
-            {
-                "to": target.contract_address,
-                "data": format!("0x{}", hex::encode(seq_call.abi_encode()))
-            },
-            "latest"
-        ]),
-    )
-    .await?;
-    let seq_raw = seq_response
-        .as_str()
-        .ok_or_else(|| AnchorError::Rpc("eth_call getLatestSeq did not return data".to_string()))?;
-    let seq_bytes = hex::decode(seq_raw.trim_start_matches("0x"))
-        .map_err(|error| AnchorError::Rpc(error.to_string()))?;
-    let latest_checkpoint_seq = IChioRootRegistry::getLatestSeqCall::abi_decode_returns(&seq_bytes)
-        .map_err(|error| AnchorError::Serialization(error.to_string()))?;
-
-    Ok(EvmPublicationGuard {
-        chain_id: target.chain_id.clone(),
-        operator_address: target.operator_address.clone(),
-        publisher_address: target.publisher_address.clone(),
-        latest_checkpoint_seq,
-        next_checkpoint_seq_min: latest_checkpoint_seq.saturating_add(1),
-        publisher_authorized,
-        requires_delegate_authorization: target.publisher_address != target.operator_address,
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub async fn ensure_publication_ready(
     target: &EvmAnchorTarget,
     checkpoint_seq: u64,
     egress_contract: &HttpEgressContract,
 ) -> Result<EvmPublicationGuard, AnchorError> {
     let guard = inspect_publication_guard(target, egress_contract).await?;
