--- crates/chio-anchor/src/evm.rs
+++ replace ensure_publication_ready -> Result<EvmPublicationGuard, AnchorError> with Ok(Default::default())
@@ -397,30 +397,17 @@
     })
 }
 
 pub async fn ensure_publication_ready(
     target: &EvmAnchorTarget,
     checkpoint_seq: u64,
     egress_contract: &HttpEgressContract,
 ) -> Result<EvmPublicationGuard, AnchorError> {
-    let guard = inspect_publication_guard(target, egress_contract).await?;
-    if !guard.publisher_authorized {
-        return Err(AnchorError::Verification(format!(
-            "publisher {} is not authorized for operator {} on {}",
-            guard.publisher_address, guard.operator_address, guard.chain_id
-        )));
-    }
-    if checkpoint_seq < guard.next_checkpoint_seq_min {
-        return Err(AnchorError::Verification(format!(
-            "checkpoint sequence {} must be >= {} on {}",
-            checkpoint_seq, guard.next_checkpoint_seq_min, guard.chain_id
-        )));
-    }
-    Ok(guard)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub async fn verify_inclusion_onchain(
     target: &EvmAnchorTarget,
     proof: &AnchorInclusionProof,
     egress_contract: &HttpEgressContract,
 ) -> Result<bool, AnchorError> {
     verify_anchor_inclusion_proof(proof)
