--- crates/chio-anchor/src/evm.rs
+++ replace verify_inclusion_onchain -> Result<bool, AnchorError> with Ok(true)
@@ -418,61 +418,17 @@
     Ok(guard)
 }
 
 pub async fn verify_inclusion_onchain(
     target: &EvmAnchorTarget,
     proof: &AnchorInclusionProof,
     egress_contract: &HttpEgressContract,
 ) -> Result<bool, AnchorError> {
-    verify_anchor_inclusion_proof(proof)
-        .map_err(|error| AnchorError::Verification(error.to_string()))?;
-    let operator = Address::from_str(&proof.key_binding_certificate.certificate.settlement_address)
-        .map_err(|error| AnchorError::InvalidInput(error.to_string()))?;
-    let receipt_bytes = canonical_json_bytes(&proof.receipt.body())
-        .map_err(|error| AnchorError::Serialization(error.to_string()))?;
-    let leaf = leaf_hash(&receipt_bytes);
-    let evm_proof = ChioMerkleProof {
-        audit_path: proof
-            .receipt_inclusion
-            .proof
-            .audit_path
-            .iter()
-            .map(hash_to_b256)
-            .collect(),
-        leaf_index: U256::from(proof.receipt_inclusion.proof.leaf_index as u64),
-        tree_size: U256::from(proof.receipt_inclusion.proof.tree_size as u64),
-    };
-    let call = IChioRootRegistry::verifyInclusionDetailedCall {
-        proof: evm_proof.into(),
-        root: hash_to_b256(&proof.receipt_inclusion.merkle_root),
-        leafHash: hash_to_b256(&leaf),
-        operator,
-    };
-    let response = rpc_call(
-        &target.rpc_url,
-        egress_contract,
-        "eth_call",
-        json!([
-            {
-                "to": target.contract_address,
-                "data": format!("0x{}", hex::encode(call.abi_encode()))
-            },
-            "latest"
-        ]),
-    )
-    .await?;
-    let raw = response.as_str().ok_or_else(|| {
-        AnchorError::Rpc("eth_call verifyInclusionDetailed did not return data".to_string())
-    })?;
-    let bytes = hex::decode(raw.trim_start_matches("0x"))
-        .map_err(|error| AnchorError::Rpc(error.to_string()))?;
-    let verified = IChioRootRegistry::verifyInclusionDetailedCall::abi_decode_returns(&bytes)
-        .map_err(|error| AnchorError::Serialization(error.to_string()))?;
-    Ok(verified)
+    Ok(true) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn build_chain_anchor_record(
     target: &EvmAnchorTarget,
     checkpoint: &KernelCheckpoint,
     confirmed: &EvmPublicationReceipt,
 ) -> Web3ChainAnchorRecord {
     Web3ChainAnchorRecord {
