--- crates/chio-anchor/src/evm.rs
+++ replace build_chain_anchor_record -> Web3ChainAnchorRecord with Default::default()
@@ -470,26 +470,17 @@
     Ok(verified)
 }
 
 pub fn build_chain_anchor_record(
     target: &EvmAnchorTarget,
     checkpoint: &KernelCheckpoint,
     confirmed: &EvmPublicationReceipt,
 ) -> Web3ChainAnchorRecord {
-    Web3ChainAnchorRecord {
-        chain_id: target.chain_id.clone(),
-        contract_address: target.contract_address.clone(),
-        operator_address: target.operator_address.clone(),
-        tx_hash: confirmed.tx_hash.clone(),
-        block_number: confirmed.block_number,
-        block_hash: confirmed.block_hash.clone(),
-        anchored_merkle_root: checkpoint.body.merkle_root,
-        anchored_checkpoint_seq: checkpoint.body.checkpoint_seq,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 async fn rpc_call(
     rpc_url: &str,
     egress_contract: &HttpEgressContract,
     method: &str,
     params: Value,
 ) -> Result<Value, AnchorError> {
