--- crates/chio-anchor/src/evm.rs
+++ replace rpc_call -> Result<Value, AnchorError> with Ok(Default::default())
@@ -488,50 +488,17 @@
 }
 
 async fn rpc_call(
     rpc_url: &str,
     egress_contract: &HttpEgressContract,
     method: &str,
     params: Value,
 ) -> Result<Value, AnchorError> {
-    validate_rpc_egress_contract(rpc_url, egress_contract)?;
-    let client = client_builder_with_contract(egress_contract)
-        .build()
-        .map_err(|error| AnchorError::Rpc(format!("reqwest build: {error}")))?;
-    let request = client
-        .post(rpc_url)
-        .json(&json!({
-            "jsonrpc": "2.0",
-            "id": 1u64,
-            "method": method,
-            "params": params,
-        }))
-        .build()
-        .map_err(|error| AnchorError::Rpc(format!("reqwest build request: {error}")))?;
-    let response = send_with_contract(egress_contract, &client, request)
-        .await
-        .map_err(|error| {
-            AnchorError::Rpc(format!(
-                "HttpEgressContract rejects anchor EVM RPC dispatch: {error}"
-            ))
-        })?;
-    let envelope: JsonRpcEnvelope = response
-        .json()
-        .await
-        .map_err(|error| AnchorError::Rpc(error.to_string()))?;
-    if let Some(error) = envelope.error {
-        return Err(AnchorError::Rpc(format!(
-            "{} (code {})",
-            error.message, error.code
-        )));
-    }
-    envelope
-        .result
-        .ok_or_else(|| AnchorError::Rpc(format!("{} returned no result", method)))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn evm_anchor_devnet_rpc_egress_contract(
     rpc_url: &str,
 ) -> Result<HttpEgressContract, AnchorError> {
     devnet_rpc_egress_contract_for_url("chio-anchor-evm-devnet-rpc", rpc_url)
 }
 
