--- crates/chio-anchor/src/evm.rs
+++ replace evm_anchor_devnet_rpc_egress_contract -> Result<HttpEgressContract, AnchorError> with Ok(Default::default())
@@ -527,17 +527,17 @@
     envelope
         .result
         .ok_or_else(|| AnchorError::Rpc(format!("{} returned no result", method)))
 }
 
 pub fn evm_anchor_devnet_rpc_egress_contract(
     rpc_url: &str,
 ) -> Result<HttpEgressContract, AnchorError> {
-    devnet_rpc_egress_contract_for_url("chio-anchor-evm-devnet-rpc", rpc_url)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_rpc_egress_contract(
     rpc_url: &str,
     contract: &HttpEgressContract,
 ) -> Result<(), AnchorError> {
     contract
         .validate_dispatchable_with_pinned_dns()
