--- crates/chio-anchor/src/evm.rs
+++ replace validate_rpc_egress_contract -> Result<(), AnchorError> with Ok(())
@@ -534,29 +534,17 @@
 ) -> Result<HttpEgressContract, AnchorError> {
     devnet_rpc_egress_contract_for_url("chio-anchor-evm-devnet-rpc", rpc_url)
 }
 
 fn validate_rpc_egress_contract(
     rpc_url: &str,
     contract: &HttpEgressContract,
 ) -> Result<(), AnchorError> {
-    contract
-        .validate_dispatchable_with_pinned_dns()
-        .map_err(|error| {
-            AnchorError::Rpc(format!(
-                "invalid anchor EVM RPC HttpEgressContract: {error}"
-            ))
-        })?;
-    contract.enforce_url_with_dns(rpc_url, 0).map_err(|error| {
-        AnchorError::Rpc(format!(
-            "anchor EVM RPC URL is not allowed by HttpEgressContract: {error}"
-        ))
-    })?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn devnet_rpc_egress_contract_for_url(
     namespace: &str,
     rpc_url: &str,
 ) -> Result<HttpEgressContract, AnchorError> {
     let url = Url::parse(rpc_url)
         .map_err(|error| AnchorError::Rpc(format!("invalid anchor EVM RPC URL: {error}")))?;
