--- crates/chio-anchor/src/evm.rs
+++ replace devnet_rpc_egress_contract_for_url -> Result<HttpEgressContract, AnchorError> with Ok(Default::default())
@@ -553,53 +553,17 @@
     })?;
     Ok(())
 }
 
 fn devnet_rpc_egress_contract_for_url(
     namespace: &str,
     rpc_url: &str,
 ) -> Result<HttpEgressContract, AnchorError> {
-    let url = Url::parse(rpc_url)
-        .map_err(|error| AnchorError::Rpc(format!("invalid anchor EVM RPC URL: {error}")))?;
-    let host = url
-        .host_str()
-        .ok_or_else(|| AnchorError::Rpc("anchor EVM RPC URL must include a host".to_string()))?;
-    if !rpc_host_is_loopback(host) {
-        return Err(AnchorError::InvalidInput(
-            "devnet anchor EVM RPC egress contract requires a loopback RPC URL".to_string(),
-        ));
-    }
-    let mut allowed_schemes = BTreeSet::new();
-    allowed_schemes.insert(url.scheme().to_ascii_lowercase());
-    let mut allowed_authority_set = BTreeSet::new();
-    allowed_authority_set.insert(normalized_rpc_authority(&url, host));
-    let contract = HttpEgressContract {
-        tenant_egress_namespace: namespace.to_string(),
-        allowed_schemes,
-        allowed_authority_set,
-        deny_loopback: false,
-        deny_link_local: true,
-        deny_ipv6_ula: true,
-        max_redirect_chain: 0,
-        max_response_bytes: 64 * 1024 * 1024,
-    };
-    contract
-        .validate_dispatchable_with_pinned_dns()
-        .map_err(|error| {
-            AnchorError::Rpc(format!(
-                "invalid anchor EVM RPC HttpEgressContract: {error}"
-            ))
-        })?;
-    contract.enforce_url_with_dns(rpc_url, 0).map_err(|error| {
-        AnchorError::Rpc(format!(
-            "anchor EVM RPC URL is not allowed by HttpEgressContract: {error}"
-        ))
-    })?;
-    Ok(contract)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn normalized_rpc_authority(url: &Url, host: &str) -> String {
     let host = if host.parse::<Ipv6Addr>().is_ok() {
         format!("[{host}]")
     } else {
         host.trim_end_matches('.').to_ascii_lowercase()
     };
