--- crates/chio-anchor/src/evm.rs
+++ delete ! in devnet_rpc_egress_contract_for_url
@@ -558,17 +558,17 @@
     namespace: &str,
     rpc_url: &str,
 ) -> Result<HttpEgressContract, AnchorError> {
     let url = Url::parse(rpc_url)
         .map_err(|error| AnchorError::Rpc(format!("invalid anchor EVM RPC URL: {error}")))?;
     let host = url
         .host_str()
         .ok_or_else(|| AnchorError::Rpc("anchor EVM RPC URL must include a host".to_string()))?;
-    if !rpc_host_is_loopback(host) {
+    if  /* ~ changed by cargo-mutants ~ */rpc_host_is_loopback(host) {
         return Err(AnchorError::InvalidInput(
             "devnet anchor EVM RPC egress contract requires a loopback RPC URL".to_string(),
         ));
     }
     let mut allowed_schemes = BTreeSet::new();
     allowed_schemes.insert(url.scheme().to_ascii_lowercase());
     let mut allowed_authority_set = BTreeSet::new();
     allowed_authority_set.insert(normalized_rpc_authority(&url, host));
