--- crates/chio-anchor/src/evm.rs
+++ replace * with + in devnet_rpc_egress_contract_for_url
@@ -575,17 +575,17 @@
     let contract = HttpEgressContract {
         tenant_egress_namespace: namespace.to_string(),
         allowed_schemes,
         allowed_authority_set,
         deny_loopback: false,
         deny_link_local: true,
         deny_ipv6_ula: true,
         max_redirect_chain: 0,
-        max_response_bytes: 64 * 1024 * 1024,
+        max_response_bytes: 64 + /* ~ changed by cargo-mutants ~ */ 1024 * 1024,
     };
     contract
         .validate_dispatchable_with_pinned_dns()
         .map_err(|error| {
             AnchorError::Rpc(format!(
                 "invalid anchor EVM RPC HttpEgressContract: {error}"
             ))
         })?;
