--- crates/chio-anchor/src/evm.rs
+++ replace normalized_rpc_authority -> String with "xyzzy".into()
@@ -593,25 +593,17 @@
         AnchorError::Rpc(format!(
             "anchor EVM RPC URL is not allowed by HttpEgressContract: {error}"
         ))
     })?;
     Ok(contract)
 }
 
 fn normalized_rpc_authority(url: &Url, host: &str) -> String {
-    let host = if host.parse::<Ipv6Addr>().is_ok() {
-        format!("[{host}]")
-    } else {
-        host.trim_end_matches('.').to_ascii_lowercase()
-    };
-    match url.port() {
-        Some(port) => format!("{host}:{port}"),
-        None => host,
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn rpc_host_is_loopback(host: &str) -> bool {
     matches!(
         host.trim_end_matches('.').to_ascii_lowercase().as_str(),
         "localhost" | "localhost.localdomain"
     ) || host
         .parse::<IpAddr>()
