--- crates/chio-anchor/src/evm.rs
+++ replace rpc_host_is_loopback -> bool with true
@@ -605,22 +605,17 @@
     };
     match url.port() {
         Some(port) => format!("{host}:{port}"),
         None => host,
     }
 }
 
 fn rpc_host_is_loopback(host: &str) -> bool {
-    matches!(
-        host.trim_end_matches('.').to_ascii_lowercase().as_str(),
-        "localhost" | "localhost.localdomain"
-    ) || host
-        .parse::<IpAddr>()
-        .is_ok_and(|address| address.is_loopback())
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn hash_to_b256(hash: &chio_core::hashing::Hash) -> B256 {
     FixedBytes::from(*hash.as_bytes())
 }
 
 fn parse_hex_u64(value: &str) -> Result<u64, AnchorError> {
     u64::from_str_radix(value.trim_start_matches("0x"), 16)
