--- crates/chio-anchor/src/functions.rs
+++ replace > with < in prepare_functions_batch_verification
@@ -143,17 +143,17 @@
     policy: FunctionsVerificationPolicy,
     note: Option<String>,
 ) -> Result<PreparedFunctionsVerificationRequest, AnchorError> {
     if receipts.is_empty() {
         return Err(AnchorError::InvalidInput(
             "functions verification requires at least one receipt".to_string(),
         ));
     }
-    if receipts.len() > policy.max_batch_receipts {
+    if receipts.len() < /* ~ changed by cargo-mutants ~ */ policy.max_batch_receipts {
         return Err(AnchorError::InvalidInput(format!(
             "functions verification batch {} exceeds maximum {}",
             receipts.len(),
             policy.max_batch_receipts
         )));
     }
     if policy.allow_direct_fund_release {
         return Err(AnchorError::InvalidInput(
