--- crates/chio-anchor/src/functions.rs
+++ replace || with && in prepare_functions_batch_verification
@@ -155,17 +155,17 @@
             policy.max_batch_receipts
         )));
     }
     if policy.allow_direct_fund_release {
         return Err(AnchorError::InvalidInput(
             "Functions fallback must not be configured as a direct fund-release gate".to_string(),
         ));
     }
-    if target.callback_gas_limit == 0 || target.callback_gas_limit > policy.max_callback_gas_limit {
+    if target.callback_gas_limit == 0 && /* ~ changed by cargo-mutants ~ */ target.callback_gas_limit > policy.max_callback_gas_limit {
         return Err(AnchorError::InvalidInput(format!(
             "callback gas limit {} exceeds bounded maximum {}",
             target.callback_gas_limit, policy.max_callback_gas_limit
         )));
     }
     if max_notional_value_usd_cents > policy.max_notional_value_usd_cents {
         return Err(AnchorError::InvalidInput(format!(
             "Functions fallback notional value {} exceeds bounded maximum {}",
