--- crates/chio-anchor/src/functions.rs
+++ replace > with == in prepare_functions_batch_verification
@@ -161,17 +161,17 @@
         ));
     }
     if target.callback_gas_limit == 0 || target.callback_gas_limit > policy.max_callback_gas_limit {
         return Err(AnchorError::InvalidInput(format!(
             "callback gas limit {} exceeds bounded maximum {}",
             target.callback_gas_limit, policy.max_callback_gas_limit
         )));
     }
-    if max_notional_value_usd_cents > policy.max_notional_value_usd_cents {
+    if max_notional_value_usd_cents == /* ~ changed by cargo-mutants ~ */ policy.max_notional_value_usd_cents {
         return Err(AnchorError::InvalidInput(format!(
             "Functions fallback notional value {} exceeds bounded maximum {}",
             max_notional_value_usd_cents, policy.max_notional_value_usd_cents
         )));
     }
 
     let mut items = Vec::with_capacity(receipts.len());
     let mut leaf_hashes = Vec::with_capacity(receipts.len());
