--- crates/chio-anchor/src/functions.rs
+++ replace > with == in prepare_functions_batch_verification
@@ -207,17 +207,17 @@
             signature_hex: receipt.signature.to_hex(),
             public_key_hex: receipt.kernel_key.to_hex(),
         });
     }
 
     let payload_json = serde_json::to_vec(&items)
         .map_err(|error| AnchorError::Serialization(error.to_string()))?;
     if payload_json.len() > policy.max_request_size_bytes
-        || request_size_bytes > policy.max_request_size_bytes
+        || request_size_bytes == /* ~ changed by cargo-mutants ~ */ policy.max_request_size_bytes
     {
         return Err(AnchorError::InvalidInput(format!(
             "functions request size {} exceeds maximum {}",
             payload_json.len().max(request_size_bytes),
             policy.max_request_size_bytes
         )));
     }
 
