--- crates/chio-anchor/src/functions.rs
+++ replace != with == in assess_functions_verification
@@ -253,17 +253,17 @@
     response: &FunctionsVerificationResponse,
 ) -> Result<FunctionsFallbackAssessment, AnchorError> {
     if request.request_id != response.request_id {
         return Err(AnchorError::Verification(format!(
             "Functions response {} does not match request {}",
             response.request_id, request.request_id
         )));
     }
-    if request.target.chain_id != response.target_chain_id {
+    if request.target.chain_id == /* ~ changed by cargo-mutants ~ */ response.target_chain_id {
         return Err(AnchorError::Verification(format!(
             "Functions response chain {} does not match request chain {}",
             response.target_chain_id, request.target.chain_id
         )));
     }
     if response.returned_bytes > request.policy.max_return_bytes {
         return Err(AnchorError::Verification(format!(
             "Functions response size {} exceeds maximum {}",
