--- crates/chio-anchor/src/functions.rs
+++ replace != with == in assess_functions_verification
@@ -265,17 +265,17 @@
         )));
     }
     if response.returned_bytes > request.policy.max_return_bytes {
         return Err(AnchorError::Verification(format!(
             "Functions response size {} exceeds maximum {}",
             response.returned_bytes, request.policy.max_return_bytes
         )));
     }
-    if response.receipt_batch_root != request.receipt_batch_root {
+    if response.receipt_batch_root == /* ~ changed by cargo-mutants ~ */ request.receipt_batch_root {
         return Err(AnchorError::Verification(
             "Functions response batch root does not match prepared request".to_string(),
         ));
     }
     if response.status == FunctionsFallbackStatus::Verified
         && response.verified_receipt_count != request.receipt_count
     {
         return Err(AnchorError::Verification(format!(
