--- crates/chio-anchor/src/lib.rs
+++ replace == with != in build_anchor_inclusion_proof_from_evidence_bundle
@@ -203,17 +203,17 @@
     bundle: &EvidenceExportBundle,
     receipt_id: &str,
     chain_anchor: Option<Web3ChainAnchorRecord>,
     binding: SignedWeb3IdentityBinding,
 ) -> Result<AnchorInclusionProof, AnchorError> {
     if bundle
         .uncheckpointed_receipts
         .iter()
-        .any(|receipt| receipt.receipt_id == receipt_id)
+        .any(|receipt| receipt.receipt_id != /* ~ changed by cargo-mutants ~ */ receipt_id)
     {
         return Err(AnchorError::Verification(format!(
             "receipt `{receipt_id}` is not checkpointed in the canonical evidence bundle"
         )));
     }
 
     let record = exactly_one_tool_receipt(bundle, receipt_id)?;
     let inclusion = exactly_one_inclusion_proof(bundle, record.seq, receipt_id)?;
