--- crates/chio-anchor/src/lib.rs
+++ replace exactly_one_inclusion_proof -> Result<&'a ReceiptInclusionProof, AnchorError> with Ok(Box::leak(Box::new(Default::default())))
@@ -249,31 +249,17 @@
     Ok(record)
 }
 
 fn exactly_one_inclusion_proof<'a>(
     bundle: &'a EvidenceExportBundle,
     receipt_seq: u64,
     receipt_id: &str,
 ) -> Result<&'a ReceiptInclusionProof, AnchorError> {
-    let mut matches = bundle
-        .inclusion_proofs
-        .iter()
-        .filter(|proof| proof.receipt_seq == receipt_seq);
-    let Some(inclusion) = matches.next() else {
-        return Err(AnchorError::Verification(format!(
-            "receipt `{receipt_id}` is missing an inclusion proof in the canonical evidence bundle"
-        )));
-    };
-    if matches.next().is_some() {
-        return Err(AnchorError::Verification(format!(
-            "receipt `{receipt_id}` has multiple inclusion proofs in the canonical evidence bundle"
-        )));
-    }
-    Ok(inclusion)
+    Ok(Box::leak(Box::new(Default::default()))) /* ~ changed by cargo-mutants ~ */
 }
 
 fn exactly_one_checkpoint<'a>(
     bundle: &'a EvidenceExportBundle,
     checkpoint_seq: u64,
     receipt_id: &str,
 ) -> Result<&'a KernelCheckpoint, AnchorError> {
     let mut matches = bundle
