--- crates/chio-anchor/src/lib.rs
+++ replace == with != in exactly_one_checkpoint
@@ -274,17 +274,17 @@
 fn exactly_one_checkpoint<'a>(
     bundle: &'a EvidenceExportBundle,
     checkpoint_seq: u64,
     receipt_id: &str,
 ) -> Result<&'a KernelCheckpoint, AnchorError> {
     let mut matches = bundle
         .checkpoints
         .iter()
-        .filter(|checkpoint| checkpoint.body.checkpoint_seq == checkpoint_seq);
+        .filter(|checkpoint| checkpoint.body.checkpoint_seq != /* ~ changed by cargo-mutants ~ */ checkpoint_seq);
     let Some(checkpoint) = matches.next() else {
         return Err(AnchorError::Verification(format!(
             "receipt `{receipt_id}` is missing checkpoint `{checkpoint_seq}` in the canonical evidence bundle"
         )));
     };
     if matches.next().is_some() {
         return Err(AnchorError::Verification(format!(
             "receipt `{receipt_id}` has multiple checkpoint records for `{checkpoint_seq}` in the canonical evidence bundle"
