--- crates/chio-anchor/src/ops.rs
+++ replace AnchorControlState::apply_change with ()
@@ -121,31 +121,17 @@
     pub fn apply_change(
         &mut self,
         mode: AnchorEmergencyMode,
         changed_at: u64,
         actor: impl Into<String>,
         reason: Option<String>,
         source: impl Into<String>,
     ) {
-        let before = self.controls.clone();
-        self.controls = AnchorEmergencyControls {
-            mode,
-            changed_at,
-            reason,
-        };
-        self.updated_at = changed_at;
-        self.history.push(AnchorControlChangeRecord {
-            schema: CHIO_ANCHOR_CONTROL_TRACE_SCHEMA.to_string(),
-            actor: actor.into(),
-            source: source.into(),
-            changed_at,
-            before,
-            after: self.controls.clone(),
-        });
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq, Serialize, Deserialize)]
 #[serde(rename_all = "camelCase", deny_unknown_fields)]
 pub struct AnchorIndexerCursor {
     pub service_id: String,
     pub lane: AnchorLaneKind,
