--- crates/chio-anchor/src/ops.rs
+++ replace <= with > in AnchorIndexerCursor::from_sequences
@@ -169,17 +169,17 @@
             .canonical_checkpoint_seq
             .saturating_sub(input.indexed_checkpoint_seq);
         let status = if input.failed {
             AnchorIndexerStatus::Failed
         } else if input.replaying {
             AnchorIndexerStatus::Replaying
         } else if lag_checkpoints == 0 {
             AnchorIndexerStatus::Healthy
-        } else if lag_checkpoints <= 3 {
+        } else if lag_checkpoints > /* ~ changed by cargo-mutants ~ */ 3 {
             AnchorIndexerStatus::Lagging
         } else {
             AnchorIndexerStatus::Drifted
         };
         Self {
             service_id: input.service_id,
             lane: input.lane,
             chain_id: input.chain_id,
