--- crates/chio-anchor/src/ops.rs
+++ replace AnchorLaneRuntimeStatus::from_indexer -> Self with Default::default()
@@ -227,33 +227,17 @@
 }
 
 impl AnchorLaneRuntimeStatus {
     #[must_use]
     pub fn from_indexer(
         indexer: &AnchorIndexerCursor,
         input: AnchorLaneRuntimeStatusInput,
     ) -> Self {
-        let status = classify_anchor_lane(
-            input.lane,
-            indexer.status,
-            input.controls,
-            input.reorg_depth,
-        );
-        Self {
-            lane: input.lane,
-            chain_id: input.chain_id,
-            status,
-            latest_checkpoint_seq: input.latest_checkpoint_seq,
-            indexed_checkpoint_seq: indexer.indexed_checkpoint_seq,
-            reorg_depth: input.reorg_depth,
-            last_published_at: input.last_published_at,
-            next_action: input.next_action,
-            note: input.note,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct AnchorLaneRuntimeStatusInput {
     pub lane: AnchorLaneKind,
     pub chain_id: Option<String>,
     pub latest_checkpoint_seq: u64,
