--- crates/chio-anchor/src/ops.rs
+++ replace && with || in AnchorRuntimeReport::lane_incidents
@@ -307,17 +307,17 @@
         &'a self,
         lane: AnchorLaneKind,
         chain_id: Option<&str>,
     ) -> Vec<&'a AnchorIncidentAlert> {
         self.incidents
             .iter()
             .filter(|incident| {
                 incident.lane == lane
-                    && match (chain_id, incident.chain_id.as_deref()) {
+                    || /* ~ changed by cargo-mutants ~ */ match (chain_id, incident.chain_id.as_deref()) {
                         (Some(expected), Some(actual)) => expected == actual,
                         (Some(_), None) => true,
                         (None, _) => true,
                     }
             })
             .collect()
     }
 
