--- crates/chio-anchor/src/ops.rs
+++ replace != with == in anchor_incident_is_conflict
@@ -326,17 +326,17 @@
         self.lane_incidents(lane, chain_id)
             .into_iter()
             .any(anchor_incident_is_conflict)
     }
 }
 
 #[must_use]
 pub fn anchor_incident_is_conflict(incident: &AnchorIncidentAlert) -> bool {
-    if incident.severity != AnchorAlertSeverity::Critical {
+    if incident.severity == /* ~ changed by cargo-mutants ~ */ AnchorAlertSeverity::Critical {
         return false;
     }
     let code = incident.code.to_ascii_lowercase();
     code.contains("equivocation")
         || code.contains("conflict")
         || code.contains("fork")
         || code.contains("divergence")
         || code.contains("reorg")
