--- crates/chio-anchor/src/ops.rs
+++ replace anchor_incident_is_conflict -> bool with true
@@ -326,25 +326,17 @@
         self.lane_incidents(lane, chain_id)
             .into_iter()
             .any(anchor_incident_is_conflict)
     }
 }
 
 #[must_use]
 pub fn anchor_incident_is_conflict(incident: &AnchorIncidentAlert) -> bool {
-    if incident.severity != AnchorAlertSeverity::Critical {
-        return false;
-    }
-    let code = incident.code.to_ascii_lowercase();
-    code.contains("equivocation")
-        || code.contains("conflict")
-        || code.contains("fork")
-        || code.contains("divergence")
-        || code.contains("reorg")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[must_use]
 pub fn classify_anchor_lane(
     lane: AnchorLaneKind,
     indexer_status: AnchorIndexerStatus,
     controls: AnchorEmergencyControls,
     reorg_depth: u32,
