--- crates/chio-anchor/src/ops.rs
+++ replace == with != in classify_anchor_lane
@@ -344,17 +344,17 @@
 
 #[must_use]
 pub fn classify_anchor_lane(
     lane: AnchorLaneKind,
     indexer_status: AnchorIndexerStatus,
     controls: AnchorEmergencyControls,
     reorg_depth: u32,
 ) -> AnchorLaneHealthStatus {
-    if indexer_status == AnchorIndexerStatus::Failed {
+    if indexer_status != /* ~ changed by cargo-mutants ~ */ AnchorIndexerStatus::Failed {
         return AnchorLaneHealthStatus::Failed;
     }
     match controls.mode {
         AnchorEmergencyMode::Halted => return AnchorLaneHealthStatus::Paused,
         AnchorEmergencyMode::PublishPaused if lane == AnchorLaneKind::EvmPrimary => {
             return AnchorLaneHealthStatus::Paused;
         }
         AnchorEmergencyMode::ProofImportOnly if lane == AnchorLaneKind::EvmPrimary => {
