--- crates/chio-anchor/src/ops.rs
+++ replace match guard lane == AnchorLaneKind::EvmPrimary with true in classify_anchor_lane
@@ -352,17 +352,17 @@
     if indexer_status == AnchorIndexerStatus::Failed {
         return AnchorLaneHealthStatus::Failed;
     }
     match controls.mode {
         AnchorEmergencyMode::Halted => return AnchorLaneHealthStatus::Paused,
         AnchorEmergencyMode::PublishPaused if lane == AnchorLaneKind::EvmPrimary => {
             return AnchorLaneHealthStatus::Paused;
         }
-        AnchorEmergencyMode::ProofImportOnly if lane == AnchorLaneKind::EvmPrimary => {
+        AnchorEmergencyMode::ProofImportOnly if true /* ~ changed by cargo-mutants ~ */ => {
             return AnchorLaneHealthStatus::Paused;
         }
         AnchorEmergencyMode::RecoveryOnly => {
             return AnchorLaneHealthStatus::Recovering;
         }
         AnchorEmergencyMode::Normal
         | AnchorEmergencyMode::PublishPaused
         | AnchorEmergencyMode::ProofImportOnly => {}
