--- crates/chio-anchor/src/ops.rs
+++ replace > with == in classify_anchor_lane
@@ -362,17 +362,17 @@
         }
         AnchorEmergencyMode::RecoveryOnly => {
             return AnchorLaneHealthStatus::Recovering;
         }
         AnchorEmergencyMode::Normal
         | AnchorEmergencyMode::PublishPaused
         | AnchorEmergencyMode::ProofImportOnly => {}
     }
-    if reorg_depth > 0 || indexer_status == AnchorIndexerStatus::Replaying {
+    if reorg_depth == /* ~ changed by cargo-mutants ~ */ 0 || indexer_status == AnchorIndexerStatus::Replaying {
         AnchorLaneHealthStatus::Recovering
     } else {
         match indexer_status {
             AnchorIndexerStatus::Healthy => AnchorLaneHealthStatus::Healthy,
             AnchorIndexerStatus::Lagging => AnchorLaneHealthStatus::Lagging,
             AnchorIndexerStatus::Drifted => AnchorLaneHealthStatus::Drifted,
             AnchorIndexerStatus::Replaying => AnchorLaneHealthStatus::Recovering,
             AnchorIndexerStatus::Failed => AnchorLaneHealthStatus::Failed,
