--- crates/chio-anchor/src/ops.rs
+++ replace ensure_anchor_operation_allowed -> Result<(), AnchorError> with Ok(())
@@ -379,23 +379,17 @@
         }
     }
 }
 
 pub fn ensure_anchor_operation_allowed(
     controls: AnchorEmergencyControls,
     operation: AnchorOperationKind,
 ) -> Result<(), AnchorError> {
-    if controls.allows(operation) {
-        return Ok(());
-    }
-    Err(AnchorError::InvalidInput(format!(
-        "anchor operation {operation:?} denied while emergency mode {:?} is active",
-        controls.mode
-    )))
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::{
         anchor_incident_is_conflict, classify_anchor_lane, ensure_anchor_operation_allowed,
         AnchorAlertSeverity, AnchorControlState, AnchorEmergencyControls, AnchorEmergencyMode,
         AnchorIncidentAlert, AnchorIndexerCursor, AnchorIndexerCursorInput, AnchorIndexerStatus,
