--- crates/chio-anchor/src/ops.rs
+++ replace AnchorEmergencyControls::normal -> Self with Default::default()
@@ -70,21 +70,17 @@
     pub changed_at: u64,
     #[serde(default, skip_serializing_if = "Option::is_none")]
     pub reason: Option<String>,
 }
 
 impl AnchorEmergencyControls {
     #[must_use]
     pub fn normal(changed_at: u64) -> Self {
-        Self {
-            mode: AnchorEmergencyMode::Normal,
-            changed_at,
-            reason: None,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub fn allows(&self, operation: AnchorOperationKind) -> bool {
         match self.mode {
             AnchorEmergencyMode::Normal => true,
             AnchorEmergencyMode::PublishPaused => operation != AnchorOperationKind::PublishRoot,
             AnchorEmergencyMode::ProofImportOnly => {
