--- crates/chio-anchor/src/ops.rs
+++ replace AnchorEmergencyControls::allows -> bool with false
@@ -79,27 +79,17 @@
             mode: AnchorEmergencyMode::Normal,
             changed_at,
             reason: None,
         }
     }
 
     #[must_use]
     pub fn allows(&self, operation: AnchorOperationKind) -> bool {
-        match self.mode {
-            AnchorEmergencyMode::Normal => true,
-            AnchorEmergencyMode::PublishPaused => operation != AnchorOperationKind::PublishRoot,
-            AnchorEmergencyMode::ProofImportOnly => {
-                operation == AnchorOperationKind::ImportSecondaryProof
-            }
-            AnchorEmergencyMode::RecoveryOnly => {
-                operation == AnchorOperationKind::ConfirmPublication
-            }
-            AnchorEmergencyMode::Halted => false,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq, Serialize, Deserialize)]
 #[serde(rename_all = "camelCase", deny_unknown_fields)]
 pub struct AnchorControlState {
     pub schema: String,
     pub updated_at: u64,
