--- crates/chio-anchor/src/ops.rs
+++ replace != with == in AnchorEmergencyControls::allows
@@ -81,17 +81,17 @@
             reason: None,
         }
     }
 
     #[must_use]
     pub fn allows(&self, operation: AnchorOperationKind) -> bool {
         match self.mode {
             AnchorEmergencyMode::Normal => true,
-            AnchorEmergencyMode::PublishPaused => operation != AnchorOperationKind::PublishRoot,
+            AnchorEmergencyMode::PublishPaused => operation == /* ~ changed by cargo-mutants ~ */ AnchorOperationKind::PublishRoot,
             AnchorEmergencyMode::ProofImportOnly => {
                 operation == AnchorOperationKind::ImportSecondaryProof
             }
             AnchorEmergencyMode::RecoveryOnly => {
                 operation == AnchorOperationKind::ConfirmPublication
             }
             AnchorEmergencyMode::Halted => false,
         }
