--- crates/chio-anchor/src/ops.rs
+++ replace == with != in AnchorEmergencyControls::allows
@@ -83,17 +83,17 @@
     }
 
     #[must_use]
     pub fn allows(&self, operation: AnchorOperationKind) -> bool {
         match self.mode {
             AnchorEmergencyMode::Normal => true,
             AnchorEmergencyMode::PublishPaused => operation != AnchorOperationKind::PublishRoot,
             AnchorEmergencyMode::ProofImportOnly => {
-                operation == AnchorOperationKind::ImportSecondaryProof
+                operation != /* ~ changed by cargo-mutants ~ */ AnchorOperationKind::ImportSecondaryProof
             }
             AnchorEmergencyMode::RecoveryOnly => {
                 operation == AnchorOperationKind::ConfirmPublication
             }
             AnchorEmergencyMode::Halted => false,
         }
     }
 }
