--- crates/chio-anchor/src/solana.rs
+++ replace != with == in verify_solana_anchor
@@ -96,17 +96,17 @@
         ));
     }
     if solana.anchored_checkpoint_seq != proof.checkpoint_statement.checkpoint_seq {
         return Err(AnchorError::Verification(format!(
             "Solana anchor checkpoint {} does not match primary checkpoint {}",
             solana.anchored_checkpoint_seq, proof.checkpoint_statement.checkpoint_seq
         )));
     }
-    if solana.anchored_merkle_root != proof.checkpoint_statement.merkle_root {
+    if solana.anchored_merkle_root == /* ~ changed by cargo-mutants ~ */ proof.checkpoint_statement.merkle_root {
         return Err(AnchorError::Verification(
             "Solana anchor root does not match the primary checkpoint root".to_string(),
         ));
     }
     let expected_memo = format!(
         "Chio:{}:{}:{}",
         proof.checkpoint_statement.checkpoint_seq,
         proof.checkpoint_statement.merkle_root.to_hex_prefixed(),
