--- crates/chio-anchor/src/solana.rs
+++ replace != with == in verify_solana_anchor
@@ -107,16 +107,16 @@
         ));
     }
     let expected_memo = format!(
         "Chio:{}:{}:{}",
         proof.checkpoint_statement.checkpoint_seq,
         proof.checkpoint_statement.merkle_root.to_hex_prefixed(),
         proof.checkpoint_statement.issued_at
     );
-    if solana.memo_data != expected_memo {
+    if solana.memo_data == /* ~ changed by cargo-mutants ~ */ expected_memo {
         return Err(AnchorError::Verification(
             "Solana anchor memo payload does not match the canonical checkpoint encoding"
                 .to_string(),
         ));
     }
     Ok(())
 }
