--- crates/chio-anchor/src/solana.rs
+++ replace prepare_solana_memo_publication -> Result<PreparedSolanaMemoPublication, AnchorError> with Ok(Default::default())
@@ -54,35 +54,17 @@
     }
 }
 
 pub fn prepare_solana_memo_publication(
     checkpoint: &KernelCheckpoint,
     chain_id: &str,
     operator_pubkey: &str,
 ) -> Result<PreparedSolanaMemoPublication, AnchorError> {
-    if chain_id.trim().is_empty() || operator_pubkey.trim().is_empty() {
-        return Err(AnchorError::InvalidInput(
-            "Solana publication requires chain_id and operator_pubkey".to_string(),
-        ));
-    }
-    Ok(PreparedSolanaMemoPublication {
-        schema: "chio.anchor.solana-memo-publication.v1".to_string(),
-        chain_id: chain_id.to_string(),
-        operator_pubkey: operator_pubkey.to_string(),
-        memo_program_id: SOLANA_MEMO_PROGRAM_ID.to_string(),
-        memo_data: format!(
-            "Chio:{}:{}:{}",
-            checkpoint.body.checkpoint_seq,
-            checkpoint.body.merkle_root.to_hex_prefixed(),
-            checkpoint.body.issued_at
-        ),
-        anchored_merkle_root: checkpoint.body.merkle_root,
-        anchored_checkpoint_seq: checkpoint.body.checkpoint_seq,
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn verify_solana_anchor(
     proof: &AnchorInclusionProof,
     solana: &SolanaMemoAnchorRecord,
 ) -> Result<(), AnchorError> {
     if solana.memo_program_id != SOLANA_MEMO_PROGRAM_ID {
         return Err(AnchorError::Verification(format!(
