--- crates/chio-anchor/src/solana.rs
+++ replace verify_solana_anchor -> Result<(), AnchorError> with Ok(())
@@ -79,44 +79,10 @@
         anchored_checkpoint_seq: checkpoint.body.checkpoint_seq,
     })
 }
 
 pub fn verify_solana_anchor(
     proof: &AnchorInclusionProof,
     solana: &SolanaMemoAnchorRecord,
 ) -> Result<(), AnchorError> {
-    if solana.memo_program_id != SOLANA_MEMO_PROGRAM_ID {
-        return Err(AnchorError::Verification(format!(
-            "Solana anchor must use the memo program {}; got {}",
-            SOLANA_MEMO_PROGRAM_ID, solana.memo_program_id
-        )));
-    }
-    if solana.tx_signature.trim().is_empty() {
-        return Err(AnchorError::Verification(
-            "Solana anchor transaction signature must be non-empty".to_string(),
-        ));
-    }
-    if solana.anchored_checkpoint_seq != proof.checkpoint_statement.checkpoint_seq {
-        return Err(AnchorError::Verification(format!(
-            "Solana anchor checkpoint {} does not match primary checkpoint {}",
-            solana.anchored_checkpoint_seq, proof.checkpoint_statement.checkpoint_seq
-        )));
-    }
-    if solana.anchored_merkle_root != proof.checkpoint_statement.merkle_root {
-        return Err(AnchorError::Verification(
-            "Solana anchor root does not match the primary checkpoint root".to_string(),
-        ));
-    }
-    let expected_memo = format!(
-        "Chio:{}:{}:{}",
-        proof.checkpoint_statement.checkpoint_seq,
-        proof.checkpoint_statement.merkle_root.to_hex_prefixed(),
-        proof.checkpoint_statement.issued_at
-    );
-    if solana.memo_data != expected_memo {
-        return Err(AnchorError::Verification(
-            "Solana anchor memo payload does not match the canonical checkpoint encoding"
-                .to_string(),
-        ));
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
