--- crates/chio-anchor/src/solana.rs
+++ replace != with == in verify_solana_anchor
@@ -90,17 +90,17 @@
             SOLANA_MEMO_PROGRAM_ID, solana.memo_program_id
         )));
     }
     if solana.tx_signature.trim().is_empty() {
         return Err(AnchorError::Verification(
             "Solana anchor transaction signature must be non-empty".to_string(),
         ));
     }
-    if solana.anchored_checkpoint_seq != proof.checkpoint_statement.checkpoint_seq {
+    if solana.anchored_checkpoint_seq == /* ~ changed by cargo-mutants ~ */ proof.checkpoint_statement.checkpoint_seq {
         return Err(AnchorError::Verification(format!(
             "Solana anchor checkpoint {} does not match primary checkpoint {}",
             solana.anchored_checkpoint_seq, proof.checkpoint_statement.checkpoint_seq
         )));
     }
     if solana.anchored_merkle_root != proof.checkpoint_statement.merkle_root {
         return Err(AnchorError::Verification(
             "Solana anchor root does not match the primary checkpoint root".to_string(),
