--- crates/chio-attest-verify/src/lib.rs
+++ replace StaticTenantPolicyMap::from_verified -> Result<Self, AttestError> with Ok(Default::default())
@@ -140,33 +140,17 @@
     /// of [`TenantPolicy`] values.
     ///
     /// # Errors
     ///
     /// Returns [`AttestError::Malformed`] if two entries share a
     /// `tenant_id` (the loader is fail-closed; collisions are a
     /// configuration error, not a precedence rule).
     pub fn from_verified(policies: Vec<TenantPolicy>) -> Result<Self, AttestError> {
-        for (i, a) in policies.iter().enumerate() {
-            if a.oidc_issuers.len() != 1 {
-                return Err(AttestError::Malformed(format!(
-                    "tenant_id {:?} must declare exactly one oidc_issuer for StaticTenantPolicyMap",
-                    a.tenant_id
-                )));
-            }
-            for b in &policies[i + 1..] {
-                if a.tenant_id == b.tenant_id {
-                    return Err(AttestError::Malformed(format!(
-                        "duplicate tenant_id {:?}",
-                        a.tenant_id
-                    )));
-                }
-            }
-        }
-        Ok(Self { entries: policies })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Number of distinct tenants known to this map.
     #[must_use]
     pub fn len(&self) -> usize {
         self.entries.len()
     }
 
