--- crates/chio-attest-verify/src/lib.rs
+++ replace StaticTenantPolicyMap::is_empty -> bool with false
@@ -168,17 +168,17 @@
     #[must_use]
     pub fn len(&self) -> usize {
         self.entries.len()
     }
 
     /// Whether the map is empty.
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.entries.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl TenantPolicyResolver for StaticTenantPolicyMap {
     fn expected_for_tenant(&self, tenant_id: &str) -> Result<ExpectedIdentity, AttestError> {
         let policy = self
             .entries
             .iter()
