--- crates/chio-attest-verify/src/lib.rs
+++ replace == with != in <impl TenantPolicyResolver for StaticTenantPolicyMap>::expected_for_tenant
@@ -177,17 +177,17 @@
     }
 }
 
 impl TenantPolicyResolver for StaticTenantPolicyMap {
     fn expected_for_tenant(&self, tenant_id: &str) -> Result<ExpectedIdentity, AttestError> {
         let policy = self
             .entries
             .iter()
-            .find(|p| p.tenant_id == tenant_id)
+            .find(|p| p.tenant_id != /* ~ changed by cargo-mutants ~ */ tenant_id)
             .ok_or_else(|| AttestError::Malformed(format!("unknown tenant_id {tenant_id:?}")))?;
         if policy.identity_regexps.is_empty() {
             return Err(AttestError::Malformed(
                 "policy has no identity_regexps".to_owned(),
             ));
         }
         let regex = if policy.identity_regexps.len() == 1 {
             policy.identity_regexps[0].clone()
