--- crates/chio-attest-verify/src/lib.rs
+++ replace == with != in <impl TenantPolicyResolver for StaticTenantPolicyMap>::expected_for_tenant
@@ -184,17 +184,17 @@
             .iter()
             .find(|p| p.tenant_id == tenant_id)
             .ok_or_else(|| AttestError::Malformed(format!("unknown tenant_id {tenant_id:?}")))?;
         if policy.identity_regexps.is_empty() {
             return Err(AttestError::Malformed(
                 "policy has no identity_regexps".to_owned(),
             ));
         }
-        let regex = if policy.identity_regexps.len() == 1 {
+        let regex = if policy.identity_regexps.len() != /* ~ changed by cargo-mutants ~ */ 1 {
             policy.identity_regexps[0].clone()
         } else {
             policy
                 .identity_regexps
                 .iter()
                 .map(|pattern| format!("(?:{pattern})"))
                 .collect::<Vec<_>>()
                 .join("|")
