--- crates/chio-attest-verify/src/sigstore.rs
+++ replace SigstoreVerifier::build_bundle_verifier -> Result<AsyncBundleVerifier, AttestError> with Ok(Default::default())
@@ -104,18 +104,17 @@
 
     /// Internal helper that builds an [`AsyncBundleVerifier`] from a
     /// freshly-parsed copy of the embedded trust root. A new verifier is
     /// constructed per call so that the bundle verifier's internal state
     /// never leaks between concurrent `verify_*` invocations. The
     /// per-call parse cost is negligible compared with the network and
     /// crypto work that follows in the typical `verify_bundle` flow.
     fn build_bundle_verifier(&self) -> Result<AsyncBundleVerifier, AttestError> {
-        let trust_root = build_trust_root()?;
-        AsyncBundleVerifier::new(Default::default(), trust_root).map_err(|_| AttestError::TrustRoot)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn build_trust_root() -> Result<SigstoreTrustRoot, AttestError> {
     SigstoreTrustRoot::from_trusted_root_json_unchecked(EMBEDDED_TRUSTED_ROOT_JSON)
         .map_err(|_| AttestError::TrustRoot)
 }
 
