--- crates/chio-attest-verify/src/sigstore.rs
+++ replace <impl AttestVerifier for SigstoreVerifier>::verify_bytes -> Result<VerifiedAttestation, AttestError> with Ok(Default::default())
@@ -141,51 +141,17 @@
     fn verify_bytes(
         &self,
         artifact: &[u8],
         signature: &[u8],
         certificate_pem: &[u8],
         expected: &ExpectedIdentity,
     ) -> Result<VerifiedAttestation, AttestError> {
         // 1) Parse leaf certificate (PEM or DER).
-        let leaf_der = parse_certificate_to_der(certificate_pem)?;
-        let leaf_cert = Certificate::from_der(&leaf_der)
-            .map_err(|e| AttestError::Malformed(format!("leaf cert DER parse: {e}")))?;
-
-        // 2) Validate against the embedded Fulcio root chain via webpki.
-        validate_against_fulcio(&leaf_der, self.fulcio_root_ders.as_ref())?;
-
-        // 3) Identity / OIDC issuer policy. Build the regex once and
-        //    walk the SAN extension; reject if no SAN entry matches.
-        let identity = match_identity(&leaf_cert, expected)?;
-
-        // 4) Certificate validity window check.
-        let (not_before, not_after) = certificate_validity(&leaf_cert)?;
-        let now = SystemTime::now();
-        if now < not_before || now > not_after {
-            return Err(AttestError::CertificateExpired);
-        }
-
-        // 5) Signature verification. Cosign emits base64-encoded raw
-        //    signatures; we accept either base64 ASCII or already-decoded
-        //    bytes by trying base64 first.
-        let key =
-            CosignVerificationKey::try_from(&leaf_cert.tbs_certificate.subject_public_key_info)
-                .map_err(|_| AttestError::Malformed("unsupported leaf public key".into()))?;
-
-        verify_signature_bytes(&key, signature, artifact)?;
-
-        Ok(VerifiedAttestation {
-            subject_digest_sha256: Sha256::digest(artifact).into(),
-            certificate_identity: identity,
-            certificate_oidc_issuer: expected.certificate_oidc_issuer.clone(),
-            rekor_log_index: 0,
-            rekor_inclusion_verified: false,
-            signed_at: not_before,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn verify_bundle(
         &self,
         artifact: &[u8],
         bundle_json: &[u8],
         expected: &ExpectedIdentity,
     ) -> Result<VerifiedAttestation, AttestError> {
