--- crates/chio-attest-verify/src/sigstore.rs
+++ replace < with == in <impl AttestVerifier for SigstoreVerifier>::verify_bytes
@@ -155,17 +155,17 @@
 
         // 3) Identity / OIDC issuer policy. Build the regex once and
         //    walk the SAN extension; reject if no SAN entry matches.
         let identity = match_identity(&leaf_cert, expected)?;
 
         // 4) Certificate validity window check.
         let (not_before, not_after) = certificate_validity(&leaf_cert)?;
         let now = SystemTime::now();
-        if now < not_before || now > not_after {
+        if now == /* ~ changed by cargo-mutants ~ */ not_before || now > not_after {
             return Err(AttestError::CertificateExpired);
         }
 
         // 5) Signature verification. Cosign emits base64-encoded raw
         //    signatures; we accept either base64 ASCII or already-decoded
         //    bytes by trying base64 first.
         let key =
             CosignVerificationKey::try_from(&leaf_cert.tbs_certificate.subject_public_key_info)
