--- crates/chio-attest-verify/src/sigstore.rs
+++ replace <impl AttestVerifier for SigstoreVerifier>::verify_bundle -> Result<VerifiedAttestation, AttestError> with Ok(Default::default())
@@ -187,69 +187,17 @@
         &self,
         artifact: &[u8],
         bundle_json: &[u8],
         expected: &ExpectedIdentity,
     ) -> Result<VerifiedAttestation, AttestError> {
         // 1) Parse the bundle protobuf-as-JSON. `sigstore-rs` re-exports
         //    `sigstore_protobuf_specs::dev::sigstore::bundle::v1::Bundle`
         //    which derives serde's `Deserialize` via prost-reflect.
-        let bundle: Bundle = serde_json::from_slice(bundle_json)
-            .map_err(|e| AttestError::Malformed(format!("bundle JSON parse: {e}")))?;
-
-        // 2) Identity policy: regex-match the SAN ourselves AFTER the
-        //    bundle Verifier finishes; the upstream `Identity` policy
-        //    insists on an exact-string SAN match which is too narrow for
-        //    keyless OIDC subjects that include a sha-pinned ref. We
-        //    therefore use a permissive issuer-only policy here and
-        //    reapply the regex check post-verify against the leaf SAN.
-        let issuer_policy = IssuerOnlyPolicy {
-            expected_issuer: expected.certificate_oidc_issuer.clone(),
-        };
-
-        // 3) Drive the async verifier. `verify_bundle` is a synchronous
-        //    trait method, but `sigstore-rs`'s bundle verifier API is
-        //    async, so the future must be driven by *some* runtime. The
-        //    naive `self.runtime.block_on(...)` panics with "Cannot
-        //    start a runtime from within a runtime" whenever the caller
-        //    is itself running inside a tokio runtime (the typical case
-        //    for the kernel) - even when the inner runtime is a
-        //    different `Runtime` instance. Since this crate sits on a
-        //    trust boundary and explicitly forbids verification-path
-        //    panics via `#![forbid]` lints, we route around the panic
-        //    with a runtime-detection helper.
-        let mut hasher = Sha256::new();
-        hasher.update(artifact);
-        let bundle_clone = bundle.clone();
-        let verifier = self.build_bundle_verifier()?;
-        run_async_bundle_verify(&self.runtime, verifier, hasher, bundle_clone, issuer_policy)
-            .map_err(map_bundle_verification_error)?;
-
-        // 4) Re-parse the bundle for metadata extraction (the verifier
-        //    consumed the original by value).
-        let leaf_der = bundle_leaf_certificate_der(&bundle)?;
-        let leaf_cert = Certificate::from_der(&leaf_der)
-            .map_err(|e| AttestError::Malformed(format!("leaf cert DER parse: {e}")))?;
-
-        // 5) Identity SAN regex check (the upstream `Identity` policy
-        //    requires exact-string match; we want regex). We also
-        //    re-confirm the OIDC issuer extension.
-        let identity = match_identity(&leaf_cert, expected)?;
-
-        // 6) Pull Rekor metadata from the bundle for the receipt.
-        let (rekor_log_index, signed_at) = bundle_rekor_metadata(&bundle);
-
-        Ok(VerifiedAttestation {
-            subject_digest_sha256: Sha256::digest(artifact).into(),
-            certificate_identity: identity,
-            certificate_oidc_issuer: expected.certificate_oidc_issuer.clone(),
-            rekor_log_index,
-            rekor_inclusion_verified: bundle_rekor_inclusion_verified(&bundle),
-            signed_at,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------------------------------------------------------------
 // Helpers
 // ---------------------------------------------------------------------------
 
 /// Drive the async `sigstore-rs` bundle verifier from a synchronous
