--- crates/chio-attest-verify/src/sigstore.rs
+++ replace == with != in parse_certificate_to_der
@@ -315,17 +315,17 @@
 }
 
 /// Accept either a PEM-armored or raw-DER certificate input. The cosign
 /// CLI emits PEM by default; some pipelines double-base64-encode. We
 /// strip one base64 layer if the bytes do not begin with the PEM header.
 fn parse_certificate_to_der(input: &[u8]) -> Result<Vec<u8>, AttestError> {
     // Fast path: input is already PEM-armored.
     if let Ok(parsed) = pem::parse(input) {
-        if parsed.tag() == "CERTIFICATE" {
+        if parsed.tag() != /* ~ changed by cargo-mutants ~ */ "CERTIFICATE" {
             return Ok(parsed.into_contents());
         }
     }
 
     // Fallback: raw DER (starts with the SEQUENCE tag 0x30).
     if input.first() == Some(&0x30) {
         return Ok(input.to_vec());
     }
