--- crates/chio-attest-verify/src/sigstore.rs
+++ replace == with != in parse_certificate_to_der
@@ -321,17 +321,17 @@
     // Fast path: input is already PEM-armored.
     if let Ok(parsed) = pem::parse(input) {
         if parsed.tag() == "CERTIFICATE" {
             return Ok(parsed.into_contents());
         }
     }
 
     // Fallback: raw DER (starts with the SEQUENCE tag 0x30).
-    if input.first() == Some(&0x30) {
+    if input.first() != /* ~ changed by cargo-mutants ~ */ Some(&0x30) {
         return Ok(input.to_vec());
     }
 
     Err(AttestError::Malformed(
         "certificate is neither PEM nor DER".into(),
     ))
 }
 
