--- crates/chio-attest-verify/src/sigstore.rs
+++ replace validate_against_fulcio -> Result<(), AttestError> with Ok(())
@@ -334,47 +334,17 @@
         "certificate is neither PEM nor DER".into(),
     ))
 }
 
 fn validate_against_fulcio(
     leaf_der: &[u8],
     fulcio_root_ders: &[Vec<u8>],
 ) -> Result<(), AttestError> {
-    let trust_anchors: Vec<TrustAnchor<'_>> = fulcio_root_ders
-        .iter()
-        .map(|bytes| {
-            let der = CertificateDer::from(bytes.as_slice());
-            webpki::anchor_from_trusted_cert(&der).map(|a| a.to_owned())
-        })
-        .collect::<Result<Vec<_>, _>>()
-        .map_err(|_| AttestError::TrustRoot)?;
-
-    let leaf_der_handle = CertificateDer::from(leaf_der);
-    let end_entity = EndEntityCert::try_from(&leaf_der_handle)
-        .map_err(|_| AttestError::Malformed("leaf cert is not a valid EE cert".into()))?;
-
-    let now = SystemTime::now()
-        .duration_since(UNIX_EPOCH)
-        .map_err(|_| AttestError::CertificateExpired)?;
-    let unix_now = UnixTime::since_unix_epoch(now);
-
-    end_entity
-        .verify_for_usage(
-            webpki::ALL_VERIFICATION_ALGS,
-            &trust_anchors,
-            &[],
-            unix_now,
-            KeyUsage::required(ID_KP_CODE_SIGNING.as_bytes()),
-            None,
-            None,
-        )
-        .map_err(map_webpki_error)?;
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn map_webpki_error(err: webpki::Error) -> AttestError {
     match err {
         webpki::Error::CertNotValidYet { .. } | webpki::Error::CertExpired { .. } => {
             AttestError::CertificateExpired
         }
         webpki::Error::UnknownIssuer => AttestError::TrustRoot,
