--- crates/chio-attest-verify/src/sigstore.rs
+++ delete match arm webpki::Error::CertNotValidYet{..} | webpki::Error::CertExpired{..} in map_webpki_error
@@ -369,19 +369,17 @@
         )
         .map_err(map_webpki_error)?;
 
     Ok(())
 }
 
 fn map_webpki_error(err: webpki::Error) -> AttestError {
     match err {
-        webpki::Error::CertNotValidYet { .. } | webpki::Error::CertExpired { .. } => {
-            AttestError::CertificateExpired
-        }
+         /* ~ changed by cargo-mutants ~ */
         webpki::Error::UnknownIssuer => AttestError::TrustRoot,
         _ => AttestError::Malformed(format!("certificate chain validation: {err:?}")),
     }
 }
 
 fn match_identity(cert: &Certificate, expected: &ExpectedIdentity) -> Result<String, AttestError> {
     // 1) OIDC issuer extension MUST exactly equal the expected issuer.
     // The OIDC issuer is a public well-known URL (e.g. https://token.actions.githubusercontent.com),
