--- crates/chio-attest-verify/src/sigstore.rs
+++ delete match arm webpki::Error::UnknownIssuer in map_webpki_error
@@ -372,17 +372,17 @@
     Ok(())
 }
 
 fn map_webpki_error(err: webpki::Error) -> AttestError {
     match err {
         webpki::Error::CertNotValidYet { .. } | webpki::Error::CertExpired { .. } => {
             AttestError::CertificateExpired
         }
-        webpki::Error::UnknownIssuer => AttestError::TrustRoot,
+         /* ~ changed by cargo-mutants ~ */
         _ => AttestError::Malformed(format!("certificate chain validation: {err:?}")),
     }
 }
 
 fn match_identity(cert: &Certificate, expected: &ExpectedIdentity) -> Result<String, AttestError> {
     // 1) OIDC issuer extension MUST exactly equal the expected issuer.
     // The OIDC issuer is a public well-known URL (e.g. https://token.actions.githubusercontent.com),
     // not secret material. Plain `!=` is acceptable; constant-time equality is unnecessary because
