--- crates/chio-attest-verify/src/sigstore.rs
+++ replace match_identity -> Result<String, AttestError> with Ok("xyzzy".into())
@@ -382,56 +382,17 @@
     }
 }
 
 fn match_identity(cert: &Certificate, expected: &ExpectedIdentity) -> Result<String, AttestError> {
     // 1) OIDC issuer extension MUST exactly equal the expected issuer.
     // The OIDC issuer is a public well-known URL (e.g. https://token.actions.githubusercontent.com),
     // not secret material. Plain `!=` is acceptable; constant-time equality is unnecessary because
     // there is no secret on either side of the comparison whose timing leak would matter.
-    let issuer = read_oidc_issuer_extension(cert)?;
-    if issuer != expected.certificate_oidc_issuer {
-        return Err(AttestError::IssuerMismatch);
-    }
-
-    // 2) Build an anchored regex against the caller-supplied pattern.
-    let anchored = format!("^(?:{})$", expected.certificate_identity_regexp);
-    let regex = Regex::new(&anchored)
-        .map_err(|e| AttestError::Malformed(format!("identity regex compile: {e}")))?;
-
-    // 3) Walk the SAN extension and find the first matching entry.
-    let san_match = cert
-        .tbs_certificate
-        .get::<SubjectAltName>()
-        .map_err(|e| AttestError::Malformed(format!("SAN extension parse: {e}")))?;
-
-    let Some((_critical, san)) = san_match else {
-        return Err(AttestError::IdentityMismatch);
-    };
-
-    for name in san.0.iter() {
-        let candidate: Option<String> = match name {
-            GeneralName::Rfc822Name(s) => Some(s.as_str().to_owned()),
-            GeneralName::UniformResourceIdentifier(s) => Some(s.as_str().to_owned()),
-            GeneralName::OtherName(other) if other.type_id == OTHERNAME_OID => {
-                std::str::from_utf8(other.value.value())
-                    .ok()
-                    .map(|s| s.to_owned())
-            }
-            _ => None,
-        };
-
-        if let Some(candidate) = candidate {
-            if regex.is_match(&candidate) {
-                return Ok(candidate);
-            }
-        }
-    }
-
-    Err(AttestError::IdentityMismatch)
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_oidc_issuer_extension(cert: &Certificate) -> Result<String, AttestError> {
     let extensions = cert
         .tbs_certificate
         .extensions
         .as_ref()
         .ok_or_else(|| AttestError::Malformed("certificate has no extensions".into()))?;
