--- crates/chio-attest-verify/src/sigstore.rs
+++ replace != with == in match_identity
@@ -383,17 +383,17 @@
 }
 
 fn match_identity(cert: &Certificate, expected: &ExpectedIdentity) -> Result<String, AttestError> {
     // 1) OIDC issuer extension MUST exactly equal the expected issuer.
     // The OIDC issuer is a public well-known URL (e.g. https://token.actions.githubusercontent.com),
     // not secret material. Plain `!=` is acceptable; constant-time equality is unnecessary because
     // there is no secret on either side of the comparison whose timing leak would matter.
     let issuer = read_oidc_issuer_extension(cert)?;
-    if issuer != expected.certificate_oidc_issuer {
+    if issuer == /* ~ changed by cargo-mutants ~ */ expected.certificate_oidc_issuer {
         return Err(AttestError::IssuerMismatch);
     }
 
     // 2) Build an anchored regex against the caller-supplied pattern.
     let anchored = format!("^(?:{})$", expected.certificate_identity_regexp);
     let regex = Regex::new(&anchored)
         .map_err(|e| AttestError::Malformed(format!("identity regex compile: {e}")))?;
 
