--- crates/chio-attest-verify/src/sigstore.rs
+++ delete match arm GeneralName::Rfc822Name(s) in match_identity
@@ -404,17 +404,17 @@
         .map_err(|e| AttestError::Malformed(format!("SAN extension parse: {e}")))?;
 
     let Some((_critical, san)) = san_match else {
         return Err(AttestError::IdentityMismatch);
     };
 
     for name in san.0.iter() {
         let candidate: Option<String> = match name {
-            GeneralName::Rfc822Name(s) => Some(s.as_str().to_owned()),
+             /* ~ changed by cargo-mutants ~ */
             GeneralName::UniformResourceIdentifier(s) => Some(s.as_str().to_owned()),
             GeneralName::OtherName(other) if other.type_id == OTHERNAME_OID => {
                 std::str::from_utf8(other.value.value())
                     .ok()
                     .map(|s| s.to_owned())
             }
             _ => None,
         };
