--- crates/chio-attest-verify/src/sigstore.rs
+++ replace decode_oidc_issuer_value -> Result<String, AttestError> with Ok(String::new())
@@ -452,32 +452,17 @@
 /// path is tried FIRST so that an extension carrying the DER prefix
 /// (`0x0C <len> ...`) is not silently misread as raw UTF-8: `0x0C` is a
 /// valid ASCII byte (form feed), so a naive `str::from_utf8` +
 /// `is_ascii()` filter would return the bytes including the tag/length
 /// prefix and produce a malformed issuer that fails string equality
 /// downstream.
 fn decode_oidc_issuer_value(bytes: &[u8]) -> Result<String, AttestError> {
     // 1) DER UTF8String first.
-    if let Ok(parsed) = x509_cert::der::asn1::Utf8StringRef::from_der(bytes) {
-        return Ok(parsed.as_str().to_owned());
-    }
-
-    // 2) Fall back to raw UTF-8. Reject empty / non-printable strings;
-    //    a real OIDC issuer is a URL, never empty and never starts with
-    //    a control byte.
-    if let Ok(direct) = std::str::from_utf8(bytes) {
-        if !direct.is_empty() && direct.chars().all(|c| !c.is_control()) {
-            return Ok(direct.to_owned());
-        }
-    }
-
-    Err(AttestError::Malformed(
-        "OIDC issuer extension is neither DER UTF8String nor printable raw UTF-8".into(),
-    ))
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn certificate_validity(cert: &Certificate) -> Result<(SystemTime, SystemTime), AttestError> {
     let validity = &cert.tbs_certificate.validity;
     let not_before = UNIX_EPOCH + validity.not_before.to_unix_duration();
     let not_after = UNIX_EPOCH + validity.not_after.to_unix_duration();
     Ok((not_before, not_after))
 }
