--- crates/chio-attest-verify/src/sigstore.rs
+++ delete ! in decode_oidc_issuer_value
@@ -460,17 +460,17 @@
     if let Ok(parsed) = x509_cert::der::asn1::Utf8StringRef::from_der(bytes) {
         return Ok(parsed.as_str().to_owned());
     }
 
     // 2) Fall back to raw UTF-8. Reject empty / non-printable strings;
     //    a real OIDC issuer is a URL, never empty and never starts with
     //    a control byte.
     if let Ok(direct) = std::str::from_utf8(bytes) {
-        if !direct.is_empty() && direct.chars().all(|c| !c.is_control()) {
+        if !direct.is_empty() && direct.chars().all(|c|  /* ~ changed by cargo-mutants ~ */c.is_control()) {
             return Ok(direct.to_owned());
         }
     }
 
     Err(AttestError::Malformed(
         "OIDC issuer extension is neither DER UTF8String nor printable raw UTF-8".into(),
     ))
 }
