--- crates/chio-attest-verify/src/sigstore.rs
+++ replace certificate_validity -> Result<(SystemTime, SystemTime), AttestError> with Ok((Default::default(), Default::default()))
@@ -471,20 +471,17 @@
     }
 
     Err(AttestError::Malformed(
         "OIDC issuer extension is neither DER UTF8String nor printable raw UTF-8".into(),
     ))
 }
 
 fn certificate_validity(cert: &Certificate) -> Result<(SystemTime, SystemTime), AttestError> {
-    let validity = &cert.tbs_certificate.validity;
-    let not_before = UNIX_EPOCH + validity.not_before.to_unix_duration();
-    let not_after = UNIX_EPOCH + validity.not_after.to_unix_duration();
-    Ok((not_before, not_after))
+    Ok((Default::default(), Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 fn verify_signature_bytes(
     key: &CosignVerificationKey,
     signature: &[u8],
     msg: &[u8],
 ) -> Result<(), AttestError> {
     // Try base64 first (cosign emits base64). Fall back to raw bytes.
