--- crates/chio-attest-verify/src/sigstore.rs
+++ replace bundle_leaf_certificate_der -> Result<Vec<u8>, AttestError> with Ok(vec![])
@@ -492,18 +492,17 @@
     if base64_attempt.is_ok() {
         return Ok(());
     }
     key.verify_signature(SigstoreSignature::Raw(signature), msg)
         .map_err(|_| AttestError::SignatureMismatch)
 }
 
 fn bundle_leaf_certificate_der(bundle: &Bundle) -> Result<Vec<u8>, AttestError> {
-    use sigstore_protobuf_specs_compat::leaf_der;
-    leaf_der(bundle).ok_or_else(|| AttestError::Malformed("bundle has no leaf certificate".into()))
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn bundle_rekor_metadata(bundle: &Bundle) -> (u64, SystemTime) {
     use sigstore_protobuf_specs_compat::rekor_metadata;
     let (index, integrated) = rekor_metadata(bundle).unwrap_or((0, 0));
     let signed_at = if integrated > 0 {
         UNIX_EPOCH + Duration::from_secs(integrated as u64)
     } else {
