--- crates/chio-attest-verify/src/sigstore.rs
+++ replace + with * in bundle_rekor_metadata
@@ -500,17 +500,17 @@
     use sigstore_protobuf_specs_compat::leaf_der;
     leaf_der(bundle).ok_or_else(|| AttestError::Malformed("bundle has no leaf certificate".into()))
 }
 
 fn bundle_rekor_metadata(bundle: &Bundle) -> (u64, SystemTime) {
     use sigstore_protobuf_specs_compat::rekor_metadata;
     let (index, integrated) = rekor_metadata(bundle).unwrap_or((0, 0));
     let signed_at = if integrated > 0 {
-        UNIX_EPOCH + Duration::from_secs(integrated as u64)
+        UNIX_EPOCH * /* ~ changed by cargo-mutants ~ */ Duration::from_secs(integrated as u64)
     } else {
         SystemTime::now()
     };
     (index, signed_at)
 }
 
 fn bundle_rekor_inclusion_verified(_bundle: &Bundle) -> bool {
     // `sigstore-rs` 0.13 checks that the Rekor transparency entry is
