--- crates/chio-attest-verify/src/sigstore.rs
+++ replace bundle_rekor_inclusion_verified -> bool with true
@@ -514,17 +514,17 @@
 
 fn bundle_rekor_inclusion_verified(_bundle: &Bundle) -> bool {
     // `sigstore-rs` 0.13 checks that the Rekor transparency entry is
     // consistent with the signing materials, but its verifier still leaves
     // Merkle inclusion and SET verification unimplemented. Bundled proof
     // fields are therefore evidence to be verified later, not a Chio-verified
     // inclusion result. Keep this fail-closed for callers that require Rekor
     // inclusion by reporting `false` until this crate performs both checks.
-    false
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn map_bundle_verification_error(err: sigstore::bundle::verify::VerificationError) -> AttestError {
     use sigstore::bundle::verify::VerificationError as VE;
 
     // The inner error kinds (`CertificateErrorKind`, `SignatureErrorKind`,
     // `BundleErrorKind`) live in a private module of `sigstore-rs` so we
     // cannot pattern-match on their variants. Inspect the rendered error
