--- crates/chio-attest-verify/src/sigstore.rs
+++ replace map_bundle_verification_error -> AttestError with Default::default()
@@ -518,43 +518,17 @@
     // Merkle inclusion and SET verification unimplemented. Bundled proof
     // fields are therefore evidence to be verified later, not a Chio-verified
     // inclusion result. Keep this fail-closed for callers that require Rekor
     // inclusion by reporting `false` until this crate performs both checks.
     false
 }
 
 fn map_bundle_verification_error(err: sigstore::bundle::verify::VerificationError) -> AttestError {
-    use sigstore::bundle::verify::VerificationError as VE;
-
-    // The inner error kinds (`CertificateErrorKind`, `SignatureErrorKind`,
-    // `BundleErrorKind`) live in a private module of `sigstore-rs` so we
-    // cannot pattern-match on their variants. Inspect the rendered error
-    // string to disambiguate the most common cases (cert expiry, Rekor
-    // inclusion); fall back to a coarse-grained mapping otherwise.
-    let rendered = err.to_string().to_ascii_lowercase();
-    match err {
-        VE::Input(e) => AttestError::Io(io::Error::other(e.to_string())),
-        VE::Bundle(_) => AttestError::Malformed(format!("sigstore bundle: {rendered}")),
-        VE::Certificate(_) => {
-            if rendered.contains("expired") {
-                AttestError::CertificateExpired
-            } else {
-                AttestError::TrustRoot
-            }
-        }
-        VE::Signature(_) => {
-            if rendered.contains("transparency") {
-                AttestError::RekorInclusion
-            } else {
-                AttestError::SignatureMismatch
-            }
-        }
-        VE::Policy(_) => AttestError::IssuerMismatch,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// `sigstore-rs` re-exports the protobuf bundle struct without surface
 /// helpers for digging out the leaf cert / rekor index, so we walk the
 /// generated structs directly. Encapsulated in this submodule to keep
 /// the field-level pattern matches isolated from the verifier flow.
 mod sigstore_protobuf_specs_compat {
     use sigstore::bundle::Bundle;
