--- crates/chio-attest-verify/src/sigstore.rs
+++ replace sigstore_protobuf_specs_compat::leaf_der -> Option<Vec<u8>> with Some(vec![0])
@@ -556,28 +556,17 @@
 /// helpers for digging out the leaf cert / rekor index, so we walk the
 /// generated structs directly. Encapsulated in this submodule to keep
 /// the field-level pattern matches isolated from the verifier flow.
 mod sigstore_protobuf_specs_compat {
     use sigstore::bundle::Bundle;
     use sigstore_protobuf_specs::dev::sigstore::bundle::v1::verification_material;
 
     pub(super) fn leaf_der(bundle: &Bundle) -> Option<Vec<u8>> {
-        let material = bundle.verification_material.as_ref()?;
-        match material.content.as_ref()? {
-            verification_material::Content::X509CertificateChain(chain) => chain
-                .certificates
-                .first()
-                .map(|cert| cert.raw_bytes.clone()),
-            verification_material::Content::Certificate(cert) => Some(cert.raw_bytes.clone()),
-            // Future bundle profiles (e.g. raw `PublicKey`) cannot be
-            // chain-validated and so are rejected here. The verifier
-            // surfaces this as `AttestError::Malformed`.
-            _ => None,
-        }
+        Some(vec![0]) /* ~ changed by cargo-mutants ~ */
     }
 
     pub(super) fn rekor_metadata(bundle: &Bundle) -> Option<(u64, i64)> {
         let material = bundle.verification_material.as_ref()?;
         let entry = material.tlog_entries.first()?;
         Some((entry.log_index as u64, entry.integrated_time))
     }
 }
