--- crates/chio-attest-verify/src/sigstore.rs
+++ delete match arm verification_material::Content::X509CertificateChain(chain) in sigstore_protobuf_specs_compat::leaf_der
@@ -558,20 +558,17 @@
 /// the field-level pattern matches isolated from the verifier flow.
 mod sigstore_protobuf_specs_compat {
     use sigstore::bundle::Bundle;
     use sigstore_protobuf_specs::dev::sigstore::bundle::v1::verification_material;
 
     pub(super) fn leaf_der(bundle: &Bundle) -> Option<Vec<u8>> {
         let material = bundle.verification_material.as_ref()?;
         match material.content.as_ref()? {
-            verification_material::Content::X509CertificateChain(chain) => chain
-                .certificates
-                .first()
-                .map(|cert| cert.raw_bytes.clone()),
+             /* ~ changed by cargo-mutants ~ */
             verification_material::Content::Certificate(cert) => Some(cert.raw_bytes.clone()),
             // Future bundle profiles (e.g. raw `PublicKey`) cannot be
             // chain-validated and so are rejected here. The verifier
             // surfaces this as `AttestError::Malformed`.
             _ => None,
         }
     }
 
