--- crates/chio-attest-verify/src/sigstore.rs
+++ delete match arm verification_material::Content::Certificate(cert) in sigstore_protobuf_specs_compat::leaf_der
@@ -562,17 +562,17 @@
 
     pub(super) fn leaf_der(bundle: &Bundle) -> Option<Vec<u8>> {
         let material = bundle.verification_material.as_ref()?;
         match material.content.as_ref()? {
             verification_material::Content::X509CertificateChain(chain) => chain
                 .certificates
                 .first()
                 .map(|cert| cert.raw_bytes.clone()),
-            verification_material::Content::Certificate(cert) => Some(cert.raw_bytes.clone()),
+             /* ~ changed by cargo-mutants ~ */
             // Future bundle profiles (e.g. raw `PublicKey`) cannot be
             // chain-validated and so are rejected here. The verifier
             // surfaces this as `AttestError::Malformed`.
             _ => None,
         }
     }
 
     pub(super) fn rekor_metadata(bundle: &Bundle) -> Option<(u64, i64)> {
