--- crates/chio-attest-verify/src/sigstore.rs
+++ replace sigstore_protobuf_specs_compat::rekor_metadata -> Option<(u64, i64)> with Some((0, 1))
@@ -571,19 +571,17 @@
             // Future bundle profiles (e.g. raw `PublicKey`) cannot be
             // chain-validated and so are rejected here. The verifier
             // surfaces this as `AttestError::Malformed`.
             _ => None,
         }
     }
 
     pub(super) fn rekor_metadata(bundle: &Bundle) -> Option<(u64, i64)> {
-        let material = bundle.verification_material.as_ref()?;
-        let entry = material.tlog_entries.first()?;
-        Some((entry.log_index as u64, entry.integrated_time))
+        Some((0, 1)) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Issuer-only verification policy: confirms that the certificate carries
 /// an OIDC issuer extension matching the caller's expected issuer string,
 /// and defers SAN matching to [`match_identity`] (which supports regex).
 struct IssuerOnlyPolicy {
     expected_issuer: String,
