--- crates/chio-attest-verify/src/sigstore.rs
+++ replace <impl VerificationPolicy for IssuerOnlyPolicy>::verify -> Result<(), sigstore::bundle::verify::PolicyError> with Ok(())
@@ -589,49 +589,17 @@
     expected_issuer: String,
 }
 
 impl VerificationPolicy for IssuerOnlyPolicy {
     fn verify(
         &self,
         cert: &x509_cert::Certificate,
     ) -> Result<(), sigstore::bundle::verify::PolicyError> {
-        use sigstore::bundle::verify::PolicyError;
-
-        let extensions = cert
-            .tbs_certificate
-            .extensions
-            .as_ref()
-            .ok_or(PolicyError::ExtensionNotFound)?;
-
-        for ext in extensions.iter() {
-            if ext.extn_id == OIDC_ISSUER_OID {
-                let bytes = ext.extn_value.as_bytes();
-                // Use the same DER-first decoder as
-                // `read_oidc_issuer_extension`: trying raw UTF-8 first
-                // silently mis-reads DER UTF8String wrappers because
-                // the tag byte (0x0C) is ASCII. Decoder failure
-                // surfaces as ExtensionNotFound to match the upstream
-                // policy contract.
-                let actual = match decode_oidc_issuer_value(bytes) {
-                    Ok(s) => s,
-                    Err(_) => return Err(PolicyError::ExtensionNotFound),
-                };
-                // Plain `==` on a public OIDC issuer URL: no secret-material timing channel.
-                if actual == self.expected_issuer {
-                    return Ok(());
-                }
-                return Err(PolicyError::ExtensionCheckFailed {
-                    extension: "OIDCIssuer".to_owned(),
-                    expected: self.expected_issuer.clone(),
-                    actual,
-                });
-            }
-        }
-        Err(PolicyError::ExtensionNotFound)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // Bring `Identity` into scope for downstream consumers that may want to
 // build their own policies on top of the shared trust root. This re-export
 // is intentional and stable.
 #[allow(unused_imports)]
 pub use sigstore::bundle::verify::policy::Identity as SigstoreIdentityPolicy;
