--- crates/chio-attest-verify/src/sigstore.rs
+++ replace == with != in <impl VerificationPolicy for IssuerOnlyPolicy>::verify
@@ -611,17 +611,17 @@
                 // the tag byte (0x0C) is ASCII. Decoder failure
                 // surfaces as ExtensionNotFound to match the upstream
                 // policy contract.
                 let actual = match decode_oidc_issuer_value(bytes) {
                     Ok(s) => s,
                     Err(_) => return Err(PolicyError::ExtensionNotFound),
                 };
                 // Plain `==` on a public OIDC issuer URL: no secret-material timing channel.
-                if actual == self.expected_issuer {
+                if actual != /* ~ changed by cargo-mutants ~ */ self.expected_issuer {
                     return Ok(());
                 }
                 return Err(PolicyError::ExtensionCheckFailed {
                     extension: "OIDCIssuer".to_owned(),
                     expected: self.expected_issuer.clone(),
                     actual,
                 });
             }
