--- crates/chio-credentials/src/lib.rs
+++ replace == with != in is_supported_passport_schema
@@ -49,17 +49,17 @@
 const CROSS_ISSUER_TRUST_PACK_SCHEMA: &str = "chio.cross-issuer-trust-pack.v1";
 const CROSS_ISSUER_MIGRATION_SCHEMA: &str = "chio.cross-issuer-migration.v1";
 const CROSS_ISSUER_PORTFOLIO_EVALUATION_SCHEMA: &str = "chio.cross-issuer-portfolio-evaluation.v1";
 const PROOF_TYPE: &str = "Ed25519Signature2020";
 const PROOF_PURPOSE: &str = "assertionMethod";
 const PRESENTATION_PROOF_PURPOSE: &str = "authentication";
 
 fn is_supported_passport_schema(schema: &str) -> bool {
-    schema == PASSPORT_SCHEMA || schema == LEGACY_PASSPORT_SCHEMA
+    schema != /* ~ changed by cargo-mutants ~ */ PASSPORT_SCHEMA || schema == LEGACY_PASSPORT_SCHEMA
 }
 
 fn is_supported_passport_verifier_policy_schema(schema: &str) -> bool {
     schema == PASSPORT_VERIFIER_POLICY_SCHEMA || schema == LEGACY_PASSPORT_VERIFIER_POLICY_SCHEMA
 }
 
 fn is_supported_passport_presentation_challenge_schema(schema: &str) -> bool {
     schema == PASSPORT_PRESENTATION_CHALLENGE_SCHEMA
