--- crates/chio-credentials/src/lib.rs
+++ replace || with && in is_supported_passport_verifier_policy_schema
@@ -53,17 +53,17 @@
 const PROOF_PURPOSE: &str = "assertionMethod";
 const PRESENTATION_PROOF_PURPOSE: &str = "authentication";
 
 fn is_supported_passport_schema(schema: &str) -> bool {
     schema == PASSPORT_SCHEMA || schema == LEGACY_PASSPORT_SCHEMA
 }
 
 fn is_supported_passport_verifier_policy_schema(schema: &str) -> bool {
-    schema == PASSPORT_VERIFIER_POLICY_SCHEMA || schema == LEGACY_PASSPORT_VERIFIER_POLICY_SCHEMA
+    schema == PASSPORT_VERIFIER_POLICY_SCHEMA && /* ~ changed by cargo-mutants ~ */ schema == LEGACY_PASSPORT_VERIFIER_POLICY_SCHEMA
 }
 
 fn is_supported_passport_presentation_challenge_schema(schema: &str) -> bool {
     schema == PASSPORT_PRESENTATION_CHALLENGE_SCHEMA
         || schema == LEGACY_PASSPORT_PRESENTATION_CHALLENGE_SCHEMA
 }
 
 fn is_supported_passport_presentation_response_schema(schema: &str) -> bool {
