--- crates/chio-credentials/src/lib.rs
+++ replace == with != in is_supported_passport_presentation_challenge_schema
@@ -57,17 +57,17 @@
     schema == PASSPORT_SCHEMA || schema == LEGACY_PASSPORT_SCHEMA
 }
 
 fn is_supported_passport_verifier_policy_schema(schema: &str) -> bool {
     schema == PASSPORT_VERIFIER_POLICY_SCHEMA || schema == LEGACY_PASSPORT_VERIFIER_POLICY_SCHEMA
 }
 
 fn is_supported_passport_presentation_challenge_schema(schema: &str) -> bool {
-    schema == PASSPORT_PRESENTATION_CHALLENGE_SCHEMA
+    schema != /* ~ changed by cargo-mutants ~ */ PASSPORT_PRESENTATION_CHALLENGE_SCHEMA
         || schema == LEGACY_PASSPORT_PRESENTATION_CHALLENGE_SCHEMA
 }
 
 fn is_supported_passport_presentation_response_schema(schema: &str) -> bool {
     schema == PASSPORT_PRESENTATION_RESPONSE_SCHEMA
         || schema == LEGACY_PASSPORT_PRESENTATION_RESPONSE_SCHEMA
 }
 
