--- crates/chio-credentials/src/lib.rs
+++ replace is_supported_passport_presentation_challenge_schema -> bool with true
@@ -57,18 +57,17 @@
     schema == PASSPORT_SCHEMA || schema == LEGACY_PASSPORT_SCHEMA
 }
 
 fn is_supported_passport_verifier_policy_schema(schema: &str) -> bool {
     schema == PASSPORT_VERIFIER_POLICY_SCHEMA || schema == LEGACY_PASSPORT_VERIFIER_POLICY_SCHEMA
 }
 
 fn is_supported_passport_presentation_challenge_schema(schema: &str) -> bool {
-    schema == PASSPORT_PRESENTATION_CHALLENGE_SCHEMA
-        || schema == LEGACY_PASSPORT_PRESENTATION_CHALLENGE_SCHEMA
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_supported_passport_presentation_response_schema(schema: &str) -> bool {
     schema == PASSPORT_PRESENTATION_RESPONSE_SCHEMA
         || schema == LEGACY_PASSPORT_PRESENTATION_RESPONSE_SCHEMA
 }
 
 pub mod trust_tier;
