--- crates/chio-credentials/src/lib.rs
+++ replace == with != in is_supported_passport_presentation_response_schema
@@ -62,17 +62,17 @@
 }
 
 fn is_supported_passport_presentation_challenge_schema(schema: &str) -> bool {
     schema == PASSPORT_PRESENTATION_CHALLENGE_SCHEMA
         || schema == LEGACY_PASSPORT_PRESENTATION_CHALLENGE_SCHEMA
 }
 
 fn is_supported_passport_presentation_response_schema(schema: &str) -> bool {
-    schema == PASSPORT_PRESENTATION_RESPONSE_SCHEMA
+    schema != /* ~ changed by cargo-mutants ~ */ PASSPORT_PRESENTATION_RESPONSE_SCHEMA
         || schema == LEGACY_PASSPORT_PRESENTATION_RESPONSE_SCHEMA
 }
 
 pub mod trust_tier;
 pub use trust_tier::{
     synthesize_trust_tier, TrustTier, TRUST_TIER_ATTESTED_MIN, TRUST_TIER_PREMIER_MIN,
     TRUST_TIER_VERIFIED_MIN,
 };
