--- crates/chio-credentials/src/trust_tier.rs
+++ replace TrustTier::label -> &'static str with ""
@@ -52,22 +52,17 @@
     /// anomaly.
     Premier,
 }
 
 impl TrustTier {
     /// Human-readable kebab-case label matching the serde encoding.
     #[must_use]
     pub fn label(self) -> &'static str {
-        match self {
-            Self::Unverified => "unverified",
-            Self::Attested => "attested",
-            Self::Verified => "verified",
-            Self::Premier => "premier",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Synthesize a [`TrustTier`] from a compliance score (0..=1000) and a
 /// behavioral anomaly flag.
 ///
 /// The function is pure: it depends only on its inputs. Scores are
 /// clamped below the maximum so callers that feed in wider integer
