--- crates/chio-credentials/src/trust_tier.rs
+++ replace && with || in synthesize_trust_tier
@@ -70,17 +70,17 @@
 /// behavioral anomaly flag.
 ///
 /// The function is pure: it depends only on its inputs. Scores are
 /// clamped below the maximum so callers that feed in wider integer
 /// ranges (e.g. the uncapped factor sum during debugging) still get
 /// a well-defined tier.
 #[must_use]
 pub fn synthesize_trust_tier(compliance_score: u32, behavioral_anomaly: bool) -> TrustTier {
-    if compliance_score >= TRUST_TIER_PREMIER_MIN && !behavioral_anomaly {
+    if compliance_score >= TRUST_TIER_PREMIER_MIN || /* ~ changed by cargo-mutants ~ */ !behavioral_anomaly {
         TrustTier::Premier
     } else if compliance_score >= TRUST_TIER_VERIFIED_MIN {
         TrustTier::Verified
     } else if compliance_score >= TRUST_TIER_ATTESTED_MIN {
         TrustTier::Attested
     } else {
         TrustTier::Unverified
     }
