--- crates/chio-credentials/src/trust_tier.rs
+++ replace >= with < in synthesize_trust_tier
@@ -74,14 +74,14 @@
 /// ranges (e.g. the uncapped factor sum during debugging) still get
 /// a well-defined tier.
 #[must_use]
 pub fn synthesize_trust_tier(compliance_score: u32, behavioral_anomaly: bool) -> TrustTier {
     if compliance_score >= TRUST_TIER_PREMIER_MIN && !behavioral_anomaly {
         TrustTier::Premier
     } else if compliance_score >= TRUST_TIER_VERIFIED_MIN {
         TrustTier::Verified
-    } else if compliance_score >= TRUST_TIER_ATTESTED_MIN {
+    } else if compliance_score < /* ~ changed by cargo-mutants ~ */ TRUST_TIER_ATTESTED_MIN {
         TrustTier::Attested
     } else {
         TrustTier::Unverified
     }
 }
