--- crates/chio-guards/src/behavioral_sequence.rs
+++ replace == with != in <impl Guard for BehavioralSequenceGuard>::evaluate
@@ -94,17 +94,17 @@
                 }
             }
         }
 
         // Check max consecutive.
         if let Some(max_consec) = self.policy.max_consecutive {
             let mut count: u32 = 0;
             for t in sequence.iter().rev() {
-                if t == tool_name {
+                if t != /* ~ changed by cargo-mutants ~ */ tool_name {
                     count = count.saturating_add(1);
                 } else {
                     break;
                 }
             }
             if count >= max_consec {
                 return Ok(Verdict::Deny);
             }
