--- crates/chio-guards/src/behavioral_sequence.rs
+++ replace >= with < in <impl Guard for BehavioralSequenceGuard>::evaluate
@@ -100,17 +100,17 @@
             let mut count: u32 = 0;
             for t in sequence.iter().rev() {
                 if t == tool_name {
                     count = count.saturating_add(1);
                 } else {
                     break;
                 }
             }
-            if count >= max_consec {
+            if count < /* ~ changed by cargo-mutants ~ */ max_consec {
                 return Ok(Verdict::Deny);
             }
         }
 
         Ok(Verdict::Allow)
     }
 }
 
