--- crates/chio-guards/src/behavioral_sequence.rs
+++ replace <impl Guard for BehavioralSequenceGuard>::evaluate -> Result<Verdict, KernelError> with Ok(Default::default())
@@ -54,68 +54,17 @@
 }
 
 impl Guard for BehavioralSequenceGuard {
     fn name(&self) -> &str {
         "behavioral-sequence"
     }
 
     fn evaluate(&self, ctx: &GuardContext) -> Result<Verdict, KernelError> {
-        let tool_name = &ctx.request.tool_name;
-
-        let sequence = self.journal.tool_sequence().map_err(|e| {
-            KernelError::Internal(format!(
-                "behavioral-sequence guard journal error (fail-closed): {e}"
-            ))
-        })?;
-
-        // Check required first tool.
-        if sequence.is_empty() {
-            if let Some(ref required_first) = self.policy.required_first_tool {
-                if tool_name != required_first {
-                    return Ok(Verdict::Deny);
-                }
-            }
-        }
-
-        // Check required predecessors.
-        if let Some(required) = self.policy.required_predecessors.get(tool_name) {
-            let invoked: HashSet<&str> = sequence.iter().map(|s| s.as_str()).collect();
-            for req in required {
-                if !invoked.contains(req.as_str()) {
-                    return Ok(Verdict::Deny);
-                }
-            }
-        }
-
-        // Check forbidden transitions.
-        if let Some(last_tool) = sequence.last() {
-            for (from, to) in &self.policy.forbidden_transitions {
-                if last_tool == from && tool_name == to {
-                    return Ok(Verdict::Deny);
-                }
-            }
-        }
-
-        // Check max consecutive.
-        if let Some(max_consec) = self.policy.max_consecutive {
-            let mut count: u32 = 0;
-            for t in sequence.iter().rev() {
-                if t == tool_name {
-                    count = count.saturating_add(1);
-                } else {
-                    break;
-                }
-            }
-            if count >= max_consec {
-                return Ok(Verdict::Deny);
-            }
-        }
-
-        Ok(Verdict::Allow)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use chio_http_session::RecordParams;
 
