--- crates/chio-guards/src/behavioral_sequence.rs
+++ replace != with == in <impl Guard for BehavioralSequenceGuard>::evaluate
@@ -65,17 +65,17 @@
             KernelError::Internal(format!(
                 "behavioral-sequence guard journal error (fail-closed): {e}"
             ))
         })?;
 
         // Check required first tool.
         if sequence.is_empty() {
             if let Some(ref required_first) = self.policy.required_first_tool {
-                if tool_name != required_first {
+                if tool_name == /* ~ changed by cargo-mutants ~ */ required_first {
                     return Ok(Verdict::Deny);
                 }
             }
         }
 
         // Check required predecessors.
         if let Some(required) = self.policy.required_predecessors.get(tool_name) {
             let invoked: HashSet<&str> = sequence.iter().map(|s| s.as_str()).collect();
