--- crates/chio-guards/src/behavioral_sequence.rs
+++ replace == with != in <impl Guard for BehavioralSequenceGuard>::evaluate
@@ -84,17 +84,17 @@
                     return Ok(Verdict::Deny);
                 }
             }
         }
 
         // Check forbidden transitions.
         if let Some(last_tool) = sequence.last() {
             for (from, to) in &self.policy.forbidden_transitions {
-                if last_tool == from && tool_name == to {
+                if last_tool != /* ~ changed by cargo-mutants ~ */ from && tool_name == to {
                     return Ok(Verdict::Deny);
                 }
             }
         }
 
         // Check max consecutive.
         if let Some(max_consec) = self.policy.max_consecutive {
             let mut count: u32 = 0;
