--- crates/chio-guards/src/data_flow.rs
+++ replace <impl Guard for DataFlowGuard>::evaluate -> Result<Verdict, KernelError> with Ok(Default::default())
@@ -48,45 +48,17 @@
 }
 
 impl Guard for DataFlowGuard {
     fn name(&self) -> &str {
         "data-flow"
     }
 
     fn evaluate(&self, _ctx: &GuardContext) -> Result<Verdict, KernelError> {
-        let flow = self.journal.data_flow().map_err(|e| {
-            KernelError::Internal(format!("data-flow guard journal error (fail-closed): {e}"))
-        })?;
-
-        // Check bytes read limit.
-        if let Some(max_read) = self.config.max_bytes_read {
-            if flow.total_bytes_read >= max_read {
-                return Ok(Verdict::Deny);
-            }
-        }
-
-        // Check bytes written limit.
-        if let Some(max_written) = self.config.max_bytes_written {
-            if flow.total_bytes_written >= max_written {
-                return Ok(Verdict::Deny);
-            }
-        }
-
-        // Check total I/O limit.
-        if let Some(max_total) = self.config.max_bytes_total {
-            let total = flow
-                .total_bytes_read
-                .saturating_add(flow.total_bytes_written);
-            if total >= max_total {
-                return Ok(Verdict::Deny);
-            }
-        }
-
-        Ok(Verdict::Allow)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use chio_http_session::RecordParams;
 
