--- crates/chio-guards/src/data_flow.rs
+++ replace >= with < in <impl Guard for DataFlowGuard>::evaluate
@@ -54,17 +54,17 @@
 
     fn evaluate(&self, _ctx: &GuardContext) -> Result<Verdict, KernelError> {
         let flow = self.journal.data_flow().map_err(|e| {
             KernelError::Internal(format!("data-flow guard journal error (fail-closed): {e}"))
         })?;
 
         // Check bytes read limit.
         if let Some(max_read) = self.config.max_bytes_read {
-            if flow.total_bytes_read >= max_read {
+            if flow.total_bytes_read < /* ~ changed by cargo-mutants ~ */ max_read {
                 return Ok(Verdict::Deny);
             }
         }
 
         // Check bytes written limit.
         if let Some(max_written) = self.config.max_bytes_written {
             if flow.total_bytes_written >= max_written {
                 return Ok(Verdict::Deny);
