--- crates/chio-guards/src/data_flow.rs
+++ replace >= with < in <impl Guard for DataFlowGuard>::evaluate
@@ -71,17 +71,17 @@
             }
         }
 
         // Check total I/O limit.
         if let Some(max_total) = self.config.max_bytes_total {
             let total = flow
                 .total_bytes_read
                 .saturating_add(flow.total_bytes_written);
-            if total >= max_total {
+            if total < /* ~ changed by cargo-mutants ~ */ max_total {
                 return Ok(Verdict::Deny);
             }
         }
 
         Ok(Verdict::Allow)
     }
 }
 
