--- crates/chio-guards/src/egress_allowlist.rs
+++ replace <impl chio_kernel::Guard for EgressAllowlistGuard>::name -> &str with ""
@@ -113,17 +113,17 @@
 impl Default for EgressAllowlistGuard {
     fn default() -> Self {
         Self::new()
     }
 }
 
 impl chio_kernel::Guard for EgressAllowlistGuard {
     fn name(&self) -> &str {
-        "egress-allowlist"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn evaluate(&self, ctx: &GuardContext) -> Result<Verdict, KernelError> {
         let action = extract_action(&ctx.request.tool_name, &ctx.request.arguments);
 
         let host = match &action {
             ToolAction::NetworkEgress(h, _) => h.as_str(),
             _ => return Ok(Verdict::Allow),
