--- crates/chio-guards/src/egress_allowlist.rs
+++ replace <impl chio_kernel::Guard for EgressAllowlistGuard>::evaluate -> Result<Verdict, KernelError> with Ok(Default::default())
@@ -117,28 +117,17 @@
 }
 
 impl chio_kernel::Guard for EgressAllowlistGuard {
     fn name(&self) -> &str {
         "egress-allowlist"
     }
 
     fn evaluate(&self, ctx: &GuardContext) -> Result<Verdict, KernelError> {
-        let action = extract_action(&ctx.request.tool_name, &ctx.request.arguments);
-
-        let host = match &action {
-            ToolAction::NetworkEgress(h, _) => h.as_str(),
-            _ => return Ok(Verdict::Allow),
-        };
-
-        if self.is_allowed(host) {
-            Ok(Verdict::Allow)
-        } else {
-            Ok(Verdict::Deny)
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
