--- crates/chio-guards/src/egress_allowlist.rs
+++ delete match arm ToolAction::NetworkEgress(h, _) in <impl chio_kernel::Guard for EgressAllowlistGuard>::evaluate
@@ -120,17 +120,17 @@
     fn name(&self) -> &str {
         "egress-allowlist"
     }
 
     fn evaluate(&self, ctx: &GuardContext) -> Result<Verdict, KernelError> {
         let action = extract_action(&ctx.request.tool_name, &ctx.request.arguments);
 
         let host = match &action {
-            ToolAction::NetworkEgress(h, _) => h.as_str(),
+             /* ~ changed by cargo-mutants ~ */
             _ => return Ok(Verdict::Allow),
         };
 
         if self.is_allowed(host) {
             Ok(Verdict::Allow)
         } else {
             Ok(Verdict::Deny)
         }
