--- crates/chio-guards/src/forbidden_path.rs
+++ replace || with && in ForbiddenPathGuard::is_forbidden
@@ -98,17 +98,17 @@
         let resolved_differs_from_lexical_target = lexical_abs_path
             .as_deref()
             .map(|abs| abs != resolved_path.as_str())
             .unwrap_or(resolved_path != lexical_path);
 
         // Check exceptions first
         for exception in &self.exceptions {
             let lexical_matches = exception.matches(&lexical_path)
-                || lexical_abs_path
+                && /* ~ changed by cargo-mutants ~ */ lexical_abs_path
                     .as_deref()
                     .map(|abs| exception.matches(abs))
                     .unwrap_or(false);
             let resolved_matches = exception.matches(&resolved_path);
             let exception_matches = if resolved_differs_from_lexical_target {
                 resolved_matches
             } else {
                 resolved_matches || lexical_matches
