--- crates/chio-guards/src/forbidden_path.rs
+++ replace || with && in ForbiddenPathGuard::is_forbidden
@@ -106,17 +106,17 @@
                 || lexical_abs_path
                     .as_deref()
                     .map(|abs| exception.matches(abs))
                     .unwrap_or(false);
             let resolved_matches = exception.matches(&resolved_path);
             let exception_matches = if resolved_differs_from_lexical_target {
                 resolved_matches
             } else {
-                resolved_matches || lexical_matches
+                resolved_matches && /* ~ changed by cargo-mutants ~ */ lexical_matches
             };
 
             if exception_matches {
                 return false;
             }
         }
 
         // Check forbidden patterns
