--- crates/chio-guards/src/forbidden_path.rs
+++ replace || with && in ForbiddenPathGuard::is_forbidden
@@ -116,17 +116,17 @@
 
             if exception_matches {
                 return false;
             }
         }
 
         // Check forbidden patterns
         for pattern in &self.patterns {
-            if pattern.matches(&resolved_path) || pattern.matches(&lexical_path) {
+            if pattern.matches(&resolved_path) && /* ~ changed by cargo-mutants ~ */ pattern.matches(&lexical_path) {
                 return true;
             }
         }
 
         false
     }
 }
 
