--- crates/chio-guards/src/forbidden_path.rs
+++ replace <impl chio_kernel::Guard for ForbiddenPathGuard>::name -> &str with ""
@@ -133,17 +133,17 @@
 impl Default for ForbiddenPathGuard {
     fn default() -> Self {
         Self::new()
     }
 }
 
 impl chio_kernel::Guard for ForbiddenPathGuard {
     fn name(&self) -> &str {
-        "forbidden-path"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn evaluate(&self, ctx: &GuardContext) -> Result<Verdict, KernelError> {
         let action = extract_action(&ctx.request.tool_name, &ctx.request.arguments);
 
         let path = match &action {
             ToolAction::FileAccess(p) | ToolAction::FileWrite(p, _) | ToolAction::Patch(p, _) => {
                 Some(p.as_str())
