--- crates/chio-guards/src/forbidden_path.rs
+++ replace <impl chio_kernel::Guard for ForbiddenPathGuard>::evaluate -> Result<Verdict, KernelError> with Ok(Default::default())
@@ -137,34 +137,17 @@
 }
 
 impl chio_kernel::Guard for ForbiddenPathGuard {
     fn name(&self) -> &str {
         "forbidden-path"
     }
 
     fn evaluate(&self, ctx: &GuardContext) -> Result<Verdict, KernelError> {
-        let action = extract_action(&ctx.request.tool_name, &ctx.request.arguments);
-
-        let path = match &action {
-            ToolAction::FileAccess(p) | ToolAction::FileWrite(p, _) | ToolAction::Patch(p, _) => {
-                Some(p.as_str())
-            }
-            _ => None,
-        };
-
-        let Some(path) = path else {
-            return Ok(Verdict::Allow);
-        };
-
-        if self.is_forbidden(path) {
-            Ok(Verdict::Deny)
-        } else {
-            Ok(Verdict::Allow)
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
