--- crates/chio-guards/src/forbidden_path.rs
+++ delete match arm ToolAction::FileAccess(p) | ToolAction::FileWrite(p, _) | ToolAction::Patch(p, _) in <impl chio_kernel::Guard for ForbiddenPathGuard>::evaluate
@@ -140,19 +140,17 @@
     fn name(&self) -> &str {
         "forbidden-path"
     }
 
     fn evaluate(&self, ctx: &GuardContext) -> Result<Verdict, KernelError> {
         let action = extract_action(&ctx.request.tool_name, &ctx.request.arguments);
 
         let path = match &action {
-            ToolAction::FileAccess(p) | ToolAction::FileWrite(p, _) | ToolAction::Patch(p, _) => {
-                Some(p.as_str())
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         };
 
         let Some(path) = path else {
             return Ok(Verdict::Allow);
         };
 
         if self.is_forbidden(path) {
