--- crates/chio-guards/src/forbidden_path.rs
+++ replace ForbiddenPathGuard::with_patterns -> Self with Default::default()
@@ -72,28 +72,17 @@
 }
 
 impl ForbiddenPathGuard {
     pub fn new() -> Self {
         Self::with_patterns(default_forbidden_patterns(), vec![])
     }
 
     pub fn with_patterns(patterns: Vec<String>, exceptions: Vec<String>) -> Self {
-        let patterns = patterns
-            .iter()
-            .filter_map(|p| Pattern::new(p).ok())
-            .collect();
-        let exceptions = exceptions
-            .iter()
-            .filter_map(|p| Pattern::new(p).ok())
-            .collect();
-        Self {
-            patterns,
-            exceptions,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_forbidden(&self, path: &str) -> bool {
         let lexical_path = normalize_path_for_policy(path);
         let resolved_path = normalize_path_for_policy_with_fs(path);
         let lexical_abs_path = normalize_path_for_policy_lexical_absolute(path);
         let resolved_differs_from_lexical_target = lexical_abs_path
             .as_deref()
