--- crates/chio-guards/src/forbidden_path.rs
+++ replace ForbiddenPathGuard::is_forbidden -> bool with true
@@ -87,51 +87,17 @@
             .collect();
         Self {
             patterns,
             exceptions,
         }
     }
 
     pub fn is_forbidden(&self, path: &str) -> bool {
-        let lexical_path = normalize_path_for_policy(path);
-        let resolved_path = normalize_path_for_policy_with_fs(path);
-        let lexical_abs_path = normalize_path_for_policy_lexical_absolute(path);
-        let resolved_differs_from_lexical_target = lexical_abs_path
-            .as_deref()
-            .map(|abs| abs != resolved_path.as_str())
-            .unwrap_or(resolved_path != lexical_path);
-
-        // Check exceptions first
-        for exception in &self.exceptions {
-            let lexical_matches = exception.matches(&lexical_path)
-                || lexical_abs_path
-                    .as_deref()
-                    .map(|abs| exception.matches(abs))
-                    .unwrap_or(false);
-            let resolved_matches = exception.matches(&resolved_path);
-            let exception_matches = if resolved_differs_from_lexical_target {
-                resolved_matches
-            } else {
-                resolved_matches || lexical_matches
-            };
-
-            if exception_matches {
-                return false;
-            }
-        }
-
-        // Check forbidden patterns
-        for pattern in &self.patterns {
-            if pattern.matches(&resolved_path) || pattern.matches(&lexical_path) {
-                return true;
-            }
-        }
-
-        false
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for ForbiddenPathGuard {
     fn default() -> Self {
         Self::new()
     }
 }
