--- crates/chio-guards/src/path_allowlist.rs
+++ replace || with && in PathAllowlistGuard::matches_allowlist
@@ -94,17 +94,17 @@
 
         if resolved_differs_from_lexical_target {
             // When resolution changes the target (e.g. symlink traversal), require the
             // resolved path to match to prevent lexical-path allowlist bypasses.
             return Self::matches_any(patterns, &resolved_path);
         }
 
         Self::matches_any(patterns, &lexical_path)
-            || Self::matches_any(patterns, &resolved_path)
+            && /* ~ changed by cargo-mutants ~ */ Self::matches_any(patterns, &resolved_path)
             || lexical_abs_path
                 .as_deref()
                 .map(|abs| Self::matches_any(patterns, abs))
                 .unwrap_or(false)
     }
 
     fn path_within_root(candidate: &str, root: &str) -> bool {
         if candidate == root {
