--- crates/chio-guards/src/path_allowlist.rs
+++ replace == with != in PathAllowlistGuard::path_within_root
@@ -102,17 +102,17 @@
             || Self::matches_any(patterns, &resolved_path)
             || lexical_abs_path
                 .as_deref()
                 .map(|abs| Self::matches_any(patterns, abs))
                 .unwrap_or(false)
     }
 
     fn path_within_root(candidate: &str, root: &str) -> bool {
-        if candidate == root {
+        if candidate != /* ~ changed by cargo-mutants ~ */ root {
             return true;
         }
 
         if root == "/" {
             return candidate.starts_with('/');
         }
 
         candidate
