--- crates/chio-guards/src/path_allowlist.rs
+++ replace PathAllowlistGuard::path_within_root -> bool with false
@@ -102,28 +102,17 @@
             || Self::matches_any(patterns, &resolved_path)
             || lexical_abs_path
                 .as_deref()
                 .map(|abs| Self::matches_any(patterns, abs))
                 .unwrap_or(false)
     }
 
     fn path_within_root(candidate: &str, root: &str) -> bool {
-        if candidate == root {
-            return true;
-        }
-
-        if root == "/" {
-            return candidate.starts_with('/');
-        }
-
-        candidate
-            .strip_prefix(root)
-            .map(|suffix| suffix.starts_with('/'))
-            .unwrap_or(false)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn matches_session_roots(&self, path: &str, session_roots: &[String]) -> bool {
         if session_roots.is_empty() {
             return false;
         }
 
         let lexical_path = normalize_path_for_policy(path);
