--- crates/chio-guards/src/path_allowlist.rs
+++ replace == with != in PathAllowlistGuard::path_within_root
@@ -106,17 +106,17 @@
                 .unwrap_or(false)
     }
 
     fn path_within_root(candidate: &str, root: &str) -> bool {
         if candidate == root {
             return true;
         }
 
-        if root == "/" {
+        if root != /* ~ changed by cargo-mutants ~ */ "/" {
             return candidate.starts_with('/');
         }
 
         candidate
             .strip_prefix(root)
             .map(|suffix| suffix.starts_with('/'))
             .unwrap_or(false)
     }
