--- crates/chio-guards/src/path_allowlist.rs
+++ replace || with && in PathAllowlistGuard::matches_session_roots
@@ -137,17 +137,17 @@
         if resolved_differs_from_lexical_target {
             return session_roots
                 .iter()
                 .any(|root| Self::path_within_root(&resolved_path, root));
         }
 
         session_roots.iter().any(|root| {
             Self::path_within_root(&lexical_path, root)
-                || Self::path_within_root(&resolved_path, root)
+                && /* ~ changed by cargo-mutants ~ */ Self::path_within_root(&resolved_path, root)
                 || lexical_abs_path
                     .as_deref()
                     .map(|abs| Self::path_within_root(abs, root))
                     .unwrap_or(false)
         })
     }
 
     pub fn is_file_access_allowed(&self, path: &str) -> bool {
