--- crates/chio-guards/src/path_allowlist.rs
+++ delete ! in PathAllowlistGuard::is_file_access_allowed
@@ -146,17 +146,17 @@
                 || lexical_abs_path
                     .as_deref()
                     .map(|abs| Self::path_within_root(abs, root))
                     .unwrap_or(false)
         })
     }
 
     pub fn is_file_access_allowed(&self, path: &str) -> bool {
-        if !self.enabled {
+        if  /* ~ changed by cargo-mutants ~ */self.enabled {
             return true;
         }
         self.matches_allowlist(&self.file_access_allow, path)
     }
 
     pub fn is_file_write_allowed(&self, path: &str) -> bool {
         if !self.enabled {
             return true;
