--- crates/chio-guards/src/path_allowlist.rs
+++ replace PathAllowlistGuard::is_file_access_allowed -> bool with false
@@ -146,20 +146,17 @@
                 || lexical_abs_path
                     .as_deref()
                     .map(|abs| Self::path_within_root(abs, root))
                     .unwrap_or(false)
         })
     }
 
     pub fn is_file_access_allowed(&self, path: &str) -> bool {
-        if !self.enabled {
-            return true;
-        }
-        self.matches_allowlist(&self.file_access_allow, path)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_file_write_allowed(&self, path: &str) -> bool {
         if !self.enabled {
             return true;
         }
         self.matches_allowlist(&self.file_write_allow, path)
     }
