--- crates/chio-guards/src/path_allowlist.rs
+++ replace PathAllowlistGuard::is_patch_allowed -> bool with false
@@ -160,20 +160,17 @@
     pub fn is_file_write_allowed(&self, path: &str) -> bool {
         if !self.enabled {
             return true;
         }
         self.matches_allowlist(&self.file_write_allow, path)
     }
 
     pub fn is_patch_allowed(&self, path: &str) -> bool {
-        if !self.enabled {
-            return true;
-        }
-        self.matches_allowlist(&self.patch_allow, path)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for PathAllowlistGuard {
     fn default() -> Self {
         Self::new()
     }
 }
