--- crates/chio-guards/src/path_allowlist.rs
+++ replace <impl chio_kernel::Guard for PathAllowlistGuard>::name -> &str with ""
@@ -175,17 +175,17 @@
 impl Default for PathAllowlistGuard {
     fn default() -> Self {
         Self::new()
     }
 }
 
 impl chio_kernel::Guard for PathAllowlistGuard {
     fn name(&self) -> &str {
-        "path-allowlist"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn evaluate(&self, ctx: &GuardContext) -> Result<Verdict, KernelError> {
         let action = extract_action(&ctx.request.tool_name, &ctx.request.arguments);
         let Some(path) = action.filesystem_path() else {
             return Ok(Verdict::Allow);
         };
 
