--- crates/chio-guards/src/path_allowlist.rs
+++ replace <impl chio_kernel::Guard for PathAllowlistGuard>::evaluate -> Result<Verdict, KernelError> with Ok(Default::default())
@@ -179,43 +179,17 @@
 }
 
 impl chio_kernel::Guard for PathAllowlistGuard {
     fn name(&self) -> &str {
         "path-allowlist"
     }
 
     fn evaluate(&self, ctx: &GuardContext) -> Result<Verdict, KernelError> {
-        let action = extract_action(&ctx.request.tool_name, &ctx.request.arguments);
-        let Some(path) = action.filesystem_path() else {
-            return Ok(Verdict::Allow);
-        };
-
-        if let Some(session_roots) = ctx.session_filesystem_roots {
-            if !self.matches_session_roots(path, session_roots) {
-                return Ok(Verdict::Deny);
-            }
-        }
-
-        if !self.enabled {
-            return Ok(Verdict::Allow);
-        }
-
-        let allowed = match &action {
-            ToolAction::FileAccess(path) => self.is_file_access_allowed(path),
-            ToolAction::FileWrite(path, _) => self.is_file_write_allowed(path),
-            ToolAction::Patch(path, _) => self.is_patch_allowed(path),
-            _ => unreachable!("non-filesystem actions should return early"),
-        };
-
-        if allowed {
-            Ok(Verdict::Allow)
-        } else {
-            Ok(Verdict::Deny)
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use chio_kernel::Guard;
 
