--- crates/chio-guards/src/path_allowlist.rs
+++ delete ! in <impl chio_kernel::Guard for PathAllowlistGuard>::evaluate
@@ -185,17 +185,17 @@
 
     fn evaluate(&self, ctx: &GuardContext) -> Result<Verdict, KernelError> {
         let action = extract_action(&ctx.request.tool_name, &ctx.request.arguments);
         let Some(path) = action.filesystem_path() else {
             return Ok(Verdict::Allow);
         };
 
         if let Some(session_roots) = ctx.session_filesystem_roots {
-            if !self.matches_session_roots(path, session_roots) {
+            if  /* ~ changed by cargo-mutants ~ */self.matches_session_roots(path, session_roots) {
                 return Ok(Verdict::Deny);
             }
         }
 
         if !self.enabled {
             return Ok(Verdict::Allow);
         }
 
