--- crates/chio-guards/src/path_allowlist.rs
+++ replace PathAllowlistGuard::with_config -> Self with Default::default()
@@ -45,42 +45,17 @@
             enabled: false,
             file_access_allow: Vec::new(),
             file_write_allow: Vec::new(),
             patch_allow: Vec::new(),
         })
     }
 
     pub fn with_config(config: PathAllowlistConfig) -> Self {
-        let file_access_allow: Vec<Pattern> = config
-            .file_access_allow
-            .iter()
-            .filter_map(|p| Pattern::new(p).ok())
-            .collect();
-        let file_write_allow: Vec<Pattern> = config
-            .file_write_allow
-            .iter()
-            .filter_map(|p| Pattern::new(p).ok())
-            .collect();
-        let patch_allow = if config.patch_allow.is_empty() {
-            file_write_allow.clone()
-        } else {
-            config
-                .patch_allow
-                .iter()
-                .filter_map(|p| Pattern::new(p).ok())
-                .collect()
-        };
-
-        Self {
-            enabled: config.enabled,
-            file_access_allow,
-            file_write_allow,
-            patch_allow,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn matches_any(patterns: &[Pattern], path: &str) -> bool {
         patterns.iter().any(|p| p.matches(path))
     }
 
     fn matches_allowlist(&self, patterns: &[Pattern], path: &str) -> bool {
         let lexical_path = normalize_path_for_policy(path);
