--- crates/chio-guards/src/path_allowlist.rs
+++ replace PathAllowlistGuard::matches_any -> bool with true
@@ -74,17 +74,17 @@
             enabled: config.enabled,
             file_access_allow,
             file_write_allow,
             patch_allow,
         }
     }
 
     fn matches_any(patterns: &[Pattern], path: &str) -> bool {
-        patterns.iter().any(|p| p.matches(path))
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn matches_allowlist(&self, patterns: &[Pattern], path: &str) -> bool {
         let lexical_path = normalize_path_for_policy(path);
         let resolved_path = normalize_path_for_policy_with_fs(path);
         let lexical_abs_path = normalize_path_for_policy_lexical_absolute(path);
 
         let resolved_differs_from_lexical_target = lexical_abs_path
