--- crates/chio-guards/src/path_normalization.rs
+++ replace normalize_path_for_policy -> String with "xyzzy".into()
@@ -8,52 +8,17 @@
 /// Normalize a path for policy glob matching.
 ///
 /// Rules:
 /// - Convert `\` to `/`
 /// - Collapse repeated separators
 /// - Remove `.` segments
 /// - Resolve `..` segments lexically (without filesystem access)
 pub fn normalize_path_for_policy(path: &str) -> String {
-    let path = path.replace('\\', "/");
-    let is_absolute = path.starts_with('/');
-
-    let mut segments: Vec<&str> = Vec::new();
-    for segment in path.split('/') {
-        if segment.is_empty() || segment == "." {
-            continue;
-        }
-
-        if segment == ".." {
-            if let Some(last) = segments.last().copied() {
-                if last != ".." {
-                    segments.pop();
-                    continue;
-                }
-            }
-            if !is_absolute {
-                segments.push(segment);
-            }
-            continue;
-        }
-
-        segments.push(segment);
-    }
-
-    if is_absolute {
-        if segments.is_empty() {
-            "/".to_string()
-        } else {
-            format!("/{}", segments.join("/"))
-        }
-    } else if segments.is_empty() {
-        ".".to_string()
-    } else {
-        segments.join("/")
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Normalize a path to an absolute lexical path without resolving symlinks.
 ///
 /// - Absolute inputs are normalized as-is.
 /// - Relative inputs are joined against the current working directory.
 pub fn normalize_path_for_policy_lexical_absolute(path: &str) -> Option<String> {
     let raw = Path::new(path);
