--- crates/chio-guards/src/path_normalization.rs
+++ replace != with == in normalize_path_for_policy
@@ -19,17 +19,17 @@
     let mut segments: Vec<&str> = Vec::new();
     for segment in path.split('/') {
         if segment.is_empty() || segment == "." {
             continue;
         }
 
         if segment == ".." {
             if let Some(last) = segments.last().copied() {
-                if last != ".." {
+                if last == /* ~ changed by cargo-mutants ~ */ ".." {
                     segments.pop();
                     continue;
                 }
             }
             if !is_absolute {
                 segments.push(segment);
             }
             continue;
