--- crates/chio-guards/src/path_normalization.rs
+++ delete ! in normalize_path_for_policy
@@ -24,17 +24,17 @@
 
         if segment == ".." {
             if let Some(last) = segments.last().copied() {
                 if last != ".." {
                     segments.pop();
                     continue;
                 }
             }
-            if !is_absolute {
+            if  /* ~ changed by cargo-mutants ~ */is_absolute {
                 segments.push(segment);
             }
             continue;
         }
 
         segments.push(segment);
     }
 
