--- crates/chio-guards/src/path_normalization.rs
+++ replace normalize_path_for_policy_lexical_absolute -> Option<String> with Some("xyzzy".into())
@@ -51,24 +51,17 @@
     }
 }
 
 /// Normalize a path to an absolute lexical path without resolving symlinks.
 ///
 /// - Absolute inputs are normalized as-is.
 /// - Relative inputs are joined against the current working directory.
 pub fn normalize_path_for_policy_lexical_absolute(path: &str) -> Option<String> {
-    let raw = Path::new(path);
-    if raw.is_absolute() {
-        return Some(normalize_path_for_policy(path));
-    }
-
-    let cwd = std::env::current_dir().ok()?;
-    let joined = cwd.join(raw);
-    Some(normalize_path_for_policy(&joined.to_string_lossy()))
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Normalize a path for policy matching, preferring filesystem-resolved targets when possible.
 ///
 /// - For existing paths, this resolves symlinks via `canonicalize`.
 /// - For non-existing write targets, this resolves the parent directory and rejoins the filename.
 /// - Falls back to lexical normalization when resolution is not possible.
 pub fn normalize_path_for_policy_with_fs(path: &str) -> String {
