--- crates/chio-guards/src/path_normalization.rs
+++ replace resolve_path_for_policy -> Option<String> with Some("xyzzy".into())
@@ -71,28 +71,17 @@
 /// - For existing paths, this resolves symlinks via `canonicalize`.
 /// - For non-existing write targets, this resolves the parent directory and rejoins the filename.
 /// - Falls back to lexical normalization when resolution is not possible.
 pub fn normalize_path_for_policy_with_fs(path: &str) -> String {
     resolve_path_for_policy(path).unwrap_or_else(|| normalize_path_for_policy(path))
 }
 
 fn resolve_path_for_policy(path: &str) -> Option<String> {
-    let raw = Path::new(path);
-    if let Ok(canonical) = std::fs::canonicalize(raw) {
-        return Some(normalize_path_for_policy(&canonical.to_string_lossy()));
-    }
-
-    let parent = raw.parent()?;
-    let canonical_parent = std::fs::canonicalize(parent).ok()?;
-    let candidate = match raw.file_name() {
-        Some(name) => canonical_parent.join(name),
-        None => canonical_parent,
-    };
-    Some(normalize_path_for_policy(&candidate.to_string_lossy()))
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn looks_like_windows_absolute(path: &str) -> bool {
         let bytes = path.as_bytes();
