--- crates/chio-guards/src/pipeline.rs
+++ replace GuardPipeline::len -> usize with 1
@@ -21,17 +21,17 @@
         Self { guards: Vec::new() }
     }
 
     pub fn add(&mut self, guard: Box<dyn Guard>) {
         self.guards.push(guard);
     }
 
     pub fn len(&self) -> usize {
-        self.guards.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_empty(&self) -> bool {
         self.guards.is_empty()
     }
 
     /// Create a default pipeline with all implemented guards using their
     /// default configurations.
