--- crates/chio-guards/src/pipeline.rs
+++ replace <impl Guard for GuardPipeline>::name -> &str with "xyzzy"
@@ -51,17 +51,17 @@
 impl Default for GuardPipeline {
     fn default() -> Self {
         Self::new()
     }
 }
 
 impl Guard for GuardPipeline {
     fn name(&self) -> &str {
-        "guard-pipeline"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn evaluate(&self, ctx: &GuardContext) -> Result<Verdict, KernelError> {
         let mut final_verdict = Verdict::Allow;
         for guard in &self.guards {
             match guard.evaluate(ctx) {
                 Ok(Verdict::Allow) => continue,
                 Ok(Verdict::PendingApproval) => {
