--- crates/chio-guards/src/pipeline.rs
+++ replace <impl Guard for GuardPipeline>::evaluate -> Result<Verdict, KernelError> with Ok(Default::default())
@@ -55,43 +55,17 @@
 }
 
 impl Guard for GuardPipeline {
     fn name(&self) -> &str {
         "guard-pipeline"
     }
 
     fn evaluate(&self, ctx: &GuardContext) -> Result<Verdict, KernelError> {
-        let mut final_verdict = Verdict::Allow;
-        for guard in &self.guards {
-            match guard.evaluate(ctx) {
-                Ok(Verdict::Allow) => continue,
-                Ok(Verdict::PendingApproval) => {
-                    // Phase 3.4 introduced `PendingApproval` as a sticky
-                    // escalation state. Keep iterating so another guard can
-                    // still short-circuit to Deny, but propagate the pending
-                    // verdict up the stack if no deny occurs.
-                    final_verdict = Verdict::PendingApproval;
-                }
-                Ok(Verdict::Deny) => {
-                    return Err(KernelError::GuardDenied(format!(
-                        "guard \"{}\" denied the request",
-                        guard.name()
-                    )));
-                }
-                Err(e) => {
-                    // Fail closed: guard errors are treated as denials.
-                    return Err(KernelError::GuardDenied(format!(
-                        "guard \"{}\" error (fail-closed): {e}",
-                        guard.name()
-                    )));
-                }
-            }
-        }
-        Ok(final_verdict)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     struct AllowGuard;
