--- crates/chio-kernel-core/src/capability_verify.rs
+++ replace verify_capability_with_negotiated_floor -> Result<VerifiedCapability, CapabilityError> with Ok(Default::default())
@@ -231,32 +231,17 @@
     peer: &CapabilityNegotiation,
 ) -> Result<VerifiedCapability, CapabilityError> {
     // Schema-ceiling check: reject tokens whose declared schema is
     // strictly above the peer-negotiated ceiling. Comparison is
     // ordering-aware over `CapabilitySchemaVersion`, not string
     // equality, so a v2 token across a future v3-or-higher peer
     // ceiling is admitted. v1 tokens are always admitted regardless
     // of the peer ceiling.
-    let token_version = CapabilitySchemaVersion::parse(&token.schema);
-    let peer_ceiling = CapabilitySchemaVersion::parse(&peer.max_capability_schema);
-    let exceeds_ceiling = match (token_version, peer_ceiling) {
-        (Some(token_v), Some(peer_v)) => token_v > peer_v,
-        (Some(token_v), None) => token_v > CapabilitySchemaVersion::V1,
-        (None, _) => false,
-    };
-    if exceeds_ceiling {
-        return Err(CapabilityError::SchemaExceedsNegotiatedCeiling {
-            token_schema: token.schema.clone(),
-            peer_max: peer.max_capability_schema.clone(),
-        });
-    }
-
-    let mut budgets = NoopBudgetRegistry;
-    verify_capability_with_floor(token, trusted_issuers, clock, crypto_floor, &mut budgets)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Convenience wrapper around [`verify_capability`] that returns the
 /// trusted-issuer list as a `Vec` so adapters can build it lazily.
 pub fn verify_capability_with_trusted<I>(
     token: &CapabilityToken,
     trusted_issuers: I,
     clock: &dyn Clock,
