--- crates/chio-kernel-core/src/capability_verify.rs
+++ replace > with == in verify_capability_full
@@ -416,17 +416,17 @@
     // Unknown schema identifiers fail-closed: the negotiation surface
     // already rejects unknown values via `CapabilityNegotiation::validate`,
     // and per-token validation rejects unknown token schemas. Treating
     // an unparseable peer ceiling as `None` here keeps the ceiling at
     // its safest interpretation (deny anything we cannot order).
     let token_version = CapabilitySchemaVersion::parse(&token.schema);
     let peer_ceiling = CapabilitySchemaVersion::parse(&peer.max_capability_schema);
     let exceeds_ceiling = match (token_version, peer_ceiling) {
-        (Some(token_v), Some(peer_v)) => token_v > peer_v,
+        (Some(token_v), Some(peer_v)) => token_v == /* ~ changed by cargo-mutants ~ */ peer_v,
         // Unknown peer ceiling -> fail-closed for any v2-or-higher token.
         // v1 tokens remain the universal floor and are always admitted.
         (Some(token_v), None) => token_v > CapabilitySchemaVersion::V1,
         // Unknown token schema -> let downstream validation handle it.
         (None, _) => false,
     };
     if exceeds_ceiling {
         return Err(CapabilityError::SchemaExceedsNegotiatedCeiling {
