--- crates/chio-kernel-core/src/normalized.rs
+++ delete ! in NormalizedToolGrant::is_subset_of
@@ -133,17 +133,17 @@
             if !parent
                 .constraints
                 .iter()
                 .all(|constraint| self.constraints.contains(constraint))
             {
                 return false;
             }
 
-            if !monetary_cap_is_subset(
+            if  /* ~ changed by cargo-mutants ~ */monetary_cap_is_subset(
                 self.max_cost_per_invocation.as_ref(),
                 parent.max_cost_per_invocation.as_ref(),
             ) {
                 return false;
             }
 
             if !monetary_cap_is_subset(self.max_total_cost.as_ref(), parent.max_total_cost.as_ref())
             {
