--- crates/chio-kernel-core/src/normalized.rs
+++ replace NormalizedPromptGrant::is_subset_of -> bool with false
@@ -229,21 +229,17 @@
 pub struct NormalizedPromptGrant {
     pub prompt_name: String,
     pub operations: Vec<NormalizedOperation>,
 }
 
 impl NormalizedPromptGrant {
     #[must_use]
     pub fn is_subset_of(&self, parent: &Self) -> bool {
-        pattern_covers(&parent.prompt_name, &self.prompt_name)
-            && self
-                .operations
-                .iter()
-                .all(|operation| parent.operations.contains(operation))
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Proof-facing scope.
 #[derive(Debug, Clone, PartialEq, Eq, Serialize, Deserialize)]
 pub struct NormalizedScope {
     pub grants: Vec<NormalizedToolGrant>,
     pub resource_grants: Vec<NormalizedResourceGrant>,
