--- crates/chio-kernel-core/src/normalized.rs
+++ delete ! in NormalizedScope::is_subset_of
@@ -252,17 +252,17 @@
 
 impl NormalizedScope {
     /// Mirrors `ChioScope::is_subset_of` over the normalized proof-facing AST.
     #[must_use]
     pub fn is_subset_of(&self, parent: &Self) -> bool {
         #[cfg(kani)]
         {
             if !self.resource_grants.is_empty()
-                || !parent.resource_grants.is_empty()
+                ||  /* ~ changed by cargo-mutants ~ */parent.resource_grants.is_empty()
                 || !self.prompt_grants.is_empty()
                 || !parent.prompt_grants.is_empty()
             {
                 return false;
             }
             if self.grants.is_empty() {
                 return true;
             }
