--- crates/chio-kernel-core/src/normalized.rs
+++ replace == with != in NormalizedScope::is_subset_of
@@ -261,17 +261,17 @@
                 || !self.prompt_grants.is_empty()
                 || !parent.prompt_grants.is_empty()
             {
                 return false;
             }
             if self.grants.is_empty() {
                 return true;
             }
-            if self.grants.len() == 1 && parent.grants.len() == 1 {
+            if self.grants.len() != /* ~ changed by cargo-mutants ~ */ 1 && parent.grants.len() == 1 {
                 return self.grants[0].is_subset_of(&parent.grants[0]);
             }
             return false;
         }
 
         #[cfg(not(kani))]
         {
             self.grants.iter().all(|grant| {
