--- crates/chio-kernel-core/src/normalized.rs
+++ replace <impl TryFrom<&CapabilityToken> for NormalizedCapability>::try_from -> Result<Self, Self::Error> with Ok(Default::default())
@@ -340,24 +340,17 @@
     pub matched_grant_index: Option<usize>,
     pub verified: Option<NormalizedVerifiedCapability>,
 }
 
 impl TryFrom<&CapabilityToken> for NormalizedCapability {
     type Error = NormalizationError;
 
     fn try_from(capability: &CapabilityToken) -> Result<Self, Self::Error> {
-        Ok(Self {
-            id: capability.id.clone(),
-            issuer_hex: capability.issuer.to_hex(),
-            subject_hex: capability.subject.to_hex(),
-            scope: NormalizedScope::try_from(&capability.scope)?,
-            issued_at: capability.issued_at,
-            expires_at: capability.expires_at,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl TryFrom<&VerifiedCapability> for NormalizedVerifiedCapability {
     type Error = NormalizationError;
 
     fn try_from(verified: &VerifiedCapability) -> Result<Self, Self::Error> {
         Ok(Self {
