--- crates/chio-kernel-core/src/normalized.rs
+++ replace normalized_operations_subset_bounded_kani -> bool with true
@@ -581,23 +581,17 @@
     )
 }
 
 #[cfg(kani)]
 fn normalized_operations_subset_bounded_kani(
     child: &[NormalizedOperation],
     parent: &[NormalizedOperation],
 ) -> bool {
-    if child.is_empty() {
-        return true;
-    }
-    if child.len() == 1 && parent.len() == 1 {
-        return child[0] == parent[0];
-    }
-    false
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(kani)]
 fn normalized_constraints_subset_bounded_kani(
     _child: &[NormalizedConstraint],
     parent: &[NormalizedConstraint],
 ) -> bool {
     parent.is_empty()
