--- crates/chio-kernel-core/src/normalized.rs
+++ replace <= with > in monetary_cap_is_subset_bounded_kani
@@ -607,17 +607,17 @@
 fn monetary_cap_is_subset_bounded_kani(
     child: Option<&NormalizedMonetaryAmount>,
     parent: Option<&NormalizedMonetaryAmount>,
 ) -> bool {
     match (child, parent) {
         (None, None) | (Some(_), None) => true,
         (None, Some(_)) => false,
         (Some(child_cap), Some(parent_cap)) => {
-            child_cap.units <= parent_cap.units && child_cap.currency == parent_cap.currency
+            child_cap.units > /* ~ changed by cargo-mutants ~ */ parent_cap.units && child_cap.currency == parent_cap.currency
         }
     }
 }
 
 fn pattern_covers(parent: &str, child: &str) -> bool {
     prefix_wildcard_or_exact_covers(parent, child)
 }
 
