--- crates/chio-kernel-core/src/normalized.rs
+++ replace pattern_covers -> bool with true
@@ -613,17 +613,17 @@
         (None, Some(_)) => false,
         (Some(child_cap), Some(parent_cap)) => {
             child_cap.units <= parent_cap.units && child_cap.currency == parent_cap.currency
         }
     }
 }
 
 fn pattern_covers(parent: &str, child: &str) -> bool {
-    prefix_wildcard_or_exact_covers(parent, child)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn unsupported_constraint_name(constraint: &Constraint) -> &'static str {
     match constraint {
         Constraint::PathPrefix(_) => "path_prefix",
         Constraint::DomainExact(_) => "domain_exact",
         Constraint::DomainGlob(_) => "domain_glob",
         Constraint::RegexMatch(_) => "regex_match",
