--- crates/chio-kernel-core/src/passport_verify.rs
+++ delete ! in verify_parsed_passport
@@ -158,17 +158,17 @@
         return Err(VerifyError::InvalidSchema);
     }
     if envelope.body.subject.is_empty() {
         return Err(VerifyError::MissingSubject);
     }
     if envelope.body.issued_at > envelope.body.expires_at {
         return Err(VerifyError::InvalidValidityWindow);
     }
-    if !authority_keys.contains(&envelope.body.issuer) {
+    if  /* ~ changed by cargo-mutants ~ */authority_keys.contains(&envelope.body.issuer) {
         return Err(VerifyError::UntrustedIssuer);
     }
 
     let body_bytes = canonical_json_bytes(&envelope.body)
         .map_err(|error| VerifyError::Internal(error.to_string()))?;
     if !envelope
         .body
         .issuer
