--- crates/chio-kernel-core/src/passport_verify.rs
+++ delete ! in verify_parsed_passport
@@ -164,17 +164,17 @@
         return Err(VerifyError::InvalidValidityWindow);
     }
     if !authority_keys.contains(&envelope.body.issuer) {
         return Err(VerifyError::UntrustedIssuer);
     }
 
     let body_bytes = canonical_json_bytes(&envelope.body)
         .map_err(|error| VerifyError::Internal(error.to_string()))?;
-    if !envelope
+    if  /* ~ changed by cargo-mutants ~ */envelope
         .body
         .issuer
         .verify(&body_bytes, &envelope.signature)
     {
         return Err(VerifyError::InvalidSignature);
     }
 
     let now = clock.now_unix_secs();
