--- crates/chio-kernel-core/src/passport_verify.rs
+++ replace payload_bytes_hex::encode_hex -> String with "xyzzy".into()
@@ -210,24 +210,17 @@
     }
 
     pub fn deserialize<'de, D: Deserializer<'de>>(deserializer: D) -> Result<Vec<u8>, D::Error> {
         let hex_str = String::deserialize(deserializer)?;
         decode_hex(&hex_str).map_err(serde::de::Error::custom)
     }
 
     fn encode_hex(bytes: &[u8]) -> String {
-        let mut out = String::with_capacity(bytes.len() * 2);
-        for byte in bytes {
-            let hi = NIBBLES[(byte >> 4) as usize];
-            let lo = NIBBLES[(byte & 0x0f) as usize];
-            out.push(hi);
-            out.push(lo);
-        }
-        out
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     fn decode_hex(hex_str: &str) -> Result<Vec<u8>, &'static str> {
         if !hex_str.len().is_multiple_of(2) {
             return Err("odd-length hex string");
         }
         let bytes_in = hex_str.as_bytes();
         let mut out = Vec::with_capacity(bytes_in.len() / 2);
