--- crates/chio-kernel-core/src/passport_verify.rs
+++ replace & with ^ in payload_bytes_hex::encode_hex
@@ -213,17 +213,17 @@
         let hex_str = String::deserialize(deserializer)?;
         decode_hex(&hex_str).map_err(serde::de::Error::custom)
     }
 
     fn encode_hex(bytes: &[u8]) -> String {
         let mut out = String::with_capacity(bytes.len() * 2);
         for byte in bytes {
             let hi = NIBBLES[(byte >> 4) as usize];
-            let lo = NIBBLES[(byte & 0x0f) as usize];
+            let lo = NIBBLES[(byte ^ /* ~ changed by cargo-mutants ~ */ 0x0f) as usize];
             out.push(hi);
             out.push(lo);
         }
         out
     }
 
     fn decode_hex(hex_str: &str) -> Result<Vec<u8>, &'static str> {
         if !hex_str.len().is_multiple_of(2) {
