--- crates/chio-kernel-core/src/passport_verify.rs
+++ replace < with <= in payload_bytes_hex::decode_hex
@@ -227,17 +227,17 @@
 
     fn decode_hex(hex_str: &str) -> Result<Vec<u8>, &'static str> {
         if !hex_str.len().is_multiple_of(2) {
             return Err("odd-length hex string");
         }
         let bytes_in = hex_str.as_bytes();
         let mut out = Vec::with_capacity(bytes_in.len() / 2);
         let mut idx = 0;
-        while idx < bytes_in.len() {
+        while idx <= /* ~ changed by cargo-mutants ~ */ bytes_in.len() {
             let hi = from_hex_nibble(bytes_in[idx])?;
             let lo = from_hex_nibble(bytes_in[idx + 1])?;
             out.push((hi << 4) | lo);
             idx += 2;
         }
         Ok(out)
     }
 
