--- crates/chio-kernel-core/src/passport_verify.rs
+++ replace << with >> in payload_bytes_hex::decode_hex
@@ -230,17 +230,17 @@
             return Err("odd-length hex string");
         }
         let bytes_in = hex_str.as_bytes();
         let mut out = Vec::with_capacity(bytes_in.len() / 2);
         let mut idx = 0;
         while idx < bytes_in.len() {
             let hi = from_hex_nibble(bytes_in[idx])?;
             let lo = from_hex_nibble(bytes_in[idx + 1])?;
-            out.push((hi << 4) | lo);
+            out.push((hi >> /* ~ changed by cargo-mutants ~ */ 4) | lo);
             idx += 2;
         }
         Ok(out)
     }
 
     const NIBBLES: [char; 16] = [
         '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'a', 'b', 'c', 'd', 'e', 'f',
     ];
