--- crates/chio-kernel-core/src/scope.rs
+++ replace <= with > in constraint_matches
@@ -218,17 +218,17 @@
         Constraint::DomainGlob(pattern) => {
             let pattern = pattern.to_ascii_lowercase();
             let domains = collect_domain_candidates(&string_leaves);
             Ok(!domains.is_empty()
                 && domains
                     .into_iter()
                     .all(|domain| wildcard_matches(&pattern, &domain)))
         }
-        Constraint::MaxLength(max) => Ok(string_leaves.iter().all(|leaf| leaf.value.len() <= *max)),
+        Constraint::MaxLength(max) => Ok(string_leaves.iter().all(|leaf| leaf.value.len() > /* ~ changed by cargo-mutants ~ */ *max)),
         Constraint::MaxArgsSize(max) => Ok(arguments.to_string().len() <= *max),
         Constraint::Custom(key, expected) => Ok(argument_contains_custom(arguments, key, expected)),
         Constraint::AudienceAllowlist(allowed) => {
             Ok(audience_allowlist_matches(arguments, allowed))
         }
         Constraint::MemoryStoreAllowlist(allowed) => {
             Ok(memory_store_allowlist_matches(arguments, allowed))
         }
