--- crates/chio-kernel-core/src/scope.rs
+++ replace != with == in path_has_prefix
@@ -291,17 +291,17 @@
 
 fn path_has_prefix(candidate: &str, prefix: &str) -> bool {
     let Some(candidate) = normalize_path(candidate) else {
         return false;
     };
     let Some(prefix) = normalize_path(prefix) else {
         return false;
     };
-    if candidate.is_absolute != prefix.is_absolute {
+    if candidate.is_absolute == /* ~ changed by cargo-mutants ~ */ prefix.is_absolute {
         return false;
     }
     if prefix.segments.len() > candidate.segments.len() {
         return false;
     }
     prefix
         .segments
         .iter()
