--- crates/chio-kernel-core/src/scope.rs
+++ replace normalize_path -> Option<NormalizedPath> with None
@@ -311,32 +311,17 @@
 
 #[derive(Debug, PartialEq, Eq)]
 struct NormalizedPath {
     is_absolute: bool,
     segments: Vec<String>,
 }
 
 fn normalize_path(path: &str) -> Option<NormalizedPath> {
-    let is_absolute = path.starts_with('/') || path.starts_with('\\');
-    let mut segments = Vec::new();
-    for segment in path.split(['/', '\\']) {
-        if segment.is_empty() || segment == "." {
-            continue;
-        }
-        if segment == ".." {
-            segments.pop()?;
-            continue;
-        }
-        segments.push(segment.to_string());
-    }
-    Some(NormalizedPath {
-        is_absolute,
-        segments,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn constraint_name(constraint: &Constraint) -> &'static str {
     match constraint {
         Constraint::PathPrefix(_) => "path_prefix",
         Constraint::DomainExact(_) => "domain_exact",
         Constraint::DomainGlob(_) => "domain_glob",
         Constraint::RegexMatch(_) => "regex_match",
