--- crates/chio-kernel-core/src/scope.rs
+++ replace == with != in normalize_path
@@ -314,17 +314,17 @@
     is_absolute: bool,
     segments: Vec<String>,
 }
 
 fn normalize_path(path: &str) -> Option<NormalizedPath> {
     let is_absolute = path.starts_with('/') || path.starts_with('\\');
     let mut segments = Vec::new();
     for segment in path.split(['/', '\\']) {
-        if segment.is_empty() || segment == "." {
+        if segment.is_empty() || segment != /* ~ changed by cargo-mutants ~ */ "." {
             continue;
         }
         if segment == ".." {
             segments.pop()?;
             continue;
         }
         segments.push(segment.to_string());
     }
