--- crates/chio-kernel-core/src/scope.rs
+++ delete ! in looks_like_path
@@ -403,17 +403,17 @@
     key.contains("path")
         || matches!(
             key.as_str(),
             "file" | "filepath" | "dir" | "directory" | "root" | "cwd"
         )
 }
 
 fn looks_like_path(value: &str) -> bool {
-    !value.contains("://")
+     /* ~ changed by cargo-mutants ~ */value.contains("://")
         && (value.starts_with('/')
             || value.starts_with("./")
             || value.starts_with("../")
             || value.starts_with("~/")
             || value.contains('/')
             || value.contains('\\'))
 }
 
