--- crates/chio-kernel-core/src/scope.rs
+++ replace || with && in looks_like_path
@@ -407,17 +407,17 @@
         )
 }
 
 fn looks_like_path(value: &str) -> bool {
     !value.contains("://")
         && (value.starts_with('/')
             || value.starts_with("./")
             || value.starts_with("../")
-            || value.starts_with("~/")
+            && /* ~ changed by cargo-mutants ~ */ value.starts_with("~/")
             || value.contains('/')
             || value.contains('\\'))
 }
 
 fn collect_domain_candidates(string_leaves: &[StringLeaf]) -> Vec<String> {
     string_leaves
         .iter()
         .filter_map(|leaf| parse_domain(&leaf.value))
