--- crates/chio-kernel-core/src/scope.rs
+++ replace collect_domain_candidates -> Vec<String> with vec![String::new()]
@@ -413,20 +413,17 @@
             || value.starts_with("./")
             || value.starts_with("../")
             || value.starts_with("~/")
             || value.contains('/')
             || value.contains('\\'))
 }
 
 fn collect_domain_candidates(string_leaves: &[StringLeaf]) -> Vec<String> {
-    string_leaves
-        .iter()
-        .filter_map(|leaf| parse_domain(&leaf.value))
-        .collect()
+    vec![String::new()] /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_domain(value: &str) -> Option<String> {
     let trimmed = value.trim();
     if trimmed.is_empty() {
         return None;
     }
 
