--- crates/chio-kernel-core/src/scope.rs
+++ replace parse_domain -> Option<String> with Some("xyzzy".into())
@@ -420,52 +420,17 @@
 fn collect_domain_candidates(string_leaves: &[StringLeaf]) -> Vec<String> {
     string_leaves
         .iter()
         .filter_map(|leaf| parse_domain(&leaf.value))
         .collect()
 }
 
 fn parse_domain(value: &str) -> Option<String> {
-    let trimmed = value.trim();
-    if trimmed.is_empty() {
-        return None;
-    }
-
-    let host_port = if let Some((_, rest)) = trimmed.split_once("://") {
-        rest
-    } else {
-        trimmed
-    };
-
-    let authority = host_port
-        .split(['/', '?', '#'])
-        .next()
-        .unwrap_or(host_port)
-        .rsplit('@')
-        .next()
-        .unwrap_or(host_port);
-    let host = authority
-        .split(':')
-        .next()
-        .unwrap_or(authority)
-        .trim_matches('.');
-    let normalized = normalize_domain(host);
-
-    if normalized == "localhost"
-        || (!normalized.is_empty()
-            && normalized.contains('.')
-            && normalized.chars().all(|character| {
-                character.is_ascii_alphanumeric() || character == '-' || character == '.'
-            }))
-    {
-        Some(normalized)
-    } else {
-        None
-    }
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn normalize_domain(value: &str) -> String {
     value.trim().trim_matches('.').to_ascii_lowercase()
 }
 
 fn wildcard_matches(pattern: &str, candidate: &str) -> bool {
     let pattern_chars: Vec<char> = pattern.chars().collect();
