--- crates/chio-kernel-core/src/scope.rs
+++ delete ! in parse_domain
@@ -446,17 +446,17 @@
     let host = authority
         .split(':')
         .next()
         .unwrap_or(authority)
         .trim_matches('.');
     let normalized = normalize_domain(host);
 
     if normalized == "localhost"
-        || (!normalized.is_empty()
+        || ( /* ~ changed by cargo-mutants ~ */normalized.is_empty()
             && normalized.contains('.')
             && normalized.chars().all(|character| {
                 character.is_ascii_alphanumeric() || character == '-' || character == '.'
             }))
     {
         Some(normalized)
     } else {
         None
