--- crates/chio-kernel-core/src/scope.rs
+++ replace += with *= in wildcard_matches
@@ -478,17 +478,17 @@
             && (pattern_chars[pattern_idx] == candidate_chars[candidate_idx]
                 || pattern_chars[pattern_idx] == '*')
         {
             if pattern_chars[pattern_idx] == '*' {
                 star_idx = Some(pattern_idx);
                 match_idx = candidate_idx;
                 pattern_idx += 1;
             } else {
-                pattern_idx += 1;
+                pattern_idx *= /* ~ changed by cargo-mutants ~ */ 1;
                 candidate_idx += 1;
             }
         } else if let Some(star_position) = star_idx {
             pattern_idx = star_position + 1;
             match_idx += 1;
             candidate_idx = match_idx;
         } else {
             return false;
