--- crates/chio-kernel-core/src/scope.rs
+++ replace argument_contains_custom -> bool with true
@@ -498,29 +498,17 @@
     while pattern_idx < pattern_chars.len() && pattern_chars[pattern_idx] == '*' {
         pattern_idx += 1;
     }
 
     pattern_idx == pattern_chars.len()
 }
 
 fn argument_contains_custom(arguments: &serde_json::Value, key: &str, expected: &str) -> bool {
-    match arguments {
-        serde_json::Value::Object(map) => map.iter().any(|(entry_key, value)| {
-            (entry_key == key && value.as_str() == Some(expected))
-                || argument_contains_custom(value, key, expected)
-        }),
-        serde_json::Value::Array(values) => values
-            .iter()
-            .any(|value| argument_contains_custom(value, key, expected)),
-        serde_json::Value::Null
-        | serde_json::Value::Bool(_)
-        | serde_json::Value::Number(_)
-        | serde_json::Value::String(_) => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Observed string values for a key-driven allowlist constraint.
 ///
 /// `saw_relevant_key` distinguishes "the request never carried such a
 /// key" (constraint cannot apply) from "the request carried the key but
 /// no string values" (fail-closed). `invalid` is set when a relevant key
 /// holds a non-string leaf (number, object, bool, null) which is rejected
