--- crates/chio-kernel-core/src/scope.rs
+++ delete ! in audience_allowlist_matches
@@ -537,17 +537,17 @@
 }
 
 fn audience_allowlist_matches(arguments: &serde_json::Value, allowed: &[String]) -> bool {
     let mut observed = ObservedStringValues::default();
     collect_audience_values(arguments, &mut observed);
     if observed.invalid {
         return false;
     }
-    if !observed.saw_relevant_key {
+    if  /* ~ changed by cargo-mutants ~ */observed.saw_relevant_key {
         return true;
     }
     observed
         .values
         .iter()
         .all(|value| allowed.iter().any(|allowed_value| allowed_value == value))
 }
 
