--- crates/chio-kernel-core/src/scope.rs
+++ delete ! in collect_memory_store_values
@@ -628,17 +628,17 @@
 
 fn collect_memory_store_values(arguments: &serde_json::Value, out: &mut ObservedStringValues) {
     match arguments {
         serde_json::Value::Object(map) => {
             for (key, value) in map {
                 if is_memory_store_key(key) {
                     let before = out.values.len();
                     out.saw_relevant_key = true;
-                    if !collect_string_values_strict(value, &mut out.values)
+                    if  /* ~ changed by cargo-mutants ~ */collect_string_values_strict(value, &mut out.values)
                         || out.values.len() == before
                     {
                         out.invalid = true;
                     }
                 } else {
                     collect_memory_store_values(value, out);
                 }
             }
