--- crates/chio-policy/src/compiler.rs
+++ replace compile_policy_with_source -> Result<CompiledPolicy, CompileError> with Ok(Default::default())
@@ -93,30 +93,17 @@
 }
 
 /// Compile a HushSpec policy with an optional source path used to resolve
 /// relative auxiliary assets referenced by the policy.
 pub fn compile_policy_with_source(
     policy: &HushSpec,
     source_path: Option<&Path>,
 ) -> Result<CompiledPolicy, CompileError> {
-    let mut builder = PipelineBuilder::new();
-    let mut post_invocation = PostInvocationPipeline::new();
-    let source_dir = source_path.and_then(|path| path.parent());
-    compile_rule_guards(policy, &mut builder, &mut post_invocation)?;
-    compile_detection_guards(policy, &mut builder, source_dir)?;
-    compile_budget_guards(policy, &mut builder)?;
-    let default_scope = compile_scope(policy)?;
-    let (guards, guard_names) = builder.finish();
-    Ok(CompiledPolicy {
-        guards,
-        post_invocation,
-        default_scope,
-        guard_names,
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Pipeline builder
 // ---------------------------------------------------------------------------
 
 /// Helper that keeps the [`GuardPipeline`] and the parallel `guard_names`
 /// list in lockstep so callers cannot forget to record a guard's name when
