--- crates/chio-policy/src/compiler.rs
+++ replace PipelineBuilder::finish -> (GuardPipeline, Vec<String>) with (Default::default(), vec![])
@@ -135,17 +135,17 @@
     }
 
     fn add<G: chio_kernel::Guard + 'static>(&mut self, guard: G) {
         self.names.push(guard.name().to_string());
         self.pipeline.add(Box::new(guard));
     }
 
     fn finish(self) -> (GuardPipeline, Vec<String>) {
-        (self.pipeline, self.names)
+        (Default::default(), vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------------------------------------------------------------
 // Rule-driven guards (1-7 + InternalNetworkGuard)
 // ---------------------------------------------------------------------------
 
 fn compile_rule_guards(
