--- crates/chio-policy/src/compiler.rs
+++ replace compile_rule_guards -> Result<(), CompileError> with Ok(())
@@ -148,206 +148,17 @@
 // Rule-driven guards (1-7 + InternalNetworkGuard)
 // ---------------------------------------------------------------------------
 
 fn compile_rule_guards(
     policy: &HushSpec,
     builder: &mut PipelineBuilder,
     post_invocation: &mut PostInvocationPipeline,
 ) -> Result<(), CompileError> {
-    let Some(rules) = &policy.rules else {
-        return Ok(());
-    };
-
-    // 1. forbidden_paths -> ForbiddenPathGuard
-    if let Some(fp) = &rules.forbidden_paths {
-        if fp.enabled {
-            if fp.patterns.is_empty() {
-                builder.add(ForbiddenPathGuard::new());
-            } else {
-                builder.add(ForbiddenPathGuard::with_patterns(
-                    fp.patterns.clone(),
-                    fp.exceptions.clone(),
-                ));
-            }
-        }
-    }
-
-    // 1b. velocity -> VelocityGuard + AgentVelocityGuard
-    //
-    // Inserted between ForbiddenPathGuard and ShellCommandGuard so that
-    // rate-limit denials are observed before any shell semantics fire.
-    // velocity guard design; re-landed in post-rename update after the Chio rename.
-    if let Some(v) = &rules.velocity {
-        if v.enabled {
-            let (velocity_cfg, agent_cfg) = compile_velocity_rule(v);
-            if let Some(cfg) = velocity_cfg {
-                builder.add(VelocityGuard::new(cfg));
-            }
-            if let Some(cfg) = agent_cfg {
-                builder.add(AgentVelocityGuard::new(cfg));
-            }
-        }
-    }
-
-    // 2. shell_commands -> ShellCommandGuard
-    if let Some(sc) = &rules.shell_commands {
-        if sc.enabled {
-            if sc.forbidden_patterns.is_empty() {
-                builder.add(ShellCommandGuard::new());
-            } else {
-                builder.add(ShellCommandGuard::with_patterns(
-                    sc.forbidden_patterns.clone(),
-                    true,
-                ));
-            }
-        }
-    }
-
-    // 3. egress -> EgressAllowlistGuard
-    // 10. egress -> InternalNetworkGuard (SSRF companion)
-    //
-    // When the policy opts into egress control we also add an internal-
-    // network guard that blocks RFC1918 / cloud-metadata endpoints. This
-    // matches ClawdStrike's layered defense where the allowlist catches
-    // unknown domains and the internal-network guard catches raw IPs.
-    if let Some(eg) = &rules.egress {
-        if eg.enabled {
-            if eg.allow.is_empty() && eg.block.is_empty() {
-                builder.add(EgressAllowlistGuard::new());
-            } else {
-                builder.add(
-                    EgressAllowlistGuard::with_lists(eg.allow.clone(), eg.block.clone())
-                        .map_err(|error| CompileError::Invalid(error.to_string()))?,
-                );
-            }
-            builder.add(InternalNetworkGuard::new());
-        }
-    }
-
-    // 4. tool_access -> McpToolGuard
-    if let Some(ta) = &rules.tool_access {
-        if ta.enabled {
-            let mcp_default = match ta.default {
-                DefaultAction::Allow => chio_guards::mcp_tool::McpDefaultAction::Allow,
-                DefaultAction::Block => chio_guards::mcp_tool::McpDefaultAction::Block,
-            };
-            let config = chio_guards::mcp_tool::McpToolConfig {
-                enabled: true,
-                allow: ta.allow.clone(),
-                block: ta.block.clone(),
-                default_action: mcp_default,
-                max_args_size: ta.max_args_size,
-            };
-            builder.add(McpToolGuard::with_config(config));
-        }
-    }
-
-    // 5. secret_patterns -> SecretLeakGuard
-    //
-    // SecretLeakGuard handles the write path (detect secrets in outbound
-    // file writes) while the post-invocation SanitizerHook handles the read
-    // path (redact secrets in tool results before the agent sees them).
-    if let Some(sp) = &rules.secret_patterns {
-        if sp.enabled {
-            let config = chio_guards::secret_leak::SecretLeakConfig {
-                enabled: true,
-                skip_paths: sp.skip_paths.clone(),
-                custom_patterns: compile_custom_secret_patterns(sp),
-            };
-            builder.add(
-                SecretLeakGuard::with_config(config)
-                    .map_err(|error| CompileError::Invalid(error.to_string()))?,
-            );
-            post_invocation.add(Box::new(
-                SanitizerHook::with_config(compile_output_sanitizer_config(sp))
-                    .map_err(|error| CompileError::Invalid(error.to_string()))?,
-            ));
-        }
-    }
-
-    // 6. patch_integrity -> PatchIntegrityGuard
-    if let Some(pi) = &rules.patch_integrity {
-        if pi.enabled {
-            let config = chio_guards::patch_integrity::PatchIntegrityConfig {
-                enabled: true,
-                max_additions: pi.max_additions,
-                max_deletions: pi.max_deletions,
-                forbidden_patterns: pi.forbidden_patterns.clone(),
-                require_balance: pi.require_balance,
-                max_imbalance_ratio: pi.max_imbalance_ratio,
-            };
-            builder.add(
-                PatchIntegrityGuard::with_config(config)
-                    .map_err(|error| CompileError::Invalid(error.to_string()))?,
-            );
-        }
-    }
-
-    // 7. path_allowlist -> PathAllowlistGuard
-    if let Some(pa) = &rules.path_allowlist {
-        if pa.enabled {
-            let config = chio_guards::path_allowlist::PathAllowlistConfig {
-                enabled: true,
-                file_access_allow: pa.read.clone(),
-                file_write_allow: pa.write.clone(),
-                patch_allow: pa.patch.clone(),
-            };
-            builder.add(PathAllowlistGuard::with_config(config));
-        }
-    }
-
-    // 8. computer_use -> ComputerUseGuard
-    if let Some(cu) = &rules.computer_use {
-        if cu.enabled {
-            builder.add(ComputerUseGuard::with_config(compile_computer_use_rule(cu)));
-        }
-    }
-
-    // 9. remote_desktop_channels -> RemoteDesktopSideChannelGuard
-    if let Some(rd) = &rules.remote_desktop_channels {
-        if rd.enabled {
-            builder.add(RemoteDesktopSideChannelGuard::with_config(
-                compile_remote_desktop_rule(rd),
-            ));
-        }
-    }
-
-    // 10. input_injection -> InputInjectionCapabilityGuard
-    if let Some(ii) = &rules.input_injection {
-        if ii.enabled {
-            builder.add(InputInjectionCapabilityGuard::with_config(
-                compile_input_injection_rule(ii),
-            ));
-        }
-    }
-
-    // 11. browser_automation -> BrowserAutomationGuard
-    if let Some(ba) = &rules.browser_automation {
-        if ba.enabled {
-            let config = compile_browser_automation_rule(ba);
-            builder.add(
-                chio_guards::BrowserAutomationGuard::with_config(config)
-                    .map_err(|error| CompileError::Invalid(error.to_string()))?,
-            );
-        }
-    }
-
-    // 12. code_execution -> CodeExecutionGuard
-    if let Some(ce) = &rules.code_execution {
-        if ce.enabled {
-            let config = compile_code_execution_rule(ce);
-            builder.add(
-                chio_guards::CodeExecutionGuard::with_config(config)
-                    .map_err(|error| CompileError::Invalid(error.to_string()))?,
-            );
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn compile_computer_use_rule(rule: &ComputerUseRule) -> ComputerUseConfig {
     let mode = match rule.mode {
         ComputerUseMode::Observe => EnforcementMode::Observe,
         ComputerUseMode::Guardrail => EnforcementMode::Guardrail,
         ComputerUseMode::FailClosed => EnforcementMode::FailClosed,
     };
