--- crates/chio-policy/src/compiler.rs
+++ replace compile_computer_use_rule -> ComputerUseConfig with Default::default()
@@ -341,27 +341,17 @@
             );
         }
     }
 
     Ok(())
 }
 
 fn compile_computer_use_rule(rule: &ComputerUseRule) -> ComputerUseConfig {
-    let mode = match rule.mode {
-        ComputerUseMode::Observe => EnforcementMode::Observe,
-        ComputerUseMode::Guardrail => EnforcementMode::Guardrail,
-        ComputerUseMode::FailClosed => EnforcementMode::FailClosed,
-    };
-    ComputerUseConfig {
-        enabled: true,
-        allowed_action_types: rule.allowed_actions.clone(),
-        mode,
-        ..ComputerUseConfig::default()
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn compile_remote_desktop_rule(rule: &RemoteDesktopChannelsRule) -> RemoteDesktopSideChannelConfig {
     // HushSpec `remote_desktop_channels` carries per-channel toggles for
     // clipboard / file_transfer / audio / drive_mapping. It does not
     // currently model session_share, printing, or transfer size, so we
     // leave those at the guard's defaults (enabled / no limit).
     RemoteDesktopSideChannelConfig {
