--- crates/chio-policy/src/compiler.rs
+++ replace compile_input_injection_rule -> InputInjectionCapabilityConfig with Default::default()
@@ -370,22 +370,17 @@
         file_transfer_enabled: rule.file_transfer,
         audio_enabled: rule.audio,
         drive_mapping_enabled: rule.drive_mapping,
         ..RemoteDesktopSideChannelConfig::default()
     }
 }
 
 fn compile_input_injection_rule(rule: &InputInjectionRule) -> InputInjectionCapabilityConfig {
-    InputInjectionCapabilityConfig {
-        enabled: true,
-        allowed_input_types: rule.allowed_types.clone(),
-        require_postcondition_probe: rule.require_postcondition_probe,
-        ..InputInjectionCapabilityConfig::default()
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn compile_browser_automation_rule(
     rule: &crate::models::BrowserAutomationRule,
 ) -> chio_guards::BrowserAutomationConfig {
     chio_guards::BrowserAutomationConfig {
         enabled: true,
         allowed_domains: rule.allowed_domains.clone(),
