--- crates/chio-policy/src/compiler.rs
+++ replace compile_detection_guards -> Result<(), CompileError> with Ok(())
@@ -417,47 +417,17 @@
 // Detection-extension guards (8, 9, 10)
 // ---------------------------------------------------------------------------
 
 fn compile_detection_guards(
     policy: &HushSpec,
     builder: &mut PipelineBuilder,
     source_dir: Option<&Path>,
 ) -> Result<(), CompileError> {
-    let Some(extensions) = &policy.extensions else {
-        return Ok(());
-    };
-    let Some(detection) = &extensions.detection else {
-        return Ok(());
-    };
-
-    // 8. detection.prompt_injection -> PromptInjectionGuard
-    if let Some(pi) = &detection.prompt_injection {
-        if pi.enabled.unwrap_or(true) {
-            builder.add(PromptInjectionGuard::with_config(
-                prompt_injection_config_from(pi),
-            ));
-        }
-    }
-
-    // 9. detection.jailbreak -> JailbreakGuard
-    if let Some(jb) = &detection.jailbreak {
-        if jb.enabled.unwrap_or(true) {
-            builder.add(JailbreakGuard::with_config(jailbreak_config_from(jb)?));
-        }
-    }
-
-    // 10. detection.threat_intel -> SpiderSenseGuard
-    if let Some(threat_intel) = &detection.threat_intel {
-        if threat_intel.enabled.unwrap_or(true) {
-            builder.add(threat_intel_guard_from(threat_intel, source_dir)?);
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn prompt_injection_config_from(pi: &PromptInjectionDetection) -> PromptInjectionConfig {
     let mut config = PromptInjectionConfig::default();
     if let Some(block_at) = pi.block_at_or_above {
         config.score_threshold = prompt_level_to_score_threshold(block_at);
     }
     if let Some(max_scan_bytes) = pi.max_scan_bytes {
