--- crates/chio-policy/src/compiler.rs
+++ replace prompt_level_to_score_threshold -> f32 with 0.0
@@ -467,22 +467,17 @@
     }
     config
 }
 
 /// Convert a HushSpec `DetectionLevel` into a PromptInjectionGuard score
 /// threshold in `[0.0, 1.0]`. Higher levels require stronger signals before
 /// the guard denies.
 fn prompt_level_to_score_threshold(level: DetectionLevel) -> f32 {
-    match level {
-        DetectionLevel::Safe => 0.1,
-        DetectionLevel::Suspicious => 0.4,
-        DetectionLevel::High => 0.8,
-        DetectionLevel::Critical => 1.0,
-    }
+    0.0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn jailbreak_config_from(jb: &JailbreakDetection) -> Result<JailbreakGuardConfig, CompileError> {
     let mut config = JailbreakGuardConfig::default();
     let mut detector = JailbreakDetectorConfig::default();
 
     if let Some(block) = jb.block_threshold {
         // HushSpec expresses thresholds as integer percentages (0-100 in
