--- crates/chio-policy/src/compiler.rs
+++ replace threat_intel_guard_from -> Result<SpiderSenseGuard, CompileError> with Ok(Default::default())
@@ -509,50 +509,17 @@
     config.detector = detector;
     Ok(config)
 }
 
 fn threat_intel_guard_from(
     threat_intel: &ThreatIntelDetection,
     source_dir: Option<&Path>,
 ) -> Result<SpiderSenseGuard, CompileError> {
-    let pattern_db_path = threat_intel.pattern_db.as_deref().ok_or_else(|| {
-        CompileError::Invalid(
-            "detection.threat_intel.pattern_db is required when enabled".to_string(),
-        )
-    })?;
-
-    let resolved_pattern_db_path = resolve_policy_asset_path(pattern_db_path, source_dir);
-
-    let pattern_db_json = fs::read_to_string(&resolved_pattern_db_path).map_err(|error| {
-        CompileError::Invalid(format!(
-            "failed to read detection.threat_intel.pattern_db '{pattern_db_path}' (resolved to '{}'): {error}",
-            resolved_pattern_db_path.display()
-        ))
-    })?;
-    let pattern_db = PatternDb::from_json(&pattern_db_json).map_err(|error| {
-        CompileError::Invalid(format!(
-            "invalid detection.threat_intel.pattern_db '{pattern_db_path}' (resolved to '{}'): {error}",
-            resolved_pattern_db_path.display()
-        ))
-    })?;
-
-    let mut config = SpiderSenseConfig::default();
-    if let Some(similarity_threshold) = threat_intel.similarity_threshold {
-        config.similarity_threshold = similarity_threshold;
-    }
-    if let Some(top_k) = threat_intel.top_k {
-        config.top_k = top_k;
-    }
-
-    SpiderSenseGuard::new(pattern_db, config).map_err(|error| {
-        CompileError::Invalid(format!(
-            "invalid detection.threat_intel configuration: {error}"
-        ))
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn resolve_policy_asset_path(path: &str, source_dir: Option<&Path>) -> PathBuf {
     let candidate = PathBuf::from(path);
     if candidate.is_absolute() {
         return candidate;
     }
 
