--- crates/chio-policy/src/compiler.rs
+++ replace resolve_policy_asset_path -> PathBuf with Default::default()
@@ -546,25 +546,17 @@
     SpiderSenseGuard::new(pattern_db, config).map_err(|error| {
         CompileError::Invalid(format!(
             "invalid detection.threat_intel configuration: {error}"
         ))
     })
 }
 
 fn resolve_policy_asset_path(path: &str, source_dir: Option<&Path>) -> PathBuf {
-    let candidate = PathBuf::from(path);
-    if candidate.is_absolute() {
-        return candidate;
-    }
-
-    match source_dir {
-        Some(dir) => dir.join(candidate),
-        None => candidate,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Budget-driven guards (12)
 // ---------------------------------------------------------------------------
 
 fn compile_budget_guards(
     policy: &HushSpec,
