--- crates/chio-policy/src/compiler.rs
+++ replace compile_budget_guards -> Result<(), CompileError> with Ok(())
@@ -565,55 +565,17 @@
 // ---------------------------------------------------------------------------
 // Budget-driven guards (12)
 // ---------------------------------------------------------------------------
 
 fn compile_budget_guards(
     policy: &HushSpec,
     builder: &mut PipelineBuilder,
 ) -> Result<(), CompileError> {
-    let Some(extensions) = &policy.extensions else {
-        return Ok(());
-    };
-    let Some(origins) = &extensions.origins else {
-        return Ok(());
-    };
-
-    // 12. origin budgets -> AgentVelocityGuard
-    //
-    // Take the most restrictive `tool_calls` budget across all profiles and
-    // use it as the per-agent request ceiling within a 60-second window.
-    // This is a coarse mapping -- richer modelling would require a per-
-    // origin guard factory -- but it provides a single policy-driven way to
-    // exercise the guard type from a HushSpec document.
-    let mut tightest_tool_calls: Option<u32> = None;
-    for profile in &origins.profiles {
-        let Some(budgets) = &profile.budgets else {
-            continue;
-        };
-        if let Some(tool_calls) = budgets.tool_calls {
-            let as_u32 = u32::try_from(tool_calls).unwrap_or(u32::MAX);
-            tightest_tool_calls = Some(match tightest_tool_calls {
-                Some(current) => current.min(as_u32),
-                None => as_u32,
-            });
-        }
-    }
-
-    if let Some(limit) = tightest_tool_calls {
-        let config = AgentVelocityConfig {
-            max_requests_per_agent: Some(limit),
-            max_requests_per_session: None,
-            window_secs: 60,
-            burst_factor: 1.0,
-        };
-        builder.add(AgentVelocityGuard::new(config));
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Scope compilation (unchanged from phase 5.0)
 // ---------------------------------------------------------------------------
 
 /// Build a default ChioScope from the policy's tool_access rules.
 ///
