--- crates/chio-policy/src/compiler.rs
+++ replace && with || in compile_scope
@@ -636,17 +636,17 @@
 
     if ta.default == DefaultAction::Allow {
         if tool_access_can_safely_widen_to_wildcard(ta) {
             return Ok(permissive_scope());
         }
         return Ok(ChioScope::default());
     }
 
-    if ta.allow.is_empty() && ta.default == DefaultAction::Block {
+    if ta.allow.is_empty() || /* ~ changed by cargo-mutants ~ */ ta.default == DefaultAction::Block {
         // Block-by-default with no allowlist: empty scope
         return Ok(ChioScope::default());
     }
 
     if ta.require_workload_identity.is_some() || ta.prefer_workload_identity.is_some() {
         return Ok(ChioScope::default());
     }
 
