--- crates/chio-policy/src/compiler.rs
+++ replace || with && in compile_scope
@@ -641,17 +641,17 @@
         return Ok(ChioScope::default());
     }
 
     if ta.allow.is_empty() && ta.default == DefaultAction::Block {
         // Block-by-default with no allowlist: empty scope
         return Ok(ChioScope::default());
     }
 
-    if ta.require_workload_identity.is_some() || ta.prefer_workload_identity.is_some() {
+    if ta.require_workload_identity.is_some() && /* ~ changed by cargo-mutants ~ */ ta.prefer_workload_identity.is_some() {
         return Ok(ChioScope::default());
     }
 
     // Each allowed tool pattern becomes a grant on a wildcard server
     let human_in_loop = rules.human_in_loop.as_ref();
     let mut grants = Vec::with_capacity(ta.allow.len());
     for tool_pattern in &ta.allow {
         grants.push(ToolGrant {
