--- crates/chio-policy/src/compiler.rs
+++ replace compile_output_sanitizer_config -> OutputSanitizerConfig with Default::default()
@@ -694,23 +694,17 @@
         .map(|pattern| CustomSecretPattern {
             name: pattern.name.clone(),
             pattern: pattern.pattern.clone(),
         })
         .collect()
 }
 
 fn compile_output_sanitizer_config(rule: &SecretPatternsRule) -> OutputSanitizerConfig {
-    let mut config = OutputSanitizerConfig::default();
-    config.denylist.patterns = rule
-        .patterns
-        .iter()
-        .map(|pattern| pattern.pattern.clone())
-        .collect();
-    config
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn tool_access_can_safely_widen_to_wildcard(rule: &ToolAccessRule) -> bool {
     rule.allow.is_empty()
         && rule.block.is_empty()
         && rule.require_confirmation.is_empty()
         && rule.max_args_size.is_none()
         && rule.require_runtime_assurance_tier.is_none()
