--- crates/chio-policy/src/compiler.rs
+++ replace tool_access_can_safely_widen_to_wildcard -> bool with false
@@ -704,24 +704,17 @@
         .patterns
         .iter()
         .map(|pattern| pattern.pattern.clone())
         .collect();
     config
 }
 
 fn tool_access_can_safely_widen_to_wildcard(rule: &ToolAccessRule) -> bool {
-    rule.allow.is_empty()
-        && rule.block.is_empty()
-        && rule.require_confirmation.is_empty()
-        && rule.max_args_size.is_none()
-        && rule.require_runtime_assurance_tier.is_none()
-        && rule.prefer_runtime_assurance_tier.is_none()
-        && rule.require_workload_identity.is_none()
-        && rule.prefer_workload_identity.is_none()
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn compile_tool_constraints(
     rule: &ToolAccessRule,
     tool_pattern: &str,
     human_in_loop: Option<&HumanInLoopRule>,
 ) -> Result<Vec<Constraint>, CompileError> {
     let mut constraints = Vec::new();
