--- crates/chio-policy/src/compiler.rs
+++ replace compile_tool_constraints -> Result<Vec<Constraint>, CompileError> with Ok(vec![Default::default()])
@@ -719,55 +719,17 @@
         && rule.prefer_workload_identity.is_none()
 }
 
 fn compile_tool_constraints(
     rule: &ToolAccessRule,
     tool_pattern: &str,
     human_in_loop: Option<&HumanInLoopRule>,
 ) -> Result<Vec<Constraint>, CompileError> {
-    let mut constraints = Vec::new();
-    if let Some(max_args_size) = rule.max_args_size {
-        constraints.push(Constraint::MaxArgsSize(max_args_size));
-    }
-
-    // Determine approval threshold. tool_access.require_confirmation always
-    // forces threshold=0 (approval required for every invocation). A
-    // top-level `rules.human_in_loop` with `require_confirmation` globs that
-    // match this tool does the same. Otherwise, if `human_in_loop` is
-    // enabled and declares an `approve_above` threshold, use that threshold.
-    //
-    // velocity guard behavior, re-landed in post-rename update after the Chio rename
-    // rename.
-    let mut approval_threshold: Option<u64> = None;
-    if confirmation_overlap(tool_pattern, &rule.require_confirmation)? {
-        approval_threshold = Some(0);
-    }
-    if let Some(hil) = human_in_loop {
-        if hil.enabled {
-            if confirmation_overlap(tool_pattern, &hil.require_confirmation)? {
-                approval_threshold = Some(0);
-            } else if approval_threshold.is_none() {
-                if let Some(threshold) = hil.approve_above {
-                    approval_threshold = Some(threshold);
-                }
-            }
-        }
-    }
-    if let Some(threshold_units) = approval_threshold {
-        constraints.push(Constraint::RequireApprovalAbove { threshold_units });
-    }
-
-    if let Some(tier) = rule
-        .require_runtime_assurance_tier
-        .or(rule.prefer_runtime_assurance_tier)
-    {
-        constraints.push(Constraint::MinimumRuntimeAssurance(tier));
-    }
-    Ok(constraints)
+    Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Translate a `VelocityRule` into optional `VelocityConfig` +
 /// `AgentVelocityConfig`. If no invocation / spend / agent / session limit
 /// is set, returns `(None, None)` - i.e. the guard is effectively a no-op
 /// and no guard is pushed onto the pipeline. velocity guard semantics.
 fn compile_velocity_rule(
     rule: &VelocityRule,
