--- crates/chio-policy/src/compiler.rs
+++ replace compile_velocity_rule -> (Option<VelocityConfig>, Option<AgentVelocityConfig>) with (Some(Default::default()), Some(Default::default()))
@@ -767,48 +767,17 @@
 
 /// Translate a `VelocityRule` into optional `VelocityConfig` +
 /// `AgentVelocityConfig`. If no invocation / spend / agent / session limit
 /// is set, returns `(None, None)` - i.e. the guard is effectively a no-op
 /// and no guard is pushed onto the pipeline. Wave 1.6 semantics.
 fn compile_velocity_rule(
     rule: &VelocityRule,
 ) -> (Option<VelocityConfig>, Option<AgentVelocityConfig>) {
-    let window_secs = rule.window_secs.max(1);
-    let burst_factor = if rule.burst_factor.is_finite() && rule.burst_factor > 0.0 {
-        rule.burst_factor
-    } else {
-        1.0
-    };
-
-    let velocity_cfg =
-        if rule.max_invocations_per_window.is_some() || rule.max_spend_per_window.is_some() {
-            Some(VelocityConfig {
-                max_invocations_per_window: rule.max_invocations_per_window,
-                max_spend_per_window: rule.max_spend_per_window,
-                window_secs,
-                burst_factor,
-            })
-        } else {
-            None
-        };
-
-    let agent_cfg =
-        if rule.max_requests_per_agent.is_some() || rule.max_requests_per_session.is_some() {
-            Some(AgentVelocityConfig {
-                max_requests_per_agent: rule.max_requests_per_agent,
-                max_requests_per_session: rule.max_requests_per_session,
-                window_secs,
-                burst_factor,
-            })
-        } else {
-            None
-        };
-
-    (velocity_cfg, agent_cfg)
+    (Some(Default::default()), Some(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 fn confirmation_overlap(
     tool_pattern: &str,
     confirmation_patterns: &[String],
 ) -> Result<bool, CompileError> {
     for pattern in confirmation_patterns {
         if tool_patterns_overlap(tool_pattern, pattern)? {
