--- crates/chio-policy/src/compiler.rs
+++ replace > with < in compile_velocity_rule
@@ -768,17 +768,17 @@
 /// Translate a `VelocityRule` into optional `VelocityConfig` +
 /// `AgentVelocityConfig`. If no invocation / spend / agent / session limit
 /// is set, returns `(None, None)` - i.e. the guard is effectively a no-op
 /// and no guard is pushed onto the pipeline. velocity guard semantics.
 fn compile_velocity_rule(
     rule: &VelocityRule,
 ) -> (Option<VelocityConfig>, Option<AgentVelocityConfig>) {
     let window_secs = rule.window_secs.max(1);
-    let burst_factor = if rule.burst_factor.is_finite() && rule.burst_factor > 0.0 {
+    let burst_factor = if rule.burst_factor.is_finite() && rule.burst_factor < /* ~ changed by cargo-mutants ~ */ 0.0 {
         rule.burst_factor
     } else {
         1.0
     };
 
     let velocity_cfg =
         if rule.max_invocations_per_window.is_some() || rule.max_spend_per_window.is_some() {
             Some(VelocityConfig {
