--- crates/chio-policy/src/compiler.rs
+++ replace confirmation_overlap -> Result<bool, CompileError> with Ok(false)
@@ -805,22 +805,17 @@
 
     (velocity_cfg, agent_cfg)
 }
 
 fn confirmation_overlap(
     tool_pattern: &str,
     confirmation_patterns: &[String],
 ) -> Result<bool, CompileError> {
-    for pattern in confirmation_patterns {
-        if tool_patterns_overlap(tool_pattern, pattern)? {
-            return Ok(true);
-        }
-    }
-    Ok(false)
+    Ok(false) /* ~ changed by cargo-mutants ~ */
 }
 
 fn tool_patterns_overlap(left: &str, right: &str) -> Result<bool, CompileError> {
     if left == "*" || right == "*" {
         return Ok(true);
     }
     if !contains_wildcards(left) && !contains_wildcards(right) {
         return Ok(left == right);
