--- crates/chio-policy/src/compiler.rs
+++ replace || with && in tool_patterns_overlap
@@ -814,17 +814,17 @@
         if tool_patterns_overlap(tool_pattern, pattern)? {
             return Ok(true);
         }
     }
     Ok(false)
 }
 
 fn tool_patterns_overlap(left: &str, right: &str) -> Result<bool, CompileError> {
-    if left == "*" || right == "*" {
+    if left == "*" && /* ~ changed by cargo-mutants ~ */ right == "*" {
         return Ok(true);
     }
     if !contains_wildcards(left) && !contains_wildcards(right) {
         return Ok(left == right);
     }
     if glob_matches(left, right)? || glob_matches(right, left)? {
         return Ok(true);
     }
