--- crates/chio-policy/src/compiler.rs
+++ replace tool_patterns_overlap -> Result<bool, CompileError> with Ok(true)
@@ -814,28 +814,17 @@
         if tool_patterns_overlap(tool_pattern, pattern)? {
             return Ok(true);
         }
     }
     Ok(false)
 }
 
 fn tool_patterns_overlap(left: &str, right: &str) -> Result<bool, CompileError> {
-    if left == "*" || right == "*" {
-        return Ok(true);
-    }
-    if !contains_wildcards(left) && !contains_wildcards(right) {
-        return Ok(left == right);
-    }
-    if glob_matches(left, right)? || glob_matches(right, left)? {
-        return Ok(true);
-    }
-    let left_prefix = literal_prefix(left);
-    let right_prefix = literal_prefix(right);
-    Ok(left_prefix.starts_with(&right_prefix) || right_prefix.starts_with(&left_prefix))
+    Ok(true) /* ~ changed by cargo-mutants ~ */
 }
 
 fn contains_wildcards(pattern: &str) -> bool {
     pattern.contains('*') || pattern.contains('?')
 }
 
 fn literal_prefix(pattern: &str) -> String {
     pattern
