--- crates/chio-policy/src/compiler.rs
+++ replace || with && in contains_wildcards
@@ -829,17 +829,17 @@
         return Ok(true);
     }
     let left_prefix = literal_prefix(left);
     let right_prefix = literal_prefix(right);
     Ok(left_prefix.starts_with(&right_prefix) || right_prefix.starts_with(&left_prefix))
 }
 
 fn contains_wildcards(pattern: &str) -> bool {
-    pattern.contains('*') || pattern.contains('?')
+    pattern.contains('*') && /* ~ changed by cargo-mutants ~ */ pattern.contains('?')
 }
 
 fn literal_prefix(pattern: &str) -> String {
     pattern
         .chars()
         .take_while(|ch| *ch != '*' && *ch != '?')
         .collect()
 }
