--- crates/chio-policy/src/compiler.rs
+++ replace glob_matches -> Result<bool, CompileError> with Ok(true)
@@ -840,40 +840,17 @@
 fn literal_prefix(pattern: &str) -> String {
     pattern
         .chars()
         .take_while(|ch| *ch != '*' && *ch != '?')
         .collect()
 }
 
 fn glob_matches(pattern: &str, target: &str) -> Result<bool, CompileError> {
-    let mut regex = String::from("^");
-    let mut chars = pattern.chars().peekable();
-    while let Some(ch) = chars.next() {
-        match ch {
-            '*' => {
-                if matches!(chars.peek(), Some('*')) {
-                    chars.next();
-                    regex.push_str(".*");
-                } else {
-                    regex.push_str("[^/]*");
-                }
-            }
-            '?' => regex.push('.'),
-            '.' | '+' | '(' | ')' | '{' | '}' | '[' | ']' | '^' | '$' | '|' | '\\' => {
-                regex.push('\\');
-                regex.push(ch);
-            }
-            _ => regex.push(ch),
-        }
-    }
-    regex.push('$');
-    crate::regex_safety::compile_generated_policy_regex(&regex, "compiler glob pattern")
-        .map(|compiled| compiled.is_match(target))
-        .map_err(|error| CompileError::Invalid(format!("invalid policy glob pattern: {error}")))
+    Ok(true) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(clippy::unwrap_used, clippy::expect_used)]
 mod tests {
     use super::*;
     use std::path::PathBuf;
 
