--- crates/chio-policy/src/conditions.rs
+++ delete ! in evaluate_condition_depth
@@ -92,17 +92,17 @@
             .all(|c| evaluate_condition_depth(c, context, depth + 1))
         {
             return false;
         }
     }
 
     if let Some(any) = &condition.any_of {
         if !any.is_empty()
-            && !any
+            &&  /* ~ changed by cargo-mutants ~ */any
                 .iter()
                 .any(|c| evaluate_condition_depth(c, context, depth + 1))
         {
             return false;
         }
     }
 
     if let Some(not_cond) = &condition.not {
