--- crates/chio-policy/src/conditions.rs
+++ replace + with - in evaluate_condition_depth
@@ -101,17 +101,17 @@
                 .iter()
                 .any(|c| evaluate_condition_depth(c, context, depth + 1))
         {
             return false;
         }
     }
 
     if let Some(not_cond) = &condition.not {
-        if evaluate_condition_depth(not_cond, context, depth + 1) {
+        if evaluate_condition_depth(not_cond, context, depth - /* ~ changed by cargo-mutants ~ */ 1) {
             return false;
         }
     }
 
     true
 }
 
 fn check_time_window(tw: &TimeWindowCondition, context: &RuntimeContext) -> bool {
