--- crates/chio-policy/src/conditions.rs
+++ replace check_time_window -> bool with true
@@ -110,54 +110,17 @@
             return false;
         }
     }
 
     true
 }
 
 fn check_time_window(tw: &TimeWindowCondition, context: &RuntimeContext) -> bool {
-    let now = resolve_current_time(context, tw.timezone.as_deref());
-    let Some((hour, minute, day_of_week)) = now else {
-        return false;
-    };
-
-    let Some((start_h, start_m)) = parse_hhmm(&tw.start) else {
-        return false;
-    };
-    let Some((end_h, end_m)) = parse_hhmm(&tw.end) else {
-        return false;
-    };
-
-    let current_minutes = hour as u32 * 60 + minute as u32;
-    let start_minutes = start_h as u32 * 60 + start_m as u32;
-    let end_minutes = end_h as u32 * 60 + end_m as u32;
-    let wraps_midnight = start_minutes > end_minutes;
-
-    if !tw.days.is_empty() {
-        let effective_day = if wraps_midnight && current_minutes < end_minutes {
-            (day_of_week + 6) % 7
-        } else {
-            day_of_week
-        };
-        let day_abbrev = day_abbreviation(effective_day);
-        if !tw.days.iter().any(|d| d.eq_ignore_ascii_case(day_abbrev)) {
-            return false;
-        }
-    }
-
-    if start_minutes == end_minutes {
-        return true;
-    }
-
-    if start_minutes < end_minutes {
-        current_minutes >= start_minutes && current_minutes < end_minutes
-    } else {
-        current_minutes >= start_minutes || current_minutes < end_minutes
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_hhmm(s: &str) -> Option<(u8, u8)> {
     let parts: Vec<&str> = s.split(':').collect();
     if parts.len() != 2 {
         return None;
     }
     let hour: u8 = parts[0].parse().ok()?;
