--- crates/chio-policy/src/conditions.rs
+++ replace > with == in check_time_window
@@ -125,17 +125,17 @@
     };
     let Some((end_h, end_m)) = parse_hhmm(&tw.end) else {
         return false;
     };
 
     let current_minutes = hour as u32 * 60 + minute as u32;
     let start_minutes = start_h as u32 * 60 + start_m as u32;
     let end_minutes = end_h as u32 * 60 + end_m as u32;
-    let wraps_midnight = start_minutes > end_minutes;
+    let wraps_midnight = start_minutes == /* ~ changed by cargo-mutants ~ */ end_minutes;
 
     if !tw.days.is_empty() {
         let effective_day = if wraps_midnight && current_minutes < end_minutes {
             (day_of_week + 6) % 7
         } else {
             day_of_week
         };
         let day_abbrev = day_abbreviation(effective_day);
