--- crates/chio-policy/src/conditions.rs
+++ delete ! in check_time_window
@@ -134,17 +134,17 @@
 
     if !tw.days.is_empty() {
         let effective_day = if wraps_midnight && current_minutes < end_minutes {
             (day_of_week + 6) % 7
         } else {
             day_of_week
         };
         let day_abbrev = day_abbreviation(effective_day);
-        if !tw.days.iter().any(|d| d.eq_ignore_ascii_case(day_abbrev)) {
+        if  /* ~ changed by cargo-mutants ~ */tw.days.iter().any(|d| d.eq_ignore_ascii_case(day_abbrev)) {
             return false;
         }
     }
 
     if start_minutes == end_minutes {
         return true;
     }
 
