--- crates/chio-policy/src/conditions.rs
+++ replace == with != in check_time_window
@@ -139,17 +139,17 @@
             day_of_week
         };
         let day_abbrev = day_abbreviation(effective_day);
         if !tw.days.iter().any(|d| d.eq_ignore_ascii_case(day_abbrev)) {
             return false;
         }
     }
 
-    if start_minutes == end_minutes {
+    if start_minutes != /* ~ changed by cargo-mutants ~ */ end_minutes {
         return true;
     }
 
     if start_minutes < end_minutes {
         current_minutes >= start_minutes && current_minutes < end_minutes
     } else {
         current_minutes >= start_minutes || current_minutes < end_minutes
     }
