--- crates/chio-policy/src/conditions.rs
+++ replace parse_hhmm -> Option<(u8, u8)> with Some((0, 0))
@@ -151,26 +151,17 @@
     if start_minutes < end_minutes {
         current_minutes >= start_minutes && current_minutes < end_minutes
     } else {
         current_minutes >= start_minutes || current_minutes < end_minutes
     }
 }
 
 fn parse_hhmm(s: &str) -> Option<(u8, u8)> {
-    let parts: Vec<&str> = s.split(':').collect();
-    if parts.len() != 2 {
-        return None;
-    }
-    let hour: u8 = parts[0].parse().ok()?;
-    let minute: u8 = parts[1].parse().ok()?;
-    if hour > 23 || minute > 59 {
-        return None;
-    }
-    Some((hour, minute))
+    Some((0, 0)) /* ~ changed by cargo-mutants ~ */
 }
 
 fn day_abbreviation(day: u32) -> &'static str {
     match day {
         0 => "mon",
         1 => "tue",
         2 => "wed",
         3 => "thu",
