--- crates/chio-policy/src/conditions.rs
+++ replace != with == in parse_hhmm
@@ -152,17 +152,17 @@
         current_minutes >= start_minutes && current_minutes < end_minutes
     } else {
         current_minutes >= start_minutes || current_minutes < end_minutes
     }
 }
 
 fn parse_hhmm(s: &str) -> Option<(u8, u8)> {
     let parts: Vec<&str> = s.split(':').collect();
-    if parts.len() != 2 {
+    if parts.len() == /* ~ changed by cargo-mutants ~ */ 2 {
         return None;
     }
     let hour: u8 = parts[0].parse().ok()?;
     let minute: u8 = parts[1].parse().ok()?;
     if hour > 23 || minute > 59 {
         return None;
     }
     Some((hour, minute))
