--- crates/chio-policy/src/conditions.rs
+++ replace > with < in parse_hhmm
@@ -157,17 +157,17 @@
 
 fn parse_hhmm(s: &str) -> Option<(u8, u8)> {
     let parts: Vec<&str> = s.split(':').collect();
     if parts.len() != 2 {
         return None;
     }
     let hour: u8 = parts[0].parse().ok()?;
     let minute: u8 = parts[1].parse().ok()?;
-    if hour > 23 || minute > 59 {
+    if hour < /* ~ changed by cargo-mutants ~ */ 23 || minute > 59 {
         return None;
     }
     Some((hour, minute))
 }
 
 fn day_abbreviation(day: u32) -> &'static str {
     match day {
         0 => "mon",
