--- crates/chio-policy/src/conditions.rs
+++ delete match arm 1 in day_abbreviation
@@ -166,17 +166,17 @@
         return None;
     }
     Some((hour, minute))
 }
 
 fn day_abbreviation(day: u32) -> &'static str {
     match day {
         0 => "mon",
-        1 => "tue",
+         /* ~ changed by cargo-mutants ~ */
         2 => "wed",
         3 => "thu",
         4 => "fri",
         5 => "sat",
         6 => "sun",
         _ => "mon",
     }
 }
