--- crates/chio-policy/src/conditions.rs
+++ delete match arm 4 in day_abbreviation
@@ -169,17 +169,17 @@
 }
 
 fn day_abbreviation(day: u32) -> &'static str {
     match day {
         0 => "mon",
         1 => "tue",
         2 => "wed",
         3 => "thu",
-        4 => "fri",
+         /* ~ changed by cargo-mutants ~ */
         5 => "sat",
         6 => "sun",
         _ => "mon",
     }
 }
 
 fn resolve_current_time(context: &RuntimeContext, timezone: Option<&str>) -> Option<(u8, u8, u32)> {
     use chrono::{Datelike, FixedOffset, NaiveDateTime, Timelike, Utc};
