--- crates/chio-policy/src/conditions.rs
+++ replace resolve_current_time -> Option<(u8, u8, u32)> with Some((1, 0, 0))
@@ -177,44 +177,17 @@
         4 => "fri",
         5 => "sat",
         6 => "sun",
         _ => "mon",
     }
 }
 
 fn resolve_current_time(context: &RuntimeContext, timezone: Option<&str>) -> Option<(u8, u8, u32)> {
-    use chrono::{Datelike, FixedOffset, NaiveDateTime, Timelike, Utc};
-    use std::str::FromStr;
-
-    let utc_now = if let Some(ref time_str) = context.current_time {
-        if let Ok(dt) = chrono::DateTime::parse_from_rfc3339(time_str) {
-            dt.with_timezone(&Utc)
-        } else if let Ok(dt) = NaiveDateTime::parse_from_str(time_str, "%Y-%m-%dT%H:%M:%S") {
-            dt.and_utc()
-        } else {
-            return None;
-        }
-    } else {
-        Utc::now()
-    };
-
-    let tz = timezone.unwrap_or("UTC");
-    let adjusted = if let Ok(tz) = chrono_tz::Tz::from_str(tz) {
-        utc_now.with_timezone(&tz).fixed_offset()
-    } else {
-        let offset_minutes = parse_timezone_offset(tz)?;
-        let offset = FixedOffset::east_opt(offset_minutes.saturating_mul(60))?;
-        utc_now.with_timezone(&offset)
-    };
-    let hour = adjusted.hour() as u8;
-    let minute = adjusted.minute() as u8;
-    let day_of_week = adjusted.weekday().num_days_from_monday();
-
-    Some((hour, minute, day_of_week))
+    Some((1, 0, 0)) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_timezone_offset(tz: &str) -> Option<i32> {
     match tz {
         "UTC" | "utc" | "Etc/UTC" | "Etc/GMT" | "GMT" => Some(0),
         "US/Eastern" | "EST" => Some(-5 * 60),
         "US/Central" | "CST" => Some(-6 * 60),
         "US/Mountain" | "MST" => Some(-7 * 60),
