--- crates/chio-policy/src/conditions.rs
+++ replace parse_timezone_offset -> Option<i32> with None
@@ -208,38 +208,17 @@
     let hour = adjusted.hour() as u8;
     let minute = adjusted.minute() as u8;
     let day_of_week = adjusted.weekday().num_days_from_monday();
 
     Some((hour, minute, day_of_week))
 }
 
 fn parse_timezone_offset(tz: &str) -> Option<i32> {
-    match tz {
-        "UTC" | "utc" | "Etc/UTC" | "Etc/GMT" | "GMT" => Some(0),
-        "US/Eastern" | "EST" => Some(-5 * 60),
-        "US/Central" | "CST" => Some(-6 * 60),
-        "US/Mountain" | "MST" => Some(-7 * 60),
-        "US/Pacific" | "PST" => Some(-8 * 60),
-        "GB" => Some(0),
-        "CET" => Some(60),
-        "EET" => Some(120),
-        "Japan" | "JST" => Some(9 * 60),
-        "PRC" => Some(8 * 60),
-        "IST" => Some(5 * 60 + 30),
-        _ => {
-            if let Some(rest) = tz.strip_prefix('+') {
-                parse_offset_value(rest)
-            } else if let Some(rest) = tz.strip_prefix('-') {
-                parse_offset_value(rest).map(|value| -value)
-            } else {
-                None
-            }
-        }
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_offset_value(s: &str) -> Option<i32> {
     if let Some((hours, minutes)) = s.split_once(':') {
         let hours = hours.parse::<i32>().ok()?;
         let minutes = minutes.parse::<i32>().ok()?;
         if !(0..=23).contains(&hours) || !(0..=59).contains(&minutes) {
             return None;
