--- crates/chio-policy/src/conditions.rs
+++ delete match arm "UTC" | "utc" | "Etc/UTC" | "Etc/GMT" | "GMT" in parse_timezone_offset
@@ -209,17 +209,17 @@
     let minute = adjusted.minute() as u8;
     let day_of_week = adjusted.weekday().num_days_from_monday();
 
     Some((hour, minute, day_of_week))
 }
 
 fn parse_timezone_offset(tz: &str) -> Option<i32> {
     match tz {
-        "UTC" | "utc" | "Etc/UTC" | "Etc/GMT" | "GMT" => Some(0),
+         /* ~ changed by cargo-mutants ~ */
         "US/Eastern" | "EST" => Some(-5 * 60),
         "US/Central" | "CST" => Some(-6 * 60),
         "US/Mountain" | "MST" => Some(-7 * 60),
         "US/Pacific" | "PST" => Some(-8 * 60),
         "GB" => Some(0),
         "CET" => Some(60),
         "EET" => Some(120),
         "Japan" | "JST" => Some(9 * 60),
