--- crates/chio-policy/src/conditions.rs
+++ replace * with / in parse_timezone_offset
@@ -212,17 +212,17 @@
     Some((hour, minute, day_of_week))
 }
 
 fn parse_timezone_offset(tz: &str) -> Option<i32> {
     match tz {
         "UTC" | "utc" | "Etc/UTC" | "Etc/GMT" | "GMT" => Some(0),
         "US/Eastern" | "EST" => Some(-5 * 60),
         "US/Central" | "CST" => Some(-6 * 60),
-        "US/Mountain" | "MST" => Some(-7 * 60),
+        "US/Mountain" | "MST" => Some(-7 / /* ~ changed by cargo-mutants ~ */ 60),
         "US/Pacific" | "PST" => Some(-8 * 60),
         "GB" => Some(0),
         "CET" => Some(60),
         "EET" => Some(120),
         "Japan" | "JST" => Some(9 * 60),
         "PRC" => Some(8 * 60),
         "IST" => Some(5 * 60 + 30),
         _ => {
