--- crates/chio-policy/src/conditions.rs
+++ delete match arm "PRC" in parse_timezone_offset
@@ -218,17 +218,17 @@
         "US/Eastern" | "EST" => Some(-5 * 60),
         "US/Central" | "CST" => Some(-6 * 60),
         "US/Mountain" | "MST" => Some(-7 * 60),
         "US/Pacific" | "PST" => Some(-8 * 60),
         "GB" => Some(0),
         "CET" => Some(60),
         "EET" => Some(120),
         "Japan" | "JST" => Some(9 * 60),
-        "PRC" => Some(8 * 60),
+         /* ~ changed by cargo-mutants ~ */
         "IST" => Some(5 * 60 + 30),
         _ => {
             if let Some(rest) = tz.strip_prefix('+') {
                 parse_offset_value(rest)
             } else if let Some(rest) = tz.strip_prefix('-') {
                 parse_offset_value(rest).map(|value| -value)
             } else {
                 None
