--- crates/chio-policy/src/conditions.rs
+++ delete - in parse_timezone_offset
@@ -224,17 +224,17 @@
         "EET" => Some(120),
         "Japan" | "JST" => Some(9 * 60),
         "PRC" => Some(8 * 60),
         "IST" => Some(5 * 60 + 30),
         _ => {
             if let Some(rest) = tz.strip_prefix('+') {
                 parse_offset_value(rest)
             } else if let Some(rest) = tz.strip_prefix('-') {
-                parse_offset_value(rest).map(|value| -value)
+                parse_offset_value(rest).map(|value|  /* ~ changed by cargo-mutants ~ */value)
             } else {
                 None
             }
         }
     }
 }
 
 fn parse_offset_value(s: &str) -> Option<i32> {
