--- crates/chio-policy/src/conditions.rs
+++ delete ! in parse_offset_value
@@ -242,17 +242,17 @@
         let hours = hours.parse::<i32>().ok()?;
         let minutes = minutes.parse::<i32>().ok()?;
         if !(0..=23).contains(&hours) || !(0..=59).contains(&minutes) {
             return None;
         }
         Some(hours.saturating_mul(60).saturating_add(minutes))
     } else {
         let hours = s.parse::<i32>().ok()?;
-        if !(0..=23).contains(&hours) {
+        if  /* ~ changed by cargo-mutants ~ */(0..=23).contains(&hours) {
             return None;
         }
         Some(hours.saturating_mul(60))
     }
 }
 
 fn check_context_match(
     expected: &HashMap<String, serde_json::Value>,
