--- crates/chio-policy/src/conditions.rs
+++ replace check_context_match -> bool with true
@@ -253,23 +253,17 @@
         Some(hours.saturating_mul(60))
     }
 }
 
 fn check_context_match(
     expected: &HashMap<String, serde_json::Value>,
     context: &RuntimeContext,
 ) -> bool {
-    for (key, expected_value) in expected {
-        let actual = resolve_context_value(key, context);
-        if !match_value(&actual, expected_value) {
-            return false;
-        }
-    }
-    true
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn resolve_context_value(path: &str, context: &RuntimeContext) -> Option<serde_json::Value> {
     let (namespace, subkey) = match path.split_once('.') {
         Some((ns, key)) => (ns, Some(key)),
         None => (path, None),
     };
 
