--- crates/chio-policy/src/conditions.rs
+++ delete match arm "environment" in resolve_context_value
@@ -269,20 +269,17 @@
 
 fn resolve_context_value(path: &str, context: &RuntimeContext) -> Option<serde_json::Value> {
     let (namespace, subkey) = match path.split_once('.') {
         Some((ns, key)) => (ns, Some(key)),
         None => (path, None),
     };
 
     match namespace {
-        "environment" => context
-            .environment
-            .as_ref()
-            .map(|s| serde_json::Value::String(s.clone())),
+         /* ~ changed by cargo-mutants ~ */
         "user" => resolve_map_field(&context.user, subkey),
         "deployment" => resolve_map_field(&context.deployment, subkey),
         "agent" => resolve_map_field(&context.agent, subkey),
         "session" => resolve_map_field(&context.session, subkey),
         "request" => resolve_map_field(&context.request, subkey),
         "custom" => resolve_map_field(&context.custom, subkey),
         _ => None,
     }
