--- crates/chio-policy/src/conditions.rs
+++ delete match arm "custom" in resolve_context_value
@@ -278,17 +278,17 @@
             .environment
             .as_ref()
             .map(|s| serde_json::Value::String(s.clone())),
         "user" => resolve_map_field(&context.user, subkey),
         "deployment" => resolve_map_field(&context.deployment, subkey),
         "agent" => resolve_map_field(&context.agent, subkey),
         "session" => resolve_map_field(&context.session, subkey),
         "request" => resolve_map_field(&context.request, subkey),
-        "custom" => resolve_map_field(&context.custom, subkey),
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 fn resolve_map_field(
     map: &HashMap<String, serde_json::Value>,
     subkey: Option<&str>,
 ) -> Option<serde_json::Value> {
