--- crates/chio-policy/src/conditions.rs
+++ replace resolve_map_field -> Option<serde_json::Value> with None
@@ -287,20 +287,17 @@
         _ => None,
     }
 }
 
 fn resolve_map_field(
     map: &HashMap<String, serde_json::Value>,
     subkey: Option<&str>,
 ) -> Option<serde_json::Value> {
-    match subkey {
-        Some(key) => map.get(key).cloned(),
-        None => Some(serde_json::to_value(map).unwrap_or_default()),
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn values_equal(actual: &serde_json::Value, expected: &serde_json::Value) -> bool {
     match expected {
         serde_json::Value::String(expected_str) => actual.as_str() == Some(expected_str.as_str()),
         serde_json::Value::Bool(expected_bool) => actual.as_bool() == Some(*expected_bool),
         serde_json::Value::Number(expected_num) => {
             if let Some(expected_i64) = expected_num.as_i64() {
