--- crates/chio-policy/src/conditions.rs
+++ replace values_equal -> bool with true
@@ -294,32 +294,17 @@
 ) -> Option<serde_json::Value> {
     match subkey {
         Some(key) => map.get(key).cloned(),
         None => Some(serde_json::to_value(map).unwrap_or_default()),
     }
 }
 
 fn values_equal(actual: &serde_json::Value, expected: &serde_json::Value) -> bool {
-    match expected {
-        serde_json::Value::String(expected_str) => actual.as_str() == Some(expected_str.as_str()),
-        serde_json::Value::Bool(expected_bool) => actual.as_bool() == Some(*expected_bool),
-        serde_json::Value::Number(expected_num) => {
-            if let Some(expected_i64) = expected_num.as_i64() {
-                actual.as_i64() == Some(expected_i64)
-            } else if let Some(expected_f64) = expected_num.as_f64() {
-                actual
-                    .as_f64()
-                    .is_some_and(|n| (n - expected_f64).abs() < f64::EPSILON)
-            } else {
-                false
-            }
-        }
-        _ => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn matches_scalar_or_membership(actual: &serde_json::Value, expected: &serde_json::Value) -> bool {
     match actual {
         serde_json::Value::Array(arr) => arr.iter().any(|item| values_equal(item, expected)),
         _ => values_equal(actual, expected),
     }
 }
