--- crates/chio-policy/src/conditions.rs
+++ replace == with != in values_equal
@@ -299,17 +299,17 @@
 }
 
 fn values_equal(actual: &serde_json::Value, expected: &serde_json::Value) -> bool {
     match expected {
         serde_json::Value::String(expected_str) => actual.as_str() == Some(expected_str.as_str()),
         serde_json::Value::Bool(expected_bool) => actual.as_bool() == Some(*expected_bool),
         serde_json::Value::Number(expected_num) => {
             if let Some(expected_i64) = expected_num.as_i64() {
-                actual.as_i64() == Some(expected_i64)
+                actual.as_i64() != /* ~ changed by cargo-mutants ~ */ Some(expected_i64)
             } else if let Some(expected_f64) = expected_num.as_f64() {
                 actual
                     .as_f64()
                     .is_some_and(|n| (n - expected_f64).abs() < f64::EPSILON)
             } else {
                 false
             }
         }
