--- crates/chio-policy/src/conditions.rs
+++ replace matches_scalar_or_membership -> bool with true
@@ -313,20 +313,17 @@
                 false
             }
         }
         _ => false,
     }
 }
 
 fn matches_scalar_or_membership(actual: &serde_json::Value, expected: &serde_json::Value) -> bool {
-    match actual {
-        serde_json::Value::Array(arr) => arr.iter().any(|item| values_equal(item, expected)),
-        _ => values_equal(actual, expected),
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn match_value(actual: &Option<serde_json::Value>, expected: &serde_json::Value) -> bool {
     let Some(actual) = actual else {
         return false;
     };
 
     match expected {
