--- crates/chio-policy/src/conditions.rs
+++ delete match arm serde_json::Value::Array(arr) in matches_scalar_or_membership
@@ -314,17 +314,17 @@
             }
         }
         _ => false,
     }
 }
 
 fn matches_scalar_or_membership(actual: &serde_json::Value, expected: &serde_json::Value) -> bool {
     match actual {
-        serde_json::Value::Array(arr) => arr.iter().any(|item| values_equal(item, expected)),
+         /* ~ changed by cargo-mutants ~ */
         _ => values_equal(actual, expected),
     }
 }
 
 fn match_value(actual: &Option<serde_json::Value>, expected: &serde_json::Value) -> bool {
     let Some(actual) = actual else {
         return false;
     };
