--- crates/chio-policy/src/conditions.rs
+++ replace match_value -> bool with false
@@ -320,29 +320,17 @@
 fn matches_scalar_or_membership(actual: &serde_json::Value, expected: &serde_json::Value) -> bool {
     match actual {
         serde_json::Value::Array(arr) => arr.iter().any(|item| values_equal(item, expected)),
         _ => values_equal(actual, expected),
     }
 }
 
 fn match_value(actual: &Option<serde_json::Value>, expected: &serde_json::Value) -> bool {
-    let Some(actual) = actual else {
-        return false;
-    };
-
-    match expected {
-        serde_json::Value::String(_)
-        | serde_json::Value::Bool(_)
-        | serde_json::Value::Number(_) => matches_scalar_or_membership(actual, expected),
-        serde_json::Value::Array(expected_arr) => expected_arr
-            .iter()
-            .any(|candidate| matches_scalar_or_membership(actual, candidate)),
-        _ => false,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn context_at(current_time: &str) -> RuntimeContext {
         RuntimeContext {
