--- crates/chio-policy/src/conditions.rs
+++ delete match arm serde_json::Value::String(_) | serde_json::Value::Bool(_) | serde_json::Value::Number(_) in match_value
@@ -325,19 +325,17 @@
 }
 
 fn match_value(actual: &Option<serde_json::Value>, expected: &serde_json::Value) -> bool {
     let Some(actual) = actual else {
         return false;
     };
 
     match expected {
-        serde_json::Value::String(_)
-        | serde_json::Value::Bool(_)
-        | serde_json::Value::Number(_) => matches_scalar_or_membership(actual, expected),
+         /* ~ changed by cargo-mutants ~ */
         serde_json::Value::Array(expected_arr) => expected_arr
             .iter()
             .any(|candidate| matches_scalar_or_membership(actual, candidate)),
         _ => false,
     }
 }
 
 #[cfg(test)]
