--- crates/chio-policy/src/conditions.rs
+++ delete match arm serde_json::Value::Array(expected_arr) in match_value
@@ -328,19 +328,17 @@
     let Some(actual) = actual else {
         return false;
     };
 
     match expected {
         serde_json::Value::String(_)
         | serde_json::Value::Bool(_)
         | serde_json::Value::Number(_) => matches_scalar_or_membership(actual, expected),
-        serde_json::Value::Array(expected_arr) => expected_arr
-            .iter()
-            .any(|candidate| matches_scalar_or_membership(actual, candidate)),
+         /* ~ changed by cargo-mutants ~ */
         _ => false,
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
