--- crates/chio-policy/src/conditions.rs
+++ replace evaluate_condition_depth -> bool with false
@@ -65,58 +65,17 @@
 }
 
 /// Missing context fields cause the condition to evaluate to false (fail-closed).
 pub fn evaluate_condition(condition: &Condition, context: &RuntimeContext) -> bool {
     evaluate_condition_depth(condition, context, 0)
 }
 
 fn evaluate_condition_depth(condition: &Condition, context: &RuntimeContext, depth: usize) -> bool {
-    if depth > MAX_NESTING_DEPTH {
-        return false;
-    }
-
-    if let Some(tw) = &condition.time_window {
-        if !check_time_window(tw, context) {
-            return false;
-        }
-    }
-
-    if let Some(ctx) = &condition.context {
-        if !check_context_match(ctx, context) {
-            return false;
-        }
-    }
-
-    if let Some(all) = &condition.all_of {
-        if !all
-            .iter()
-            .all(|c| evaluate_condition_depth(c, context, depth + 1))
-        {
-            return false;
-        }
-    }
-
-    if let Some(any) = &condition.any_of {
-        if !any.is_empty()
-            && !any
-                .iter()
-                .any(|c| evaluate_condition_depth(c, context, depth + 1))
-        {
-            return false;
-        }
-    }
-
-    if let Some(not_cond) = &condition.not {
-        if evaluate_condition_depth(not_cond, context, depth + 1) {
-            return false;
-        }
-    }
-
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn check_time_window(tw: &TimeWindowCondition, context: &RuntimeContext) -> bool {
     let now = resolve_current_time(context, tw.timezone.as_deref());
     let Some((hour, minute, day_of_week)) = now else {
         return false;
     };
 
