--- crates/chio-policy/src/conditions.rs
+++ delete ! in evaluate_condition_depth
@@ -76,17 +76,17 @@
 
     if let Some(tw) = &condition.time_window {
         if !check_time_window(tw, context) {
             return false;
         }
     }
 
     if let Some(ctx) = &condition.context {
-        if !check_context_match(ctx, context) {
+        if  /* ~ changed by cargo-mutants ~ */check_context_match(ctx, context) {
             return false;
         }
     }
 
     if let Some(all) = &condition.all_of {
         if !all
             .iter()
             .all(|c| evaluate_condition_depth(c, context, depth + 1))
