--- crates/chio-policy/src/conditions.rs
+++ delete ! in evaluate_condition_depth
@@ -82,17 +82,17 @@
 
     if let Some(ctx) = &condition.context {
         if !check_context_match(ctx, context) {
             return false;
         }
     }
 
     if let Some(all) = &condition.all_of {
-        if !all
+        if  /* ~ changed by cargo-mutants ~ */all
             .iter()
             .all(|c| evaluate_condition_depth(c, context, depth + 1))
         {
             return false;
         }
     }
 
     if let Some(any) = &condition.any_of {
