--- crates/chio-policy/src/conditions.rs
+++ replace + with - in evaluate_condition_depth
@@ -84,17 +84,17 @@
         if !check_context_match(ctx, context) {
             return false;
         }
     }
 
     if let Some(all) = &condition.all_of {
         if !all
             .iter()
-            .all(|c| evaluate_condition_depth(c, context, depth + 1))
+            .all(|c| evaluate_condition_depth(c, context, depth - /* ~ changed by cargo-mutants ~ */ 1))
         {
             return false;
         }
     }
 
     if let Some(any) = &condition.any_of {
         if !any.is_empty()
             && !any
