--- crates/chio-policy/src/detection.rs
+++ replace <impl Detector for RegexInjectionDetector>::category -> DetectionCategory with Default::default()
@@ -154,17 +154,17 @@
     }
 }
 
 impl Detector for RegexInjectionDetector {
     fn name(&self) -> &str {
         "regex_injection"
     }
     fn category(&self) -> DetectionCategory {
-        DetectionCategory::PromptInjection
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
     fn detect(&self, input: &str) -> DetectionResult {
         run_patterns(
             &self.patterns,
             self.name(),
             self.category(),
             input,
             "injection",
