--- crates/chio-policy/src/detection.rs
+++ replace <impl Detector for RegexInjectionDetector>::detect -> DetectionResult with Default::default()
@@ -157,23 +157,17 @@
 impl Detector for RegexInjectionDetector {
     fn name(&self) -> &str {
         "regex_injection"
     }
     fn category(&self) -> DetectionCategory {
         DetectionCategory::PromptInjection
     }
     fn detect(&self, input: &str) -> DetectionResult {
-        run_patterns(
-            &self.patterns,
-            self.name(),
-            self.category(),
-            input,
-            "injection",
-        )
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------------------------------------------------------------
 // Regex-based jailbreak detector
 // ---------------------------------------------------------------------------
 
 pub struct RegexJailbreakDetector {
