--- crates/chio-policy/src/detection.rs
+++ replace <impl Detector for RegexJailbreakDetector>::category -> DetectionCategory with Default::default()
@@ -199,17 +199,17 @@
     }
 }
 
 impl Detector for RegexJailbreakDetector {
     fn name(&self) -> &str {
         "regex_jailbreak"
     }
     fn category(&self) -> DetectionCategory {
-        DetectionCategory::Jailbreak
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
     fn detect(&self, input: &str) -> DetectionResult {
         run_patterns(
             &self.patterns,
             self.name(),
             self.category(),
             input,
             "jailbreak",
