--- crates/chio-policy/src/detection.rs
+++ replace <impl Detector for RegexJailbreakDetector>::detect -> DetectionResult with Default::default()
@@ -202,23 +202,17 @@
 impl Detector for RegexJailbreakDetector {
     fn name(&self) -> &str {
         "regex_jailbreak"
     }
     fn category(&self) -> DetectionCategory {
         DetectionCategory::Jailbreak
     }
     fn detect(&self, input: &str) -> DetectionResult {
-        run_patterns(
-            &self.patterns,
-            self.name(),
-            self.category(),
-            input,
-            "jailbreak",
-        )
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------------------------------------------------------------
 // Regex-based data exfiltration detector
 // ---------------------------------------------------------------------------
 
 pub struct RegexExfiltrationDetector {
