--- crates/chio-policy/src/detection.rs
+++ replace <impl Detector for RegexExfiltrationDetector>::name -> &str with "xyzzy"
@@ -270,17 +270,17 @@
 impl Default for RegexExfiltrationDetector {
     fn default() -> Self {
         Self::new()
     }
 }
 
 impl Detector for RegexExfiltrationDetector {
     fn name(&self) -> &str {
-        "regex_exfiltration"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
     fn category(&self) -> DetectionCategory {
         DetectionCategory::DataExfiltration
     }
     fn detect(&self, input: &str) -> DetectionResult {
         run_patterns(
             &self.patterns,
             self.name(),
