--- crates/chio-policy/src/detection.rs
+++ replace <impl Detector for RegexExfiltrationDetector>::category -> DetectionCategory with Default::default()
@@ -273,17 +273,17 @@
     }
 }
 
 impl Detector for RegexExfiltrationDetector {
     fn name(&self) -> &str {
         "regex_exfiltration"
     }
     fn category(&self) -> DetectionCategory {
-        DetectionCategory::DataExfiltration
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
     fn detect(&self, input: &str) -> DetectionResult {
         run_patterns(
             &self.patterns,
             self.name(),
             self.category(),
             input,
             "exfiltration",
