--- crates/chio-policy/src/detection.rs
+++ delete ! in evaluate_with_detection
@@ -374,17 +374,17 @@
 pub fn evaluate_with_detection(
     spec: &HushSpec,
     action: &EvaluationAction,
     registry: &DetectorRegistry,
     config: &DetectionConfig,
 ) -> EvaluationWithDetection {
     let evaluation = evaluate(spec, action);
 
-    if !config.enabled {
+    if  /* ~ changed by cargo-mutants ~ */config.enabled {
         return EvaluationWithDetection {
             evaluation,
             detections: vec![],
             detection_decision: None,
         };
     }
 
     let content = action.content.as_deref().unwrap_or_default();
