--- crates/chio-policy/src/detection.rs
+++ replace == with != in evaluate_with_detection
@@ -395,17 +395,17 @@
             detection_decision: None,
         };
     }
 
     let detections = registry.detect_all(content);
     let detection_decision = check_thresholds(&detections, config);
 
     let final_eval =
-        if detection_decision == Some(Decision::Deny) && evaluation.decision != Decision::Deny {
+        if detection_decision != /* ~ changed by cargo-mutants ~ */ Some(Decision::Deny) && evaluation.decision != Decision::Deny {
             EvaluationResult {
                 decision: Decision::Deny,
                 matched_rule: Some("detection".to_string()),
                 reason: Some("content exceeded detection threshold".to_string()),
                 origin_profile: evaluation.origin_profile.clone(),
                 posture: evaluation.posture.clone(),
             }
         } else {
