--- crates/chio-policy/src/detection.rs
+++ replace >= with < in check_thresholds
@@ -421,17 +421,17 @@
 
 fn check_thresholds(detections: &[DetectionResult], config: &DetectionConfig) -> Option<Decision> {
     let should_deny = detections.iter().any(|result| {
         let threshold = match result.category {
             DetectionCategory::PromptInjection => config.prompt_injection_threshold,
             DetectionCategory::Jailbreak => config.jailbreak_threshold,
             DetectionCategory::DataExfiltration => config.exfiltration_threshold,
         };
-        result.score >= threshold
+        result.score < /* ~ changed by cargo-mutants ~ */ threshold
     });
 
     if should_deny {
         Some(Decision::Deny)
     } else {
         None
     }
 }
