--- crates/chio-policy/src/detection.rs
+++ replace DetectorRegistry::register with ()
@@ -48,17 +48,17 @@
 impl DetectorRegistry {
     pub fn new() -> Self {
         Self {
             detectors: Vec::new(),
         }
     }
 
     pub fn register(&mut self, detector: Box<dyn Detector>) {
-        self.detectors.push(detector);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn with_defaults() -> Self {
         let mut registry = Self::new();
         registry.register(Box::new(RegexInjectionDetector::new()));
         registry.register(Box::new(RegexJailbreakDetector::new()));
         registry.register(Box::new(RegexExfiltrationDetector::new()));
         registry
