--- crates/chio-policy/src/detection.rs
+++ replace DetectorRegistry::detect_all -> Vec<DetectionResult> with vec![]
@@ -60,17 +60,17 @@
         let mut registry = Self::new();
         registry.register(Box::new(RegexInjectionDetector::new()));
         registry.register(Box::new(RegexJailbreakDetector::new()));
         registry.register(Box::new(RegexExfiltrationDetector::new()));
         registry
     }
 
     pub fn detect_all(&self, input: &str) -> Vec<DetectionResult> {
-        self.detectors.iter().map(|d| d.detect(input)).collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for DetectorRegistry {
     fn default() -> Self {
         Self::new()
     }
 }
