--- crates/chio-policy/src/merge.rs
+++ replace merge_extensions_merge -> Option<Extensions> with Some(Default::default())
@@ -99,34 +99,17 @@
         (None, None) => None,
     }
 }
 
 fn merge_extensions_merge(
     base: &Option<Extensions>,
     child: &Option<Extensions>,
 ) -> Option<Extensions> {
-    match (base, child) {
-        (_, Some(child_ext)) => {
-            let base_ext = base.as_ref().cloned().unwrap_or_default();
-            Some(Extensions {
-                posture: child_ext.posture.clone().or(base_ext.posture),
-                origins: child_ext.origins.clone().or(base_ext.origins),
-                detection: child_ext.detection.clone().or(base_ext.detection),
-                reputation: child_ext.reputation.clone().or(base_ext.reputation),
-                runtime_assurance: child_ext
-                    .runtime_assurance
-                    .clone()
-                    .or(base_ext.runtime_assurance),
-                chio: child_ext.chio.clone().or(base_ext.chio),
-            })
-        }
-        (Some(base_ext), None) => Some(base_ext.clone()),
-        (None, None) => None,
-    }
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn merge_extensions_deep(
     base: &Option<Extensions>,
     child: &Option<Extensions>,
 ) -> Option<Extensions> {
     match (base, child) {
         (_, Some(child_ext)) => {
