--- crates/chio-policy/src/merge.rs
+++ replace merge_extensions_deep -> Option<Extensions> with None
@@ -123,34 +123,17 @@
         (None, None) => None,
     }
 }
 
 fn merge_extensions_deep(
     base: &Option<Extensions>,
     child: &Option<Extensions>,
 ) -> Option<Extensions> {
-    match (base, child) {
-        (_, Some(child_ext)) => {
-            let base_ext = base.as_ref().cloned().unwrap_or_default();
-            Some(Extensions {
-                posture: merge_posture(&base_ext.posture, &child_ext.posture),
-                origins: merge_origins(&base_ext.origins, &child_ext.origins),
-                detection: merge_detection(&base_ext.detection, &child_ext.detection),
-                reputation: merge_reputation(&base_ext.reputation, &child_ext.reputation),
-                runtime_assurance: child_ext
-                    .runtime_assurance
-                    .clone()
-                    .or(base_ext.runtime_assurance),
-                chio: merge_chio(&base_ext.chio, &child_ext.chio),
-            })
-        }
-        (Some(base_ext), None) => Some(base_ext.clone()),
-        (None, None) => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn merge_posture(
     base: &Option<PostureExtension>,
     child: &Option<PostureExtension>,
 ) -> Option<PostureExtension> {
     match (base, child) {
         (_, Some(child_posture)) => {
