--- crates/chio-policy/src/merge.rs
+++ replace merge_reputation -> Option<ReputationExtension> with Some(Default::default())
@@ -235,37 +235,17 @@
         (None, None) => None,
     }
 }
 
 fn merge_reputation(
     base: &Option<ReputationExtension>,
     child: &Option<ReputationExtension>,
 ) -> Option<ReputationExtension> {
-    match (base, child) {
-        (_, Some(child_reputation)) => {
-            if let Some(base_reputation) = base {
-                let mut tiers = base_reputation.tiers.clone();
-                for (name, tier) in &child_reputation.tiers {
-                    tiers.insert(name.clone(), tier.clone());
-                }
-                Some(ReputationExtension {
-                    scoring: merge_reputation_scoring(
-                        &base_reputation.scoring,
-                        &child_reputation.scoring,
-                    ),
-                    tiers,
-                })
-            } else {
-                Some(child_reputation.clone())
-            }
-        }
-        (Some(base_reputation), None) => Some(base_reputation.clone()),
-        (None, None) => None,
-    }
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn merge_reputation_scoring(
     base: &Option<ReputationScoringConfig>,
     child: &Option<ReputationScoringConfig>,
 ) -> Option<ReputationScoringConfig> {
     match (base, child) {
         (_, Some(child_scoring)) => {
