--- crates/chio-policy/src/merge.rs
+++ replace merge_threat_intel -> Option<ThreatIntelDetection> with None
@@ -386,37 +386,17 @@
         (None, None) => None,
     }
 }
 
 fn merge_threat_intel(
     base: &Option<ThreatIntelDetection>,
     child: &Option<ThreatIntelDetection>,
 ) -> Option<ThreatIntelDetection> {
-    match (base, child) {
-        (_, Some(child_threat_intel)) => {
-            if let Some(base_threat_intel) = base {
-                Some(ThreatIntelDetection {
-                    enabled: child_threat_intel.enabled.or(base_threat_intel.enabled),
-                    pattern_db: child_threat_intel
-                        .pattern_db
-                        .clone()
-                        .or_else(|| base_threat_intel.pattern_db.clone()),
-                    similarity_threshold: child_threat_intel
-                        .similarity_threshold
-                        .or(base_threat_intel.similarity_threshold),
-                    top_k: child_threat_intel.top_k.or(base_threat_intel.top_k),
-                })
-            } else {
-                Some(child_threat_intel.clone())
-            }
-        }
-        (Some(base_threat_intel), None) => Some(base_threat_intel.clone()),
-        (None, None) => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn merge_chio(
     base: &Option<ChioExtension>,
     child: &Option<ChioExtension>,
 ) -> Option<ChioExtension> {
     match (base, child) {
         (_, Some(child_chio)) => {
