--- crates/chio-policy/src/merge.rs
+++ replace merge_chio -> Option<ChioExtension> with Some(Default::default())
@@ -413,48 +413,17 @@
         (None, None) => None,
     }
 }
 
 fn merge_chio(
     base: &Option<ChioExtension>,
     child: &Option<ChioExtension>,
 ) -> Option<ChioExtension> {
-    match (base, child) {
-        (_, Some(child_chio)) => {
-            if let Some(base_chio) = base {
-                Some(ChioExtension {
-                    market_hours: child_chio
-                        .market_hours
-                        .clone()
-                        .or_else(|| base_chio.market_hours.clone()),
-                    signing: child_chio
-                        .signing
-                        .clone()
-                        .or_else(|| base_chio.signing.clone()),
-                    k8s_namespaces: child_chio
-                        .k8s_namespaces
-                        .clone()
-                        .or_else(|| base_chio.k8s_namespaces.clone()),
-                    rollback: child_chio
-                        .rollback
-                        .clone()
-                        .or_else(|| base_chio.rollback.clone()),
-                    human_in_loop: child_chio
-                        .human_in_loop
-                        .clone()
-                        .or_else(|| base_chio.human_in_loop.clone()),
-                })
-            } else {
-                Some(child_chio.clone())
-            }
-        }
-        (Some(base_chio), None) => Some(base_chio.clone()),
-        (None, None) => None,
-    }
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::models::{
         DefaultAction, DetectionLevel, EgressRule, ForbiddenPathsRule, OriginProfile, PostureState,
         PostureTransition, ReputationTier, ReputationTierScope, RuntimeAssuranceExtension,
