--- crates/chio-policy/src/merge.rs
+++ replace merge_rules -> Option<Rules> with Some(Default::default())
@@ -40,69 +40,17 @@
         } else {
             merge_extensions_merge(&base.extensions, &child.extensions)
         },
         metadata: child.metadata.clone().or_else(|| base.metadata.clone()),
     }
 }
 
 fn merge_rules(base: &Option<Rules>, child: &Option<Rules>) -> Option<Rules> {
-    match (base, child) {
-        (_, Some(child_rules)) => {
-            let base_rules = base.as_ref().cloned().unwrap_or_default();
-            Some(Rules {
-                forbidden_paths: child_rules
-                    .forbidden_paths
-                    .clone()
-                    .or(base_rules.forbidden_paths),
-                path_allowlist: child_rules
-                    .path_allowlist
-                    .clone()
-                    .or(base_rules.path_allowlist),
-                egress: child_rules.egress.clone().or(base_rules.egress),
-                secret_patterns: child_rules
-                    .secret_patterns
-                    .clone()
-                    .or(base_rules.secret_patterns),
-                patch_integrity: child_rules
-                    .patch_integrity
-                    .clone()
-                    .or(base_rules.patch_integrity),
-                shell_commands: child_rules
-                    .shell_commands
-                    .clone()
-                    .or(base_rules.shell_commands),
-                tool_access: child_rules.tool_access.clone().or(base_rules.tool_access),
-                computer_use: child_rules.computer_use.clone().or(base_rules.computer_use),
-                remote_desktop_channels: child_rules
-                    .remote_desktop_channels
-                    .clone()
-                    .or(base_rules.remote_desktop_channels),
-                input_injection: child_rules
-                    .input_injection
-                    .clone()
-                    .or(base_rules.input_injection),
-                browser_automation: child_rules
-                    .browser_automation
-                    .clone()
-                    .or(base_rules.browser_automation),
-                code_execution: child_rules
-                    .code_execution
-                    .clone()
-                    .or(base_rules.code_execution),
-                velocity: child_rules.velocity.clone().or(base_rules.velocity),
-                human_in_loop: child_rules
-                    .human_in_loop
-                    .clone()
-                    .or(base_rules.human_in_loop),
-            })
-        }
-        (Some(base_rules), None) => Some(base_rules.clone()),
-        (None, None) => None,
-    }
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn merge_extensions_merge(
     base: &Option<Extensions>,
     child: &Option<Extensions>,
 ) -> Option<Extensions> {
     match (base, child) {
         (_, Some(child_ext)) => {
