--- crates/chio-policy/src/receipt.rs
+++ replace && with || in evaluate_audited
@@ -92,17 +92,17 @@
             version: spec.hushspec.clone(),
             content_hash: String::new(),
         }
     };
 
     let action_summary = ActionSummary {
         action_type: action.action_type.clone(),
         target: action.target.clone(),
-        content_redacted: config.redact_content && action.content.is_some(),
+        content_redacted: config.redact_content || /* ~ changed by cargo-mutants ~ */ action.content.is_some(),
     };
 
     let timestamp = chrono::Utc::now().to_rfc3339_opts(chrono::SecondsFormat::Millis, true);
 
     DecisionReceipt {
         receipt_id: Uuid::new_v4().to_string(),
         timestamp,
         hushspec_version: HUSHSPEC_VERSION.to_string(),
