--- crates/chio-policy/src/regex_safety.rs
+++ replace compile_policy_regex -> Result<Regex, String> with Ok(Default::default())
@@ -8,36 +8,17 @@
 const POLICY_REGEX_SIZE_LIMIT: usize = 1 << 20;
 const POLICY_REGEX_DFA_SIZE_LIMIT: usize = 1 << 20;
 const POLICY_REGEX_CACHE_MAX_KEYS: usize = 4_096;
 
 static POLICY_REGEX_CACHE: OnceLock<StdMutex<HashMap<String, Result<Regex, String>>>> =
     OnceLock::new();
 
 pub(crate) fn compile_policy_regex(pattern: &str, field: &str) -> Result<Regex, String> {
-    let trimmed = pattern.trim();
-    if trimmed.is_empty() {
-        return Err(format!("{field} cannot be empty"));
-    }
-    if trimmed.len() > MAX_POLICY_REGEX_LEN {
-        return Err(format!(
-            "{field} must be at most {MAX_POLICY_REGEX_LEN} characters"
-        ));
-    }
-    let complexity = policy_regex_complexity(trimmed);
-    if complexity > MAX_POLICY_REGEX_COMPLEXITY {
-        return Err(format!(
-            "{field} must have complexity at most {MAX_POLICY_REGEX_COMPLEXITY}"
-        ));
-    }
-    RegexBuilder::new(trimmed)
-        .size_limit(POLICY_REGEX_SIZE_LIMIT)
-        .dfa_size_limit(POLICY_REGEX_DFA_SIZE_LIMIT)
-        .build()
-        .map_err(|error| format!("{field} invalid regex pattern {trimmed:?}: {error}"))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn compile_generated_policy_regex(pattern: &str, field: &str) -> Result<Regex, String> {
     if pattern.is_empty() {
         return Err(format!("{field} cannot be empty"));
     }
     RegexBuilder::new(pattern)
         .size_limit(POLICY_REGEX_SIZE_LIMIT)
