--- crates/chio-policy/src/regex_safety.rs
+++ replace > with == in compile_policy_regex
@@ -12,17 +12,17 @@
 static POLICY_REGEX_CACHE: OnceLock<StdMutex<HashMap<String, Result<Regex, String>>>> =
     OnceLock::new();
 
 pub(crate) fn compile_policy_regex(pattern: &str, field: &str) -> Result<Regex, String> {
     let trimmed = pattern.trim();
     if trimmed.is_empty() {
         return Err(format!("{field} cannot be empty"));
     }
-    if trimmed.len() > MAX_POLICY_REGEX_LEN {
+    if trimmed.len() == /* ~ changed by cargo-mutants ~ */ MAX_POLICY_REGEX_LEN {
         return Err(format!(
             "{field} must be at most {MAX_POLICY_REGEX_LEN} characters"
         ));
     }
     let complexity = policy_regex_complexity(trimmed);
     if complexity > MAX_POLICY_REGEX_COMPLEXITY {
         return Err(format!(
             "{field} must have complexity at most {MAX_POLICY_REGEX_COMPLEXITY}"
