--- crates/chio-policy/src/regex_safety.rs
+++ replace > with == in compile_policy_regex
@@ -18,17 +18,17 @@
         return Err(format!("{field} cannot be empty"));
     }
     if trimmed.len() > MAX_POLICY_REGEX_LEN {
         return Err(format!(
             "{field} must be at most {MAX_POLICY_REGEX_LEN} characters"
         ));
     }
     let complexity = policy_regex_complexity(trimmed);
-    if complexity > MAX_POLICY_REGEX_COMPLEXITY {
+    if complexity == /* ~ changed by cargo-mutants ~ */ MAX_POLICY_REGEX_COMPLEXITY {
         return Err(format!(
             "{field} must have complexity at most {MAX_POLICY_REGEX_COMPLEXITY}"
         ));
     }
     RegexBuilder::new(trimmed)
         .size_limit(POLICY_REGEX_SIZE_LIMIT)
         .dfa_size_limit(POLICY_REGEX_DFA_SIZE_LIMIT)
         .build()
