--- crates/chio-policy/src/regex_safety.rs
+++ replace policy_regex_is_match -> Result<bool, String> with Ok(false)
@@ -46,34 +46,17 @@
         .map_err(|error| format!("{field} invalid generated regex: {error}"))
 }
 
 pub(crate) fn policy_regex_is_match(
     pattern: &str,
     field: &str,
     haystack: &str,
 ) -> Result<bool, String> {
-    let cache = POLICY_REGEX_CACHE.get_or_init(|| StdMutex::new(HashMap::new()));
-    let key = format!("{field}\0{pattern}");
-    let compiled = {
-        let mut guard = cache
-            .lock()
-            .map_err(|_| format!("{field} regex cache lock was poisoned"))?;
-        if let Some(compiled) = guard.get(&key) {
-            compiled.clone()
-        } else {
-            if guard.len() >= POLICY_REGEX_CACHE_MAX_KEYS {
-                guard.clear();
-            }
-            let compiled = compile_policy_regex(pattern, field);
-            guard.insert(key, compiled.clone());
-            compiled
-        }
-    }?;
-    Ok(compiled.is_match(haystack))
+    Ok(false) /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn validate_policy_regex_count(
     count: usize,
     field: &str,
     max: usize,
 ) -> Result<(), String> {
     if count > max {
