--- crates/chio-policy/src/regex_safety.rs
+++ replace >= with < in policy_regex_is_match
@@ -55,17 +55,17 @@
     let key = format!("{field}\0{pattern}");
     let compiled = {
         let mut guard = cache
             .lock()
             .map_err(|_| format!("{field} regex cache lock was poisoned"))?;
         if let Some(compiled) = guard.get(&key) {
             compiled.clone()
         } else {
-            if guard.len() >= POLICY_REGEX_CACHE_MAX_KEYS {
+            if guard.len() < /* ~ changed by cargo-mutants ~ */ POLICY_REGEX_CACHE_MAX_KEYS {
                 guard.clear();
             }
             let compiled = compile_policy_regex(pattern, field);
             guard.insert(key, compiled.clone());
             compiled
         }
     }?;
     Ok(compiled.is_match(haystack))
