--- crates/chio-policy/src/regex_safety.rs
+++ replace validate_policy_regex_count -> Result<(), String> with Ok(())
@@ -71,20 +71,17 @@
     Ok(compiled.is_match(haystack))
 }
 
 pub(crate) fn validate_policy_regex_count(
     count: usize,
     field: &str,
     max: usize,
 ) -> Result<(), String> {
-    if count > max {
-        return Err(format!("{field} allows at most {max} patterns"));
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn policy_regex_complexity(pattern: &str) -> usize {
     let mut score = 0usize;
     let mut escaped = false;
     for ch in pattern.chars() {
         if escaped {
             escaped = false;
