--- crates/chio-policy/src/regex_safety.rs
+++ replace policy_regex_complexity -> usize with 0
@@ -78,24 +78,10 @@
 ) -> Result<(), String> {
     if count > max {
         return Err(format!("{field} allows at most {max} patterns"));
     }
     Ok(())
 }
 
 fn policy_regex_complexity(pattern: &str) -> usize {
-    let mut score = 0usize;
-    let mut escaped = false;
-    for ch in pattern.chars() {
-        if escaped {
-            escaped = false;
-            continue;
-        }
-        match ch {
-            '\\' => escaped = true,
-            '|' | '*' | '+' | '?' => score = score.saturating_add(4),
-            '{' | '[' | '(' => score = score.saturating_add(2),
-            _ => {}
-        }
-    }
-    score
+    0 /* ~ changed by cargo-mutants ~ */
 }
