--- crates/chio-policy/src/regex_safety.rs
+++ delete match arm '{' | '[' | '(' in policy_regex_complexity
@@ -88,14 +88,14 @@
     for ch in pattern.chars() {
         if escaped {
             escaped = false;
             continue;
         }
         match ch {
             '\\' => escaped = true,
             '|' | '*' | '+' | '?' => score = score.saturating_add(4),
-            '{' | '[' | '(' => score = score.saturating_add(2),
+             /* ~ changed by cargo-mutants ~ */
             _ => {}
         }
     }
     score
 }
