--- crates/chio-policy/src/resolve.rs
+++ replace resolve_reference_path -> PathBuf with Default::default()
@@ -101,28 +101,17 @@
     let spec = load_spec_from_file(&canonical)?;
     Ok(LoadedSpec {
         source: canonical.to_string_lossy().into_owned(),
         spec,
     })
 }
 
 fn resolve_reference_path(reference: &str, from: Option<&str>) -> PathBuf {
-    let candidate = PathBuf::from(reference);
-    if candidate.is_absolute() {
-        return candidate;
-    }
-
-    match from
-        .map(PathBuf::from)
-        .and_then(|path| path.parent().map(Path::to_path_buf))
-    {
-        Some(parent) => parent.join(candidate),
-        None => candidate,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn canonical_path(path: &Path) -> Result<PathBuf, ResolveError> {
     fs::canonicalize(path).map_err(|error| ResolveError::Read {
         path: path.display().to_string(),
         message: error.to_string(),
     })
 }
