--- crates/chio-policy/src/resolve.rs
+++ replace canonical_path -> Result<PathBuf, ResolveError> with Ok(Default::default())
@@ -116,20 +116,17 @@
         .and_then(|path| path.parent().map(Path::to_path_buf))
     {
         Some(parent) => parent.join(candidate),
         None => candidate,
     }
 }
 
 fn canonical_path(path: &Path) -> Result<PathBuf, ResolveError> {
-    fs::canonicalize(path).map_err(|error| ResolveError::Read {
-        path: path.display().to_string(),
-        message: error.to_string(),
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn load_spec_from_file(path: &Path) -> Result<HushSpec, ResolveError> {
     let content = fs::read_to_string(path).map_err(|error| ResolveError::Read {
         path: path.display().to_string(),
         message: error.to_string(),
     })?;
     HushSpec::parse(&content).map_err(|error| ResolveError::Parse {
