--- crates/chio-policy/src/resolve.rs
+++ replace load_spec_from_file -> Result<HushSpec, ResolveError> with Ok(Default::default())
@@ -123,24 +123,17 @@
 fn canonical_path(path: &Path) -> Result<PathBuf, ResolveError> {
     fs::canonicalize(path).map_err(|error| ResolveError::Read {
         path: path.display().to_string(),
         message: error.to_string(),
     })
 }
 
 fn load_spec_from_file(path: &Path) -> Result<HushSpec, ResolveError> {
-    let content = fs::read_to_string(path).map_err(|error| ResolveError::Read {
-        path: path.display().to_string(),
-        message: error.to_string(),
-    })?;
-    HushSpec::parse(&content).map_err(|error| ResolveError::Parse {
-        path: path.display().to_string(),
-        message: error.to_string(),
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::models::{DefaultAction, EgressRule, ForbiddenPathsRule, Rules};
     use uuid::Uuid;
 
