--- crates/chio-policy/src/resolve.rs
+++ replace || with && in create_composite_loader
@@ -29,17 +29,17 @@
     #[error("could not resolve reference '{reference}': {message}")]
     NotFound { reference: String, message: String },
 }
 
 /// Create a composite loader that chains: builtin -> file.
 pub fn create_composite_loader() -> impl Fn(&str, Option<&str>) -> Result<LoadedSpec, ResolveError>
 {
     move |reference: &str, from: Option<&str>| -> Result<LoadedSpec, ResolveError> {
-        if reference.starts_with("https://") || reference.starts_with("http://") {
+        if reference.starts_with("https://") && /* ~ changed by cargo-mutants ~ */ reference.starts_with("http://") {
             return Err(ResolveError::Http {
                 message: "HTTP-based policy loading is not supported in chio-policy".to_string(),
             });
         }
 
         load_from_filesystem(reference, from)
     }
 }
