--- crates/chio-policy/src/resolve.rs
+++ replace resolve_with_loader -> Result<HushSpec, ResolveError> with Ok(Default::default())
@@ -48,21 +48,17 @@
 pub fn resolve_with_loader<F>(
     spec: &HushSpec,
     source: Option<&str>,
     loader: &F,
 ) -> Result<HushSpec, ResolveError>
 where
     F: Fn(&str, Option<&str>) -> Result<LoadedSpec, ResolveError>,
 {
-    let mut stack = Vec::new();
-    if let Some(source) = source {
-        stack.push(source.to_string());
-    }
-    resolve_inner(spec, source, loader, &mut stack)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve a HushSpec from a filesystem path, following `extends` chains.
 pub fn resolve_from_path(path: impl AsRef<Path>) -> Result<HushSpec, ResolveError> {
     let path = canonical_path(path.as_ref())?;
     let spec = load_spec_from_file(&path)?;
     resolve_with_loader(&spec, Some(&path.to_string_lossy()), &load_from_filesystem)
 }
