--- crates/chio-policy/src/validate.rs
+++ replace <= with > in validate_rules
@@ -99,17 +99,17 @@
                 &pattern.pattern,
                 &format!("rules.secret_patterns.patterns.{}", pattern.name),
                 errors,
             );
         }
     }
 
     if let Some(patch_integrity) = &rules.patch_integrity {
-        if patch_integrity.max_imbalance_ratio <= 0.0 {
+        if patch_integrity.max_imbalance_ratio > /* ~ changed by cargo-mutants ~ */ 0.0 {
             errors.push(ValidationError::Custom(
                 "rules.patch_integrity.max_imbalance_ratio must be > 0".to_string(),
             ));
         }
         validate_regex_count(
             patch_integrity.forbidden_patterns.len(),
             "rules.patch_integrity.forbidden_patterns",
             errors,
