--- crates/chio-policy/src/validate.rs
+++ replace validate_workload_identity_match with ()
@@ -161,41 +161,17 @@
     }
 }
 
 fn validate_workload_identity_match(
     rule: &crate::models::WorkloadIdentityMatch,
     field: &str,
     errors: &mut Vec<ValidationError>,
 ) {
-    if rule
-        .trust_domain
-        .as_deref()
-        .is_some_and(|value| value.trim().is_empty())
-    {
-        errors.push(ValidationError::Custom(format!(
-            "{field}.trust_domain must not be empty when provided"
-        )));
-    }
-
-    for (index, prefix) in rule.path_prefixes.iter().enumerate() {
-        if prefix.trim().is_empty() {
-            errors.push(ValidationError::Custom(format!(
-                "{field}.path_prefixes[{index}] must not be empty"
-            )));
-        } else if !prefix.starts_with('/') {
-            errors.push(ValidationError::Custom(format!(
-                "{field}.path_prefixes[{index}] must start with '/'"
-            )));
-        } else if prefix.contains("//") {
-            errors.push(ValidationError::Custom(format!(
-                "{field}.path_prefixes[{index}] must not contain empty path segments"
-            )));
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_posture(
     ext: &Extensions,
     errors: &mut Vec<ValidationError>,
     warnings: &mut Vec<String>,
 ) {
     if let Some(posture) = &ext.posture {
