--- crates/chio-policy/src/validate.rs
+++ delete ! in validate_workload_identity_match
@@ -176,17 +176,17 @@
         )));
     }
 
     for (index, prefix) in rule.path_prefixes.iter().enumerate() {
         if prefix.trim().is_empty() {
             errors.push(ValidationError::Custom(format!(
                 "{field}.path_prefixes[{index}] must not be empty"
             )));
-        } else if !prefix.starts_with('/') {
+        } else if  /* ~ changed by cargo-mutants ~ */prefix.starts_with('/') {
             errors.push(ValidationError::Custom(format!(
                 "{field}.path_prefixes[{index}] must start with '/'"
             )));
         } else if prefix.contains("//") {
             errors.push(ValidationError::Custom(format!(
                 "{field}.path_prefixes[{index}] must not contain empty path segments"
             )));
         }
