--- crates/chio-policy/src/validate.rs
+++ delete ! in validate_posture
@@ -209,17 +209,17 @@
             errors.push(ValidationError::Custom(format!(
                 "posture.initial '{}' does not reference a defined state",
                 posture.initial
             )));
         }
 
         for (state_name, state) in &posture.states {
             for capability in &state.capabilities {
-                if !matches!(
+                if  /* ~ changed by cargo-mutants ~ */matches!(
                     capability.as_str(),
                     "file_access"
                         | "file_write"
                         | "egress"
                         | "shell"
                         | "tool_call"
                         | "patch"
                         | "custom"
