--- crates/chio-policy/src/validate.rs
+++ replace < with == in validate_posture
@@ -226,17 +226,17 @@
                 ) {
                     warnings.push(format!(
                         "posture.states.{state_name}.capabilities includes unknown capability '{capability}'"
                     ));
                 }
             }
 
             for (budget_key, &value) in &state.budgets {
-                if value < 0 {
+                if value == /* ~ changed by cargo-mutants ~ */ 0 {
                     errors.push(ValidationError::Custom(format!(
                         "posture.states.{state_name}.budgets.{budget_key} must be non-negative, got {value}"
                     )));
                 }
                 if !matches!(
                     budget_key.as_str(),
                     "file_writes"
                         | "egress_calls"
