--- crates/chio-policy/src/validate.rs
+++ replace ValidationResult::is_valid -> bool with true
@@ -15,17 +15,17 @@
 pub struct ValidationResult {
     pub errors: Vec<ValidationError>,
     pub warnings: Vec<String>,
 }
 
 impl ValidationResult {
     #[must_use]
     pub fn is_valid(&self) -> bool {
-        self.errors.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, thiserror::Error)]
 pub enum ValidationError {
     #[error("unsupported hushspec version: {0}")]
     UnsupportedVersion(String),
     #[error("duplicate secret pattern name: {0}")]
