--- crates/chio-policy/src/validate.rs
+++ replace != with == in validate_posture
@@ -248,17 +248,17 @@
                     warnings.push(format!(
                         "posture.states.{state_name}.budgets uses unknown budget key '{budget_key}'"
                     ));
                 }
             }
         }
 
         for (index, transition) in posture.transitions.iter().enumerate() {
-            if transition.from != "*" && !posture.states.contains_key(&transition.from) {
+            if transition.from == /* ~ changed by cargo-mutants ~ */ "*" && !posture.states.contains_key(&transition.from) {
                 errors.push(ValidationError::Custom(format!(
                     "posture.transitions[{index}].from '{}' does not reference a defined state",
                     transition.from
                 )));
             }
             if transition.to == "*" {
                 errors.push(ValidationError::Custom(format!(
                     "posture.transitions[{index}].to cannot be '*'"
