--- crates/chio-policy/src/validate.rs
+++ replace == with != in validate_posture
@@ -254,17 +254,17 @@
 
         for (index, transition) in posture.transitions.iter().enumerate() {
             if transition.from != "*" && !posture.states.contains_key(&transition.from) {
                 errors.push(ValidationError::Custom(format!(
                     "posture.transitions[{index}].from '{}' does not reference a defined state",
                     transition.from
                 )));
             }
-            if transition.to == "*" {
+            if transition.to != /* ~ changed by cargo-mutants ~ */ "*" {
                 errors.push(ValidationError::Custom(format!(
                     "posture.transitions[{index}].to cannot be '*'"
                 )));
             } else if !posture.states.contains_key(&transition.to) {
                 errors.push(ValidationError::Custom(format!(
                     "posture.transitions[{index}].to '{}' does not reference a defined state",
                     transition.to
                 )));
