--- crates/chio-policy/src/validate.rs
+++ replace match guard is_valid_duration(after) with false in validate_posture
@@ -277,17 +277,17 @@
                             "posture.transitions[{index}].after must match ^\\d+[smhd]$"
                         )));
                     }
                 }
             }
 
             if transition.on == TransitionTrigger::Timeout {
                 match transition.after.as_deref() {
-                    Some(after) if is_valid_duration(after) => {}
+                    Some(after) if false /* ~ changed by cargo-mutants ~ */ => {}
                     Some(_) => errors.push(ValidationError::Custom(format!(
                         "posture.transitions[{index}].after must match ^\\d+[smhd]$"
                     ))),
                     None => errors.push(ValidationError::Custom(format!(
                         "posture.transitions[{index}]: timeout trigger requires 'after' field"
                     ))),
                 }
             }
