--- crates/chio-policy/src/validate.rs
+++ replace validate_detection with ()
@@ -295,93 +295,17 @@
     }
 }
 
 fn validate_detection(
     ext: &Extensions,
     errors: &mut Vec<ValidationError>,
     warnings: &mut Vec<String>,
 ) {
-    if let Some(detection) = &ext.detection {
-        if let Some(prompt_injection) = &detection.prompt_injection {
-            if matches!(prompt_injection.max_scan_bytes, Some(0)) {
-                errors.push(ValidationError::Custom(
-                    "detection.prompt_injection.max_scan_bytes must be >= 1".to_string(),
-                ));
-            }
-
-            let warn_level = prompt_injection
-                .warn_at_or_above
-                .unwrap_or(DetectionLevel::Suspicious);
-            let block_level = prompt_injection
-                .block_at_or_above
-                .unwrap_or(DetectionLevel::High);
-            if block_level < warn_level {
-                warnings.push(
-                    "detection.prompt_injection: block_at_or_above is less strict than warn_at_or_above"
-                        .to_string(),
-                );
-            }
-        }
-
-        if let Some(jailbreak) = &detection.jailbreak {
-            if matches!(jailbreak.block_threshold, Some(value) if value > 100) {
-                errors.push(ValidationError::Custom(
-                    "detection.jailbreak.block_threshold must be between 0 and 100".to_string(),
-                ));
-            }
-            if matches!(jailbreak.warn_threshold, Some(value) if value > 100) {
-                errors.push(ValidationError::Custom(
-                    "detection.jailbreak.warn_threshold must be between 0 and 100".to_string(),
-                ));
-            }
-            if matches!(jailbreak.max_input_bytes, Some(0)) {
-                errors.push(ValidationError::Custom(
-                    "detection.jailbreak.max_input_bytes must be >= 1".to_string(),
-                ));
-            }
-
-            let block_threshold = jailbreak.block_threshold.unwrap_or(80);
-            let warn_threshold = jailbreak.warn_threshold.unwrap_or(50);
-            if block_threshold < warn_threshold {
-                warnings.push(
-                    "detection.jailbreak: block_threshold is lower than warn_threshold".to_string(),
-                );
-            }
-        }
-
-        if let Some(threat_intel) = &detection.threat_intel {
-            match threat_intel.pattern_db.as_deref() {
-                Some(pattern_db) if pattern_db.trim().is_empty() => {
-                    errors.push(ValidationError::Custom(
-                        "detection.threat_intel.pattern_db must not be empty".to_string(),
-                    ));
-                }
-                None if threat_intel.enabled.unwrap_or(true) => {
-                    errors.push(ValidationError::Custom(
-                        "detection.threat_intel.pattern_db is required when enabled".to_string(),
-                    ));
-                }
-                _ => {}
-            }
-            if let Some(similarity_threshold) = threat_intel.similarity_threshold {
-                if !(0.0..=1.0).contains(&similarity_threshold) {
-                    errors.push(ValidationError::Custom(
-                        "detection.threat_intel.similarity_threshold must be between 0.0 and 1.0"
-                            .to_string(),
-                    ));
-                }
-            }
-            if matches!(threat_intel.top_k, Some(0)) {
-                errors.push(ValidationError::Custom(
-                    "detection.threat_intel.top_k must be >= 1".to_string(),
-                ));
-            }
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_reputation(
     ext: &Extensions,
     errors: &mut Vec<ValidationError>,
     warnings: &mut Vec<String>,
 ) {
     let Some(reputation) = &ext.reputation else {
