--- crates/chio-policy/src/validate.rs
+++ replace < with == in validate_detection
@@ -309,17 +309,17 @@
             }
 
             let warn_level = prompt_injection
                 .warn_at_or_above
                 .unwrap_or(DetectionLevel::Suspicious);
             let block_level = prompt_injection
                 .block_at_or_above
                 .unwrap_or(DetectionLevel::High);
-            if block_level < warn_level {
+            if block_level == /* ~ changed by cargo-mutants ~ */ warn_level {
                 warnings.push(
                     "detection.prompt_injection: block_at_or_above is less strict than warn_at_or_above"
                         .to_string(),
                 );
             }
         }
 
         if let Some(jailbreak) = &detection.jailbreak {
