--- crates/chio-policy/src/validate.rs
+++ replace match guard pattern_db.trim().is_empty() with true in validate_detection
@@ -345,17 +345,17 @@
                 warnings.push(
                     "detection.jailbreak: block_threshold is lower than warn_threshold".to_string(),
                 );
             }
         }
 
         if let Some(threat_intel) = &detection.threat_intel {
             match threat_intel.pattern_db.as_deref() {
-                Some(pattern_db) if pattern_db.trim().is_empty() => {
+                Some(pattern_db) if true /* ~ changed by cargo-mutants ~ */ => {
                     errors.push(ValidationError::Custom(
                         "detection.threat_intel.pattern_db must not be empty".to_string(),
                     ));
                 }
                 None if threat_intel.enabled.unwrap_or(true) => {
                     errors.push(ValidationError::Custom(
                         "detection.threat_intel.pattern_db is required when enabled".to_string(),
                     ));
