--- crates/chio-policy/src/validate.rs
+++ replace match guard threat_intel.enabled.unwrap_or(true) with false in validate_detection
@@ -350,17 +350,17 @@
 
         if let Some(threat_intel) = &detection.threat_intel {
             match threat_intel.pattern_db.as_deref() {
                 Some(pattern_db) if pattern_db.trim().is_empty() => {
                     errors.push(ValidationError::Custom(
                         "detection.threat_intel.pattern_db must not be empty".to_string(),
                     ));
                 }
-                None if threat_intel.enabled.unwrap_or(true) => {
+                None if false /* ~ changed by cargo-mutants ~ */ => {
                     errors.push(ValidationError::Custom(
                         "detection.threat_intel.pattern_db is required when enabled".to_string(),
                     ));
                 }
                 _ => {}
             }
             if let Some(similarity_threshold) = threat_intel.similarity_threshold {
                 if !(0.0..=1.0).contains(&similarity_threshold) {
