--- crates/chio-policy/src/validate.rs
+++ delete ! in validate_reputation
@@ -399,17 +399,17 @@
             if days == 0 {
                 errors.push(ValidationError::Custom(
                     "extensions.reputation.scoring.temporal_decay_half_life_days must be >= 1"
                         .to_string(),
                 ));
             }
         }
         if let Some(ceiling) = scoring.probationary_score_ceiling {
-            if !(0.0..=1.0).contains(&ceiling) {
+            if  /* ~ changed by cargo-mutants ~ */(0.0..=1.0).contains(&ceiling) {
                 errors.push(ValidationError::Custom(
                     "extensions.reputation.scoring.probationary_score_ceiling must be in [0.0, 1.0]"
                         .to_string(),
                 ));
             }
         }
         if let Some(weights) = &scoring.weights {
             validate_weight(
