--- crates/chio-policy/src/validate.rs
+++ replace validate -> ValidationResult with Default::default()
@@ -37,55 +37,17 @@
         message: String,
     },
     #[error("{0}")]
     Custom(String),
 }
 
 #[must_use = "validation result should be checked"]
 pub fn validate(spec: &HushSpec) -> ValidationResult {
-    let mut errors = Vec::new();
-    let mut warnings = Vec::new();
-
-    if !version::is_supported(&spec.hushspec) {
-        errors.push(ValidationError::UnsupportedVersion(spec.hushspec.clone()));
-    }
-
-    if let Some(rules) = &spec.rules {
-        validate_rules(rules, &mut errors);
-
-        if rules.forbidden_paths.is_none()
-            && rules.path_allowlist.is_none()
-            && rules.egress.is_none()
-            && rules.secret_patterns.is_none()
-            && rules.patch_integrity.is_none()
-            && rules.shell_commands.is_none()
-            && rules.tool_access.is_none()
-            && rules.computer_use.is_none()
-            && rules.remote_desktop_channels.is_none()
-            && rules.input_injection.is_none()
-            && rules.browser_automation.is_none()
-            && rules.code_execution.is_none()
-            && rules.velocity.is_none()
-            && rules.human_in_loop.is_none()
-        {
-            warnings.push("no rules configured".to_string());
-        }
-    } else {
-        warnings.push("no rules section present".to_string());
-    }
-
-    if let Some(ext) = &spec.extensions {
-        validate_posture(ext, &mut errors, &mut warnings);
-        validate_detection(ext, &mut errors, &mut warnings);
-        validate_reputation(ext, &mut errors, &mut warnings);
-        validate_runtime_assurance(ext, &mut errors);
-    }
-
-    ValidationResult { errors, warnings }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_rules(rules: &Rules, errors: &mut Vec<ValidationError>) {
     if let Some(secret_patterns) = &rules.secret_patterns {
         validate_regex_count(
             secret_patterns.patterns.len(),
             "rules.secret_patterns.patterns",
             errors,
