--- crates/chio-policy/src/validate.rs
+++ delete ! in validate
@@ -40,17 +40,17 @@
     Custom(String),
 }
 
 #[must_use = "validation result should be checked"]
 pub fn validate(spec: &HushSpec) -> ValidationResult {
     let mut errors = Vec::new();
     let mut warnings = Vec::new();
 
-    if !version::is_supported(&spec.hushspec) {
+    if  /* ~ changed by cargo-mutants ~ */version::is_supported(&spec.hushspec) {
         errors.push(ValidationError::UnsupportedVersion(spec.hushspec.clone()));
     }
 
     if let Some(rules) = &spec.rules {
         validate_rules(rules, &mut errors);
 
         if rules.forbidden_paths.is_none()
             && rules.path_allowlist.is_none()
