--- crates/chio-policy/src/validate.rs
+++ delete ! in validate_runtime_assurance
@@ -558,17 +558,17 @@
                 )));
             }
         }
 
         let canonical_binding = (
             rule.schema.trim().to_string(),
             canonicalize_attestation_verifier(&rule.verifier),
         );
-        if !seen_trusted_verifiers.insert(canonical_binding) {
+        if  /* ~ changed by cargo-mutants ~ */seen_trusted_verifiers.insert(canonical_binding) {
             errors.push(ValidationError::Custom(format!(
                 "extensions.runtime_assurance.trusted_verifiers duplicates schema/verifier binding for {} {}",
                 rule.schema.trim(),
                 rule.verifier.trim()
             )));
         }
     }
 }
