--- crates/chio-policy/src/validate.rs
+++ replace && with || in validate
@@ -48,17 +48,17 @@
     if !version::is_supported(&spec.hushspec) {
         errors.push(ValidationError::UnsupportedVersion(spec.hushspec.clone()));
     }
 
     if let Some(rules) = &spec.rules {
         validate_rules(rules, &mut errors);
 
         if rules.forbidden_paths.is_none()
-            && rules.path_allowlist.is_none()
+            || /* ~ changed by cargo-mutants ~ */ rules.path_allowlist.is_none()
             && rules.egress.is_none()
             && rules.secret_patterns.is_none()
             && rules.patch_integrity.is_none()
             && rules.shell_commands.is_none()
             && rules.tool_access.is_none()
             && rules.computer_use.is_none()
             && rules.remote_desktop_channels.is_none()
             && rules.input_injection.is_none()
