--- crates/chio-policy/src/validate.rs
+++ replace validate_weight with ()
@@ -569,23 +569,17 @@
                 rule.schema.trim(),
                 rule.verifier.trim()
             )));
         }
     }
 }
 
 fn validate_weight(value: Option<f64>, field: &str, errors: &mut Vec<ValidationError>) {
-    if let Some(weight) = value {
-        if !(0.0..=1.0).contains(&weight) {
-            errors.push(ValidationError::Custom(format!(
-                "{field} must be in [0.0, 1.0]"
-            )));
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_regex(pattern: &str, path: &str, errors: &mut Vec<ValidationError>) {
     if let Err(error) = compile_policy_regex(pattern, path) {
         errors.push(ValidationError::InvalidRegex {
             field: path.to_string(),
             pattern: pattern.to_string(),
             message: error,
