--- crates/chio-policy/src/validate.rs
+++ delete ! in validate_weight
@@ -570,17 +570,17 @@
                 rule.verifier.trim()
             )));
         }
     }
 }
 
 fn validate_weight(value: Option<f64>, field: &str, errors: &mut Vec<ValidationError>) {
     if let Some(weight) = value {
-        if !(0.0..=1.0).contains(&weight) {
+        if  /* ~ changed by cargo-mutants ~ */(0.0..=1.0).contains(&weight) {
             errors.push(ValidationError::Custom(format!(
                 "{field} must be in [0.0, 1.0]"
             )));
         }
     }
 }
 
 fn validate_regex(pattern: &str, path: &str, errors: &mut Vec<ValidationError>) {
