--- crates/chio-policy/src/validate.rs
+++ replace validate_regex with ()
@@ -579,23 +579,17 @@
             errors.push(ValidationError::Custom(format!(
                 "{field} must be in [0.0, 1.0]"
             )));
         }
     }
 }
 
 fn validate_regex(pattern: &str, path: &str, errors: &mut Vec<ValidationError>) {
-    if let Err(error) = compile_policy_regex(pattern, path) {
-        errors.push(ValidationError::InvalidRegex {
-            field: path.to_string(),
-            pattern: pattern.to_string(),
-            message: error,
-        });
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_regex_count(count: usize, path: &str, errors: &mut Vec<ValidationError>) {
     if let Err(error) = validate_policy_regex_count(count, path, MAX_POLICY_DENYLIST_PATTERNS) {
         errors.push(ValidationError::Custom(error));
     }
 }
 
