--- crates/chio-policy/src/validate.rs
+++ replace validate_regex_count with ()
@@ -589,19 +589,17 @@
             field: path.to_string(),
             pattern: pattern.to_string(),
             message: error,
         });
     }
 }
 
 fn validate_regex_count(count: usize, path: &str, errors: &mut Vec<ValidationError>) {
-    if let Err(error) = validate_policy_regex_count(count, path, MAX_POLICY_DENYLIST_PATTERNS) {
-        errors.push(ValidationError::Custom(error));
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_valid_duration(value: &str) -> bool {
     matches!(
         value.as_bytes(),
         [b'0'..=b'9', .., b's' | b'm' | b'h' | b'd']
     ) && value[..value.len() - 1]
         .bytes()
