--- crates/chio-policy/src/validate.rs
+++ replace && with || in validate
@@ -57,17 +57,17 @@
             && rules.egress.is_none()
             && rules.secret_patterns.is_none()
             && rules.patch_integrity.is_none()
             && rules.shell_commands.is_none()
             && rules.tool_access.is_none()
             && rules.computer_use.is_none()
             && rules.remote_desktop_channels.is_none()
             && rules.input_injection.is_none()
-            && rules.browser_automation.is_none()
+            || /* ~ changed by cargo-mutants ~ */ rules.browser_automation.is_none()
             && rules.code_execution.is_none()
             && rules.velocity.is_none()
             && rules.human_in_loop.is_none()
         {
             warnings.push("no rules configured".to_string());
         }
     } else {
         warnings.push("no rules section present".to_string());
