--- crates/chio-weights/src/card.rs
+++ replace StringSet::as_set -> &BTreeSet<String> with Box::leak(Box::new(BTreeSet::new()))
@@ -115,17 +115,17 @@
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.0.is_empty()
     }
 
     /// Borrow the underlying `BTreeSet` (canonical iteration order).
     #[must_use]
     pub fn as_set(&self) -> &BTreeSet<String> {
-        &self.0
+        Box::leak(Box::new(BTreeSet::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     fn contains_empty(&self) -> bool {
         self.0.iter().any(String::is_empty)
     }
 }
 
 /// Signed declaration binding a model's loaded weights to a permitted
