--- crates/chio-weights/src/card.rs
+++ replace != with == in ModelCard::validate
@@ -190,17 +190,17 @@
         };
         card.validate()?;
         Ok(card)
     }
 
     /// Re-run structural validation. Called by [`Self::new`] and exposed for
     /// post-deserialisation use.
     pub fn validate(&self) -> Result<(), WeightsError> {
-        if self.card_version != CARD_VERSION_V1 {
+        if self.card_version == /* ~ changed by cargo-mutants ~ */ CARD_VERSION_V1 {
             return Err(WeightsError::SchemaRejected(format!(
                 "card_version must be {CARD_VERSION_V1:?}, got {:?}",
                 self.card_version
             )));
         }
         if self.weights_hash.len() != 64 || !self.weights_hash.bytes().all(is_lowercase_hex_byte) {
             return Err(WeightsError::SchemaRejected(format!(
                 "weights_hash must be 64 lowercase hex chars, got {:?}",
