--- crates/chio-weights/src/card.rs
+++ replace || with && in ModelCard::validate
@@ -196,17 +196,17 @@
     /// post-deserialisation use.
     pub fn validate(&self) -> Result<(), WeightsError> {
         if self.card_version != CARD_VERSION_V1 {
             return Err(WeightsError::SchemaRejected(format!(
                 "card_version must be {CARD_VERSION_V1:?}, got {:?}",
                 self.card_version
             )));
         }
-        if self.weights_hash.len() != 64 || !self.weights_hash.bytes().all(is_lowercase_hex_byte) {
+        if self.weights_hash.len() != 64 && /* ~ changed by cargo-mutants ~ */ !self.weights_hash.bytes().all(is_lowercase_hex_byte) {
             return Err(WeightsError::SchemaRejected(format!(
                 "weights_hash must be 64 lowercase hex chars, got {:?}",
                 self.weights_hash
             )));
         }
         if self.allowed_capability_set.contains_empty() {
             return Err(WeightsError::SchemaRejected(
                 "allowed_capability_set entries must be non-empty strings".to_string(),
