--- crates/chio-weights/src/card.rs
+++ replace < with <= in ModelCard::require_live
@@ -229,17 +229,17 @@
                 self.expires_at, self.issued_at,
             )));
         }
         Ok(())
     }
 
     /// Verifier-side liveness check.
     pub fn require_live(&self, now: DateTime<Utc>) -> Result<(), WeightsError> {
-        if now < self.expires_at {
+        if now <= /* ~ changed by cargo-mutants ~ */ self.expires_at {
             Ok(())
         } else {
             Err(WeightsError::Expired {
                 expires_at: self.expires_at,
                 now,
             })
         }
     }
