--- crates/chio-weights/src/card.rs
+++ replace ModelCard::require_live -> Result<(), WeightsError> with Ok(())
@@ -229,24 +229,17 @@
                 self.expires_at, self.issued_at,
             )));
         }
         Ok(())
     }
 
     /// Verifier-side liveness check.
     pub fn require_live(&self, now: DateTime<Utc>) -> Result<(), WeightsError> {
-        if now < self.expires_at {
-            Ok(())
-        } else {
-            Err(WeightsError::Expired {
-                expires_at: self.expires_at,
-                now,
-            })
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Encode to canonical JSON bytes (RFC 8785 / JCS). Deterministic across
     /// any compliant implementation.
     pub fn to_canonical_json(&self) -> Result<Vec<u8>, WeightsError> {
         chio_core_types::canonical::canonical_json_bytes(self)
             .map_err(|err| WeightsError::Encoding(format!("canonical-json encode: {err}")))
     }
