--- crates/chio-weights/src/card.rs
+++ replace ModelCard::from_canonical_json -> Result<Self, WeightsError> with Ok(Default::default())
@@ -249,26 +249,17 @@
     pub fn to_canonical_json(&self) -> Result<Vec<u8>, WeightsError> {
         chio_core_types::canonical::canonical_json_bytes(self)
             .map_err(|err| WeightsError::Encoding(format!("canonical-json encode: {err}")))
     }
 
     /// Decode from canonical JSON bytes. Round-trip with
     /// [`Self::to_canonical_json`]. Validates after deserialisation.
     pub fn from_canonical_json(bytes: &[u8]) -> Result<Self, WeightsError> {
-        let card: Self = serde_json::from_slice(bytes)
-            .map_err(|err| WeightsError::Encoding(format!("canonical-json decode: {err}")))?;
-        card.validate()?;
-        let canonical = card.to_canonical_json()?;
-        if canonical.as_slice() != bytes {
-            return Err(WeightsError::Encoding(
-                "model card bytes are not RFC 8785 canonical JSON".to_string(),
-            ));
-        }
-        Ok(card)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Compute the lowercase hex SHA-256 of a byte slice. Used by the kernel
 /// binding refusal path to recompute `weights_hash` from a loaded
 /// weights blob.
 #[must_use]
 pub fn weights_hash_of(bytes: &[u8]) -> String {
