--- crates/chio-weights/src/card.rs
+++ replace != with == in ModelCard::from_canonical_json
@@ -253,17 +253,17 @@
 
     /// Decode from canonical JSON bytes. Round-trip with
     /// [`Self::to_canonical_json`]. Validates after deserialisation.
     pub fn from_canonical_json(bytes: &[u8]) -> Result<Self, WeightsError> {
         let card: Self = serde_json::from_slice(bytes)
             .map_err(|err| WeightsError::Encoding(format!("canonical-json decode: {err}")))?;
         card.validate()?;
         let canonical = card.to_canonical_json()?;
-        if canonical.as_slice() != bytes {
+        if canonical.as_slice() == /* ~ changed by cargo-mutants ~ */ bytes {
             return Err(WeightsError::Encoding(
                 "model card bytes are not RFC 8785 canonical JSON".to_string(),
             ));
         }
         Ok(card)
     }
 }
 
