--- crates/chio-weights/src/card.rs
+++ replace is_lowercase_hex_byte -> bool with true
@@ -273,17 +273,17 @@
 #[must_use]
 pub fn weights_hash_of(bytes: &[u8]) -> String {
     let digest = Sha256::digest(bytes);
     hex::encode(digest)
 }
 
 #[inline]
 fn is_lowercase_hex_byte(b: u8) -> bool {
-    matches!(b, b'0'..=b'9' | b'a'..=b'f')
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use chrono::TimeZone;
 
     fn fixed_issued_at() -> DateTime<Utc> {
