--- crates/chio-weights/src/card.rs
+++ replace <impl Deserialize<'de> for StringSet>::deserialize -> Result<Self, D::Error> with Ok(Default::default())
@@ -47,32 +47,17 @@
 #[serde(transparent)]
 pub struct StringSet(BTreeSet<String>);
 
 impl<'de> Deserialize<'de> for StringSet {
     fn deserialize<D>(deserializer: D) -> Result<Self, D::Error>
     where
         D: Deserializer<'de>,
     {
-        let items = Vec::<String>::deserialize(deserializer)?;
-        let mut set = BTreeSet::new();
-        for item in items {
-            if item.is_empty() {
-                return Err(de::Error::custom(
-                    "string set entries must be non-empty strings",
-                ));
-            }
-            if set.contains(&item) {
-                return Err(de::Error::custom(format!(
-                    "duplicate string set entry {item:?}"
-                )));
-            }
-            set.insert(item);
-        }
-        Ok(Self(set))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl StringSet {
     /// Build a [`StringSet`] from any iterable. Duplicates are deduplicated;
     /// final order is lexicographic per `BTreeSet`.
     pub fn new<I, S>(items: I) -> Self
     where
