--- crates/chio-weights/src/card.rs
+++ replace StringSet::intersects -> bool with true
@@ -86,17 +86,17 @@
     #[must_use]
     pub fn covers(&self, subset: &StringSet) -> bool {
         subset.0.is_subset(&self.0)
     }
 
     /// True if `self` and `other` share at least one element.
     #[must_use]
     pub fn intersects(&self, other: &StringSet) -> bool {
-        self.0.intersection(&other.0).next().is_some()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// True if `self` contains the given item.
     #[must_use]
     pub fn contains(&self, item: &str) -> bool {
         self.0.contains(item)
     }
 
