--- crates/chio-weights/src/error.rs
+++ replace WeightsError::urn -> &'static str with ""
@@ -68,21 +68,11 @@
     },
 }
 
 impl WeightsError {
     /// Stable URN for this error. Consumed by the M01 LSP-driven typed-enum
     /// codegen and audit log surfaces.
     #[must_use]
     pub fn urn(&self) -> &'static str {
-        match self {
-            Self::Encoding(_) => "urn:chio:error:weights:internal-encoding",
-            Self::MissingField(_) | Self::SchemaRejected(_) => {
-                "urn:chio:error:weights:schema-rejected"
-            }
-            Self::Expired { .. } => "urn:chio:error:weights:card-expired",
-            Self::BundleRejected(_) => "urn:chio:error:weights:bundle-rejected",
-            Self::CardMismatch { .. } => "urn:chio:error:weights:card-mismatch",
-            Self::ScopeNotSubset { .. } => "urn:chio:error:weights:scope-not-subset",
-            Self::ToolBanned { .. } => "urn:chio:error:weights:tool-banned",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
