--- crates/chio-weights/src/lineage.rs
+++ replace anchor_projection_bytes -> Result<Vec<u8>, WeightsError> with Ok(vec![1])
@@ -116,33 +116,17 @@
 /// the same inputs produce byte-identical bytes.
 ///
 /// Exposed for tests and for external indexers that want to recompute the
 /// expected digest without depending on the entire `chio-weights` build.
 pub fn anchor_projection_bytes(
     card_bytes: &[u8],
     attestation: &chio_attest_verify::VerifiedAttestation,
 ) -> Result<Vec<u8>, WeightsError> {
-    let card_sha = sha256_hex(card_bytes);
-    let subject_sha = hex::encode(attestation.subject_digest_sha256);
-    // Use serde_json's BTreeMap-equivalent: build a sorted Map by hand to
-    // preserve byte stability without depending on a canonical-JSON crate
-    // here. The keys below are listed in lexicographic order so the
-    // emitted JSON is canonical at the top level.
-    let payload = serde_json::json!({
-        "card_canonical_sha256": card_sha,
-        "certificate_identity": attestation.certificate_identity,
-        "certificate_oidc_issuer": attestation.certificate_oidc_issuer,
-        "rekor_inclusion_verified": attestation.rekor_inclusion_verified,
-        "rekor_log_index": attestation.rekor_log_index,
-        "schema_version": MODEL_CARD_ANCHOR_SCHEMA,
-        "subject_digest_sha256": subject_sha,
-    });
-    chio_core_types::canonical::canonical_json_bytes(&payload)
-        .map_err(|err| WeightsError::Encoding(format!("anchor projection encode: {err}")))
+    Ok(vec![1]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// SHA-256 hex of a byte slice. Mirrors the lineage anchor surface so the
 /// digest representation is consistent across both anchor formats.
 fn sha256_hex(bytes: &[u8]) -> String {
     let digest = Sha256::digest(bytes);
     hex::encode(digest)
 }
