--- crates/chio-weights/src/lineage.rs
+++ replace != with == in verify_model_card_anchor
@@ -214,17 +214,17 @@
 /// does not match `anchor.digest`. Consumers reading an anchor from the
 /// public registry call this to verify the proof against the original
 /// inputs without trusting the registry's stored digest.
 pub fn verify_model_card_anchor(
     anchor: &ModelCardLineageAnchor,
     card_bytes: &[u8],
     attestation: &chio_attest_verify::VerifiedAttestation,
 ) -> Result<(), WeightsError> {
-    if anchor.schema_version != MODEL_CARD_ANCHOR_SCHEMA {
+    if anchor.schema_version == /* ~ changed by cargo-mutants ~ */ MODEL_CARD_ANCHOR_SCHEMA {
         return Err(WeightsError::SchemaRejected(format!(
             "model card anchor schema_version must be {MODEL_CARD_ANCHOR_SCHEMA:?}, got {:?}",
             anchor.schema_version
         )));
     }
     if anchor.digest.algo != "sha256" {
         return Err(WeightsError::SchemaRejected(format!(
             "model card anchor digest algo must be \"sha256\", got {:?}",
