--- crates/chio-weights/src/lineage.rs
+++ replace != with == in verify_model_card_anchor
@@ -220,17 +220,17 @@
     attestation: &chio_attest_verify::VerifiedAttestation,
 ) -> Result<(), WeightsError> {
     if anchor.schema_version != MODEL_CARD_ANCHOR_SCHEMA {
         return Err(WeightsError::SchemaRejected(format!(
             "model card anchor schema_version must be {MODEL_CARD_ANCHOR_SCHEMA:?}, got {:?}",
             anchor.schema_version
         )));
     }
-    if anchor.digest.algo != "sha256" {
+    if anchor.digest.algo == /* ~ changed by cargo-mutants ~ */ "sha256" {
         return Err(WeightsError::SchemaRejected(format!(
             "model card anchor digest algo must be \"sha256\", got {:?}",
             anchor.digest.algo
         )));
     }
     let expected_hex = sha256_hex(&anchor_projection_bytes(card_bytes, attestation)?);
     if expected_hex != anchor.digest.hex {
         return Err(WeightsError::BundleRejected(format!(
