--- crates/chio-weights/src/lineage.rs
+++ replace != with == in verify_model_card_anchor
@@ -227,17 +227,17 @@
     }
     if anchor.digest.algo != "sha256" {
         return Err(WeightsError::SchemaRejected(format!(
             "model card anchor digest algo must be \"sha256\", got {:?}",
             anchor.digest.algo
         )));
     }
     let expected_hex = sha256_hex(&anchor_projection_bytes(card_bytes, attestation)?);
-    if expected_hex != anchor.digest.hex {
+    if expected_hex == /* ~ changed by cargo-mutants ~ */ anchor.digest.hex {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor digest mismatch: expected {expected_hex}, got {}",
             anchor.digest.hex
         )));
     }
     let card_sha = sha256_hex(card_bytes);
     if card_sha != anchor.card_canonical_sha256 {
         return Err(WeightsError::BundleRejected(format!(
