--- crates/chio-weights/src/lineage.rs
+++ replace != with == in verify_model_card_anchor
@@ -247,17 +247,17 @@
     }
     let expected_subject_sha = hex::encode(attestation.subject_digest_sha256);
     if expected_subject_sha != anchor.attestation_subject_sha256 {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor attestation_subject_sha256 mismatch: expected {expected_subject_sha}, got {}",
             anchor.attestation_subject_sha256
         )));
     }
-    if attestation.certificate_identity != anchor.certificate_identity {
+    if attestation.certificate_identity == /* ~ changed by cargo-mutants ~ */ anchor.certificate_identity {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor certificate_identity mismatch: expected {:?}, got {:?}",
             attestation.certificate_identity, anchor.certificate_identity
         )));
     }
     if attestation.certificate_oidc_issuer != anchor.certificate_oidc_issuer {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor certificate_oidc_issuer mismatch: expected {:?}, got {:?}",
