--- crates/chio-weights/src/lineage.rs
+++ replace != with == in verify_model_card_anchor
@@ -253,17 +253,17 @@
         )));
     }
     if attestation.certificate_identity != anchor.certificate_identity {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor certificate_identity mismatch: expected {:?}, got {:?}",
             attestation.certificate_identity, anchor.certificate_identity
         )));
     }
-    if attestation.certificate_oidc_issuer != anchor.certificate_oidc_issuer {
+    if attestation.certificate_oidc_issuer == /* ~ changed by cargo-mutants ~ */ anchor.certificate_oidc_issuer {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor certificate_oidc_issuer mismatch: expected {:?}, got {:?}",
             attestation.certificate_oidc_issuer, anchor.certificate_oidc_issuer
         )));
     }
     if attestation.rekor_log_index != anchor.rekor_log_index {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor rekor_log_index mismatch: expected {}, got {}",
