--- crates/chio-weights/src/lineage.rs
+++ replace != with == in verify_model_card_anchor
@@ -259,17 +259,17 @@
         )));
     }
     if attestation.certificate_oidc_issuer != anchor.certificate_oidc_issuer {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor certificate_oidc_issuer mismatch: expected {:?}, got {:?}",
             attestation.certificate_oidc_issuer, anchor.certificate_oidc_issuer
         )));
     }
-    if attestation.rekor_log_index != anchor.rekor_log_index {
+    if attestation.rekor_log_index == /* ~ changed by cargo-mutants ~ */ anchor.rekor_log_index {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor rekor_log_index mismatch: expected {}, got {}",
             attestation.rekor_log_index, anchor.rekor_log_index
         )));
     }
     if attestation.rekor_inclusion_verified != anchor.rekor_inclusion_verified {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor rekor_inclusion_verified mismatch: expected {}, got {}",
