--- crates/chio-weights/src/lineage.rs
+++ replace != with == in verify_model_card_anchor
@@ -265,17 +265,17 @@
         )));
     }
     if attestation.rekor_log_index != anchor.rekor_log_index {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor rekor_log_index mismatch: expected {}, got {}",
             attestation.rekor_log_index, anchor.rekor_log_index
         )));
     }
-    if attestation.rekor_inclusion_verified != anchor.rekor_inclusion_verified {
+    if attestation.rekor_inclusion_verified == /* ~ changed by cargo-mutants ~ */ anchor.rekor_inclusion_verified {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor rekor_inclusion_verified mismatch: expected {}, got {}",
             attestation.rekor_inclusion_verified, anchor.rekor_inclusion_verified
         )));
     }
 
     // Defense-in-depth: no local verifier is wired for lineage signature
     // payloads yet. Reject every imported Signed state so arbitrary hex
