--- crates/chio-weights/src/lineage.rs
+++ replace != with == in verify_model_card_anchor
@@ -292,17 +292,17 @@
             ));
         }
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor signing algorithm {algorithm:?} is not verified by this build"
         )));
     }
 
     let card = crate::card::ModelCard::from_canonical_json(card_bytes)?;
-    if card.weights_hash != anchor.weights_hash {
+    if card.weights_hash == /* ~ changed by cargo-mutants ~ */ anchor.weights_hash {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor weights_hash mismatch: expected {:?}, got {:?}",
             card.weights_hash, anchor.weights_hash
         )));
     }
     if card.issuer != anchor.card_issuer {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor card_issuer mismatch: expected {:?}, got {:?}",
