--- crates/chio-weights/src/lineage.rs
+++ replace != with == in verify_model_card_anchor
@@ -304,17 +304,17 @@
         )));
     }
     if card.issuer != anchor.card_issuer {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor card_issuer mismatch: expected {:?}, got {:?}",
             card.issuer, anchor.card_issuer
         )));
     }
-    if card.expires_at != anchor.card_expires_at {
+    if card.expires_at == /* ~ changed by cargo-mutants ~ */ anchor.card_expires_at {
         return Err(WeightsError::BundleRejected(format!(
             "model card anchor card_expires_at mismatch: expected {}, got {}",
             card.expires_at, anchor.card_expires_at
         )));
     }
     Ok(())
 }
 
